[{"company": "ELEVAI Labs Inc", "symbol": "ELAB", "statement": "Elevai Labs, Inc. (ELAB) has seen its stock plummet to a 52-week low of $1.58, with a market valuation of $5.22 million. The company, which develops skincare products, including Empower and Enfinity serums, has faced a challenging period. While its products are undervalued at current levels, its financial health score remains weak. Additionally, the company has engaged a contract research organization to support regulatory planning efforts for its EL-22 product.", "keywords": ["stock", "products", "valuation", "planning", "health", "regulatory", "financial", "skincare", "serums"], "sentiment": "negative", "upside": -440.6, "linked": [], "volume": 76778720.0, "introduction": "Elevai Labs, Inc. (ELAB) has seen its stock drop to a 52-week low of $1.58, with a market valuation of $5.22 million, despite its products being undervalued, due to its weak financial health and need for regulatory planning support.", "update": "2025-02-28", "current": 3.1, "category": "stock"}, {"company": "NVIDIA Corp", "symbol": "NVDA", "statement": "ASUS is participating as a Diamond Sponsor in NVIDIA's GTC 2025 conference, showcasing its AI and IoT solutions. NVIDIA's AI future is promising, with its GPUs driving growth in gaming, professional visualization, and AI. Several companies, including PromptX, Cisco, and Southern California Edison Company, are leveraging NVIDIA's AI solutions to transform their industries. NVIDIA itself reported record earnings in Q4 2025, driven by surging AI demand. The company is also extending its partnership with Cisco to accelerate AI adoption, and is working with RADCOM to develop a next-generation networking data plane analytics solution.", "keywords": ["gaming", "transformation", "intelligence", "gpu", "partnership", "solution", "artificial", "conference", "analytics", "sponsor", "visualization", "industry", "earnings", "networking"], "sentiment": "positive", "upside": -54.9, "linked": [], "volume": 232797900.0, "introduction": "ASUS is participating as a Diamond Sponsor in NVIDIA's GTC 2025 conference, showcasing its AI and IoT solutions, while NVIDIA reports record earnings driven by surging AI demand.", "update": "2025-02-28", "current": 142.62, "category": "stock"}, {"company": "Ocean Power Technologies Inc", "symbol": "OPTT", "statement": "Ocean Power Technologies (OPT) has successfully demonstrated its defense and security capabilities during NAVDEX in Abu Dhabi with Remah International Group (RIG). The company showcased its advanced maritime defense systems, which leverage low-carbon marine power, data, and service solutions. The demonstrations were conducted to expand OPT's strategic presence in the region. The company's CEO, Philipp Stratmann, joined a live interview to discuss the successful demonstrations, highlighting the importance of cost-effective and innovative solutions for the defense industry.", "keywords": ["ceo", "data", "presence", "low-carbon", "carbon", "power", "defense", "maritime", "energy", "strategic", "innovation", "security", "services", "marine", "technologies", "interview", "solutions", "industry", "sustainability"], "sentiment": "positive", "upside": -201.8, "linked": [], "volume": 17324848.0, "introduction": "Ocean Power Technologies (OPT) demonstrated its defense and security capabilities at NAVDEX in Abu Dhabi, showcasing advanced maritime defense systems leveraging low-carbon marine power, data, and services.", "update": "2025-02-28", "current": 0.84, "category": "stock"}, {"company": "Marathon Digital Holdings Inc", "symbol": "MARA", "statement": "Marathon Digital Holdings, a digital asset technology company, has undergone a significant transformation under the leadership of CEO Fred Thiel, shifting from an asset-light model to a vertically integrated powerhouse. The company reported record revenue of $214.4 million and earnings of $1.24 per share, doubling from last year. Marathon increased its bitcoin holdings by 197% and secured 300% more energy capacity, expanding its total energy portfolio to 1.7 GW. The company's hybrid strategy of mining and market purchases of bitcoin has been successful, with the price of bitcoin rallying. As a result, MARA Holdings' stock has seen significant growth, with analysts predicting further growth in the future.", "keywords": ["digital", "stock", "transformation", "portfolio", "growth", "bitcoin", "holdings", "strategy", "technology", "energy", "revenue", "earnings", "leadership"], "sentiment": "positive", "upside": -57.7, "linked": [], "volume": 45912380.0, "introduction": "Marathon Digital Holdings, under CEO Fred Thiel, transformed into a vertically integrated powerhouse, reporting record revenue and earnings, and expanding its bitcoin holdings and energy capacity, driving significant stock growth.", "update": "2025-02-28", "current": 19.99, "category": "stock"}, {"company": "Super Micro Computer Inc", "symbol": "SMCI", "statement": "Supermicro, a global leader in application-optimized IT solutions, is expanding its US manufacturing capacity and development in Silicon Valley, creating hundreds of new jobs across engineering, production, and corporate roles. The company is focused on building block liquid-cooled solutions for AI factories and HPC markets, aiming to reduce carbon footprint and save costs for data centers. With its strong commitment to innovation and talent development, Supermicro is driving long-term economic growth and pushing forward with a major expansion, filing its delayed 10-K and 10-Q reports, and experiencing a surge in stock price due to its positive outlook and growth prospects.", "keywords": ["ai", "growth", "production", "outlook", "carbon", "hpc", "jobs", "expansion", "talent", "engineering", "liquid-cooled", "innovation", "manufacturing", "footprint", "economic", "prospects", "corporate", "solutions", "costs"], "sentiment": "positive", "upside": 55.0, "linked": [], "volume": 31511748.0, "introduction": "Supermicro, a leading IT solutions provider, is expanding its US manufacturing and development in Silicon Valley, creating hundreds of new jobs and focusing on building energy-efficient liquid-cooled solutions for AI and HPC markets.", "update": "2025-02-28", "current": 33.27, "category": "stock"}, {"company": "Archer Aviation Inc", "symbol": "ACHR", "statement": "Archer Aviation, a company that develops electric vertical takeoff and landing (eVTOL) aircraft, has announced its fourth quarter and full year 2024 results, with its stock price fluctuating in response to various developments. The company has announced a \"Launch Edition\" commercialization program for its Midnight aircraft, partnered with a defense contractor for urban air mobility projects, and plans to deliver its first revenue-generating Midnight aircraft. Despite market volatility, Archer Aviation's stock has surged 12% after announcing plans to deliver its first revenue-generating Midnight aircraft, with a moderate buy rating from analysts and a strong analyst interest.", "keywords": ["takeoff", "urban", "commercialization", "contractor", "launch", "results", "generation", "program", "evtol", "defense", "projects", "developments", "surge", "volatility", "revenue", "mobility", "interest", "stock", "landing", "partnered", "aviation", "vertical", "midnight", "market", "price", "rating", "buy", "electric", "aircraft"], "sentiment": "positive", "upside": -152.8, "linked": [], "volume": 33892816.0, "introduction": "Archer Aviation, an electric vertical takeoff and landing aircraft developer, has announced its Q4 and full year 2024 results, with its stock price fluctuating in response to various developments, including plans to deliver its first revenue-generating Midnight aircraft.", "update": "2025-02-28", "current": 9.97, "category": "stock"}, {"company": "Rigetti Computing Inc", "symbol": "RGTI", "statement": "Rigetti Computing has announced a strategic collaboration with Quanta Computer, a Fortune Global 500 company and leader in notebook manufacturing and cloud computing. The partnership aims to accelerate the development and commercialization of superconducting quantum computing, with a combined investment of $500 million. The collaboration is expected to create significant economic value, with estimates suggesting quantum computing could create up to $850 billion in economic value by 2040. Rigetti and Quanta plan to release a cluster of 9-qubit chips by mid-year and aim to surpass 99.5% two-qubit fidelity, which would mean 995 out of 1000 operations being performed correctly.", "keywords": ["computing", "partnership", "quantum", "value", "economics", "superconducting", "chips", "collaboration", "investment", "fidelity"], "sentiment": "positive", "upside": -109.5, "linked": [], "volume": 212161810.0, "introduction": "Rigetti Computing and Quanta Computer have partnered to accelerate the development and commercialization of superconducting quantum computing, investing $500 million and aiming to create significant economic value and achieve high-fidelity operations.", "update": "2025-02-28", "current": 13.2, "category": "stock"}, {"company": "Tesla Inc", "symbol": "TSLA", "statement": "Tesla is expected to have a pivotal year in 2025, with CEO Elon Musk projecting up to 30% growth in EV deliveries. Despite recent sales drops in France and Germany, Musk remains optimistic. The company is working on new innovations, including a refreshed Model S and X, as well as a new 16K Smart TV with AI technology. Tesla is also expanding its manufacturing capabilities, including hiring for its Cybercab production. The company is also working on self-driving features and has begun hiring for manufacturing jobs related to its Cybercab.", "keywords": ["ai", "jobs", "innovations", "manufacturing", "expansion", "growth", "cybercab", "self-driving", "sales", "tv", "optimistic", "deliveries", "tesla", "refresh"], "sentiment": "positive", "upside": -75.6, "linked": [], "volume": 55806692.0, "introduction": "Tesla is expected to experience significant growth in 2025 with up to 30% growth in EV deliveries, driven by new innovations, expanded manufacturing, and self-driving features.", "update": "2025-02-28", "current": 406.58, "category": "stock"}, {"company": "Plug Power Inc", "symbol": "PLUG", "statement": "Plug Power is working to create a \"green hydrogen highway\" across North America and Europe, with a goal of making hydrogen a primary energy source across various industries. The company has made progress on its new hydrogen plant in Louisiana, which is designed to produce 15 tons of hydrogen per day and is on schedule to begin operations in the first quarter. The plant is a joint venture with Olin Corporation and will utilize Olin's by-product hydrogen from chlorine production. Plug Power aims to produce 1,000 tons of liquid hydrogen per day by 2028 and is building an end-to-end green hydrogen ecosystem to help customers meet their business goals and decarbonize the economy.", "keywords": ["schedule", "production", "plant", "louisiana", "decarbonize", "power", "america", "highway", "venture", "olin", "energy", "hydrogen", "ecosystem", "green", "europe", "operations", "goal", "north", "corporation", "industry"], "sentiment": "positive", "upside": -472.4, "linked": [], "volume": 75948296.0, "introduction": "Plug Power is working to create a \"green hydrogen highway\" across North America and Europe, with a goal of producing 1,000 tons of liquid hydrogen daily by 2028 through its new Louisiana plant and end-to-end ecosystem.", "update": "2025-02-28", "current": 2.08, "category": "stock"}, {"company": "Intel Corp", "symbol": "INTC", "statement": "Intel has unveiled its Xeon 6 processor portfolio, which offers industry-leading performance across various workloads, including AI processing, with up to 2x higher performance. The Xeon 6 processors come in two flavors: the P-core processor for data centers and edge applications with built-in vRAN Boost, and the SoC for network and edge applications. The new processors deliver up to 2.4x the capacity for radio access network (RAN) workloads and support AI inferencing on a video edge server. The Xeon 6 portfolio also includes Ethernet controller and network adapter product lines to address the growing demands of enterprise, telecommunications, cloud, and HPC applications.", "keywords": ["edge", "ai", "data", "telecommunications", "enterprise", "hpc", "application", "ran", "performance", "adapter", "server", "processor", "cloud", "video", "soc", "workload", "center", "ethernet", "network", "capacity", "controller", "inferencing", "vran", "boost"], "sentiment": "positive", "upside": -188.8, "linked": [], "volume": 65888810.0, "introduction": "Intel has launched its Xeon 6 processor portfolio, offering industry-leading performance across various workloads, including AI processing, with up to 2x higher performance, and catering to data centers, edge applications, and network and edge applications.", "update": "2025-02-28", "current": 20.83, "category": "stock"}, {"company": "Palantir Technologies Inc", "symbol": "PLTR", "statement": "Palantir Technologies, an artificial intelligence company, has seen its stock price surge and become a favorite among growth and momentum funds. However, it has recently dropped 28% in just two weeks. Despite this, some experts believe it's still a high-growth cybersecurity stock to buy. Palantir's CEO, Alex Karp, has written a book about the company's role in shaping the future of government and technology. The company's stock has a price-to-earnings ratio near 500, which some argue could be justified by Karp's vision of a government ruled by technology. Palantir provides AI-powered analytics for enterprises and has a strong presence in the data science industry.", "keywords": ["stock", "price", "intelligence", "enterprise", "growth", "government", "data", "science", "artificial", "analytics", "technology", "cybersecurity", "ratio", "palantir", "earnings", "momentum"], "sentiment": "negative", "upside": -93.4, "linked": [], "volume": 55107276.0, "introduction": "Palantir Technologies, an AI company with a high growth potential, saw its stock surge but recently dropped 28%, with some experts still recommending it as a high-growth cybersecurity stock to buy.", "update": "2025-02-28", "current": 78.98, "category": "stock"}, {"company": "Thoughtworks Holding Inc", "symbol": "TWKS", "statement": "Several companies are showcasing new technologies at an expo, with GE Healthcare debuting its largest collection of new products in China. ThoughtSpot appoints Brad Roberts as its new CFO to drive growth. Deloitte US is seeking talent and innovation, with a focus on emerging technologies. Eleos Health raises $68M to develop AI-powered therapy solutions, while INFICON leverages vacuum technology in various industries. Middleby plans to separate its food processing business into a standalone company. E2open Parent Holdings Inc. is a publicly traded company, and Red Cat Holdings announces new drone technology products. Deloitte US is also highlighting emerging technology consulting services.", "keywords": ["ai", "drone", "innovation", "products", "emerging", "growth", "business", "therapy", "consulting", "talent", "china", "healthcare", "expo", "technology", "cfo", "solutions", "company"], "sentiment": "positive", "upside": -139.97, "linked": ["JOBY : Reinvent Technology Partners is a company that focuses on merging or combining with a technology company, with a seasoned management team and significant institutional ownership."], "volume": 52182156.0, "introduction": "Several companies, including GE Healthcare, ThoughtSpot, Eleos Health, INFICON, Middleby, E2open, and Red Cat Holdings, are showcasing new technologies and innovations at an expo, with a focus on emerging technologies and growth.", "update": "2025-02-28", "current": 4.47, "category": "stock"}, {"company": "Rivian Automotive Inc", "symbol": "RIVN", "statement": "Rivian is an American electric vehicle manufacturer and outdoor recreation company founded in 2009. The company produces an electric sport utility vehicle, pickup truck, and delivery van, with a \"skateboard\" platform that can support future vehicles or be adopted by other companies. Rivian has launched its Upfit Program for fleet customers, offering custom electric vehicle solutions. The company is also developing solid-state batteries and has announced a hands-free driver-assistance system. Rivian has reported a record-high gross profit of $170M in Q4 and is focused on launching its more affordable R2 SUV. The company is also expanding its electric delivery van offerings and has partnered with Amazon.", "keywords": ["fleet", "amazon", "batteries", "recreation", "affordable", "skateboard", "delivery", "utility", "vehicle", "van", "platform", "electric", "solutions", "suv", "company", "manufacturer", "pickup", "profit"], "sentiment": "positive", "upside": -311.9, "linked": [], "volume": 31308816.0, "introduction": "Rivian is an American electric vehicle manufacturer that produces electric vehicles, including a sport utility vehicle, pickup truck, and delivery van, and is focused on launching its more affordable R2 SUV and expanding its delivery van offerings.", "update": "2025-02-28", "current": 12.77, "category": "stock"}, {"company": "SoFi Technologies Inc", "symbol": "SOFI", "statement": "Sofi Technologies has expanded its reach and innovations, positioning itself as a major player in the fintech space. The company has seen remarkable growth, with revenue increasing at a compound annual growth rate (CAGR) of 43% from 2020 to 2024. SoFi has surpassed 10 million members and has achieved profitability, with a projected revenue growth of 20% CAGR through 2026. The company's unique model for personal finance and student debt refinancing has contributed to its success, and analysts predict continued growth and profitability in the future.", "keywords": ["cagr", "refinancing", "innovation", "finance", "growth", "fintech", "profitability", "success", "debt", "model", "revenue", "prediction"], "sentiment": "positive", "upside": -94.5, "linked": [], "volume": 54306476.0, "introduction": "Sofi Technologies has experienced remarkable growth, with a 43% compound annual growth rate in revenue from 2020 to 2024, surpassing 10 million members and achieving profitability, with projected growth and profitability continuing through 2026.", "update": "2025-02-28", "current": 17.92, "category": "stock"}, {"company": "Quantum Computing Inc", "symbol": "QUBT", "statement": "Several companies in the quantum computing space have made recent announcements. Nu Quantum launched an entanglement fabric for quantum computing scale-out, while Socionext partnered with Google Quantum AI to deliver high-precision semiconductor products for quantum computing systems. Quantum Machines raised $170 million in funding, bringing its total funding to $280 million, and announced a customer base exceeding 50% of the quantum computing industry. IonQ, a leader in quantum computing and networking, announced innovations in compact, room-temperature quantum computers and acquired ID Quantique, a Geneva-based company.", "keywords": ["computing", "innovation", "quantum", "semiconductor", "funding", "acquisition", "entanglement", "networking", "fabric", "precision"], "sentiment": "positive", "upside": -108.7, "linked": [], "volume": 34888868.0, "introduction": "Several companies in the quantum computing space made recent announcements, including Nu Quantum, Socionext, Quantum Machines, and IonQ, which launched new products, raised funding, and made strategic partnerships.", "update": "2025-02-28", "current": 10.93, "category": "stock"}, {"company": "Ford Motor Co", "symbol": "F", "statement": "Ford is a pioneer in the automotive industry, having revolutionized the way humans interact with vehicles. The company's vision is to become the world's most trusted mobility company, designing smart vehicles for a smart world. Ford is investing in electric vehicles, battery technology, and charging solutions, with its CEO emphasizing the importance of mobility solutions in the era of smart cities. The company is also exploring sustainable materials, such as plant-based materials, and has partnered with LG Energy Solution to develop electric vehicle batteries. With a strong presence in the US, Ford has assembled over 1.8 million vehicles in the country last year, making it the leading automaker in the region.", "keywords": ["develop", "vision", "battery", "trusted", "materials", "charging", "partner", "revolutionized", "presence", "pioneer", "strong", "automotive", "electric", "solutions", "leading", "sustainability", "mobility"], "sentiment": "positive", "upside": -56.1, "linked": [], "volume": 42802990.0, "introduction": "Ford is a pioneer in the automotive industry, aiming to become the world's most trusted mobility company by investing in electric vehicles, battery technology, and sustainable materials, while expanding its presence in the US market.", "update": "2025-02-28", "current": 10.12, "category": "stock"}, {"company": "NIO Inc", "symbol": "NIO", "statement": "NIO, a Chinese electric vehicle manufacturer, is gaining traction in the global market. Founded in 2014, NIO has built a reputation for innovation, focusing on electric power and technology. The company has a strong financial foundation, thanks to partnerships with major investors and state-backed entities. NIO's production secrets have been unveiled, showcasing its advanced manufacturing processes and technologies. The company is expected to double sales growth in 2025 and achieve profitability by 2026. NIO is also expanding its product offerings and services, including used vehicle inspection and sales. With a strong financial foundation and innovative approach, NIO is positioning itself as a leading player in the electric vehicle market.", "keywords": ["innovation", "partnership", "expansion", "growth", "profitability", "technology", "electric", "foundation", "leadership"], "sentiment": "positive", "upside": -262.9, "linked": [], "volume": 39487612.0, "introduction": "NIO, a Chinese electric vehicle manufacturer founded in 2014, is gaining traction globally, with a strong financial foundation, innovative approach, and plans to double sales growth and achieve profitability by 2026.", "update": "2025-02-28", "current": 4.29, "category": "stock"}, {"company": "Iris Energy Ltd", "symbol": "IREN", "statement": "Iris Energy (IREN) is a company that mines Bitcoin and operates data centers powered by renewable energy. The company has a market capitalization of $4.68 billion and a price-to-book ratio of 2.68x, compared to the industry average of 2.33x. Iris Energy is unprofitable, but has raised $22 million in funding from 42 investors. The company is looking for an Environmental, Health, Safety, and Security Manager in Sweetwater, Texas. Iris Energy's institutional ownership is 41.1%, with institutional investors such as Van ECK Associates Corp and MIRAE ASSET GLOBAL ETFS HOLDINGS Ltd. having sold shares in the last 24 months.", "keywords": ["data", "mining", "ownership", "capitalization", "industry", "institutional", "average", "renewable", "energy", "centers", "security", "ratio", "market", "price", "investors", "book", "funding", "texas", "bitcoin", "manager"], "sentiment": "negative", "upside": -113.2, "linked": [], "volume": 22476084.0, "introduction": "Iris Energy, a Bitcoin miner and renewable energy-powered data center operator, is seeking an Environmental, Health, Safety, and Security Manager in Texas, with a market cap of $4.68 billion and institutional ownership at 41.1%.", "update": "2025-02-28", "current": 13.32, "category": "stock"}, {"company": "Opendoor Technologies Inc", "symbol": "OPEN", "statement": "Opendoor Technologies Inc., a leading e-commerce platform for residential real estate transactions, reported financial results for its fourth quarter and year ended December 31, 2024. The company's revenue increased to $1.1 billion in Q4, but it reported a loss of $113 million. Despite the loss, CEO Carrie Wheeler said the company entered 2025 as a \"leaner, more efficient business.\" The company's stock has been trading up by 4.96% and has a market valuation of $965.35M. Opendoor's growth is expected to continue, with an estimated annual growth rate of 2.36% over the next five years.", "keywords": ["e-commerce", "loss", "growth", "valuation", "technology", "market", "real estate", "revenue", "efficient", "financials"], "sentiment": "positive", "upside": -284.8, "linked": [], "volume": 26005726.0, "introduction": "Opendoor Technologies Inc., a residential real estate e-commerce platform, reported a revenue increase to $1.1 billion in Q4, but a loss of $113 million, with its stock trading up 4.96% and valued at $965.35M, with projected 2.36% annual growth over the next five years.", "update": "2025-02-28", "current": 1.4, "category": "stock"}, {"company": "Lucid Group Inc", "symbol": "LCID", "statement": "Lucid Group, an electric vehicle (EV) maker, announced that its CEO, Peter Rawlinson, is stepping down from his role, with the company planning to more than double its vehicle production. The board has initiated a search for a new CEO, with Marc Winterhoff named interim CEO. The company reported a surge in fourth-quarter earnings, leading to a 14% increase in shares. Lucid also announced its fourth-quarter and full-year 2024 financial results, which included producing 3,386 vehicles in Q4 and 9,029 vehicles in 2024, in line with its 2024 annual production guidance.", "keywords": ["results", "quarterly", "ceo", "vehicle", "production", "shares", "annual", "electric", "financial", "earnings", "guidance"], "sentiment": "positive", "upside": -276.8, "linked": [], "volume": 80242350.0, "introduction": "Lucid Group's CEO Peter Rawlinson is stepping down, with Marc Winterhoff taking over as interim CEO, while the company plans to more than double its vehicle production and reports a surge in quarterly earnings.", "update": "2025-02-28", "current": 2.79, "category": "stock"}, {"company": "Marathon Oil Corp", "symbol": "MRO", "statement": "Comstock Fuels has completed a financing with Marathon Petroleum to develop its lignocellulosic biomass refining solutions, which convert biomass feedstock into oil products. Marathon Petroleum's midstream segment, MPLX, has achieved a 10% reduction in energy intensity, earning an ENERGY STAR Industrial Showcase. ConocoPhillips has acquired Marathon Oil for $22 billion, boosting its resources and expected production growth. Marathon Petroleum has issued $2 billion registered senior notes. The oil and gas industry is expected to see innovation and growth in 2025, with ConocoPhillips poised to benefit from its acquisition of Marathon Oil.", "keywords": ["biomass", "innovation", "growth", "acquisition", "investment", "intensity", "reduction", "refining", "production", "energy", "development", "financing", "industry", "oil"], "sentiment": "positive", "upside": -58.36, "linked": ["KMI : Kinder Morgan, Inc. has announced various developments, including a $640 million pipeline acquisition, growth forecasts, and new pipeline projects, with its stock price fluctuating despite being a major player in the energy infrastructure industry."], "volume": 36021830.0, "introduction": "Comstock Fuels partners with Marathon Petroleum to develop lignocellulosic biomass refining solutions, while ConocoPhillips acquires Marathon Oil for $22 billion, boosting its resources and expected production growth.", "update": "2025-02-28", "current": 28.55, "category": "stock"}, {"company": "Grab Holdings Ltd", "symbol": "GRAB", "statement": "Grab Holdings, the leading super-app platform in Southeast Asia, has a strong growth potential, with an average price target of $5.62, representing a 23.31% upside from its current price. The company has been making strides in the region's digital services market, with a record revenue and user growth in 2024. Despite a 10% drop in stock price after mixed Q4 earnings, analysts believe GRAB stock could offer decent upside despite volatility. The company has a strong competitive position, having forced Uber to exit the region and turned it into a partner and investor. With a market value of $2.15B, Grab has raised $10.4B in funding over 32 rounds from 106 investors since its founding in 2012.", "keywords": ["digital", "upside", "partner", "potential", "price", "exit", "value", "growth", "funding", "competitive", "volatility", "target", "services", "position", "market", "revenue", "earnings", "investor"], "sentiment": "positive", "upside": -113.0, "linked": [], "volume": 20278470.0, "introduction": "Grab Holdings, a leading super-app platform in Southeast Asia, has a strong growth potential with an average price target of $5.62, representing a 23.31% upside from its current price.", "update": "2025-02-28", "current": 4.57, "category": "stock"}, {"company": "MicroStrategy Inc", "symbol": "MSTR", "statement": "MicroStrategy, a company that provides enterprise analytics and mobility software, has purchased an additional $1.9 billion worth of bitcoin, bringing its total bitcoin holdings to $47.4 billion. The company's CEO has called for the U.S. to create a strategic bitcoin reserve. Despite a decline in software sales, MicroStrategy's stock has surged, with some analysts predicting above-average earnings growth. The company's bitcoin holdings are valued at $86 billion, with some valuing its software business at $5 billion.", "keywords": ["stock", "ceo", "earnings", "growth", "software", "reserve", "bitcoin", "enterprise", "analytics", "mobility"], "sentiment": "positive", "upside": -102.3, "linked": [], "volume": 22695180.0, "introduction": "MicroStrategy, an analytics and mobility software company, has purchased an additional $1.9 billion worth of bitcoin, bringing its total holdings to $47.4 billion, valued at $86 billion, and its CEO is calling for the US to create a strategic bitcoin reserve.", "update": "2025-02-28", "current": 353.67, "category": "stock"}, {"company": "Apple Inc", "symbol": "AAPL", "statement": "Apple has announced a historic investment plan to spend more than $500 billion in the United States over the next four years, the company's largest-ever commitment to the US. The investment will support various initiatives, including artificial intelligence, silicon, and advanced manufacturing, and will create 20,000 research and development jobs across the country. The company will also build a 250,000-square-foot server manufacturing facility in Houston, Texas, and double its US Advanced Manufacturing Fund. This move is seen as a major expansion of Apple's domestic operations and a significant boost to the US economy.", "keywords": ["ai", "jobs", "manufacturing", "silicon", "texas", "houston", "research", "server", "economy", "technology", "plan", "development", "apple", "investment", "us", "facility"], "sentiment": "positive", "upside": -62.1, "linked": [], "volume": 52645956.0, "introduction": "Apple has announced a $500 billion investment plan to spend over the next four years in the US, creating 20,000 jobs and expanding its domestic operations, including building a new server manufacturing facility in Texas.", "update": "2025-02-28", "current": 222.78, "category": "stock"}, {"company": "CleanSpark Inc", "symbol": "CLSK", "statement": "CleanSpark, Inc. (CLSK) is a technology solutions company focused on solving modern energy challenges through advanced energy software and control technology. The company mines bitcoin through its wholly owned subsidiaries and has been influenced by investor concerns over cryptocurrency markets and energy grid instability. Analysts have set a price target of $22.25, and the stock has been trading down by 3.25% in recent days. The company's expansion into renewable energy-powered mining solutions provides a competitive advantage and aligns with wider ESG trends.", "keywords": ["stock", "grid", "advantages", "price", "trends", "cryptocurrency", "instability", "esg", "bitcoin", "mining", "renewable", "technology", "energy", "target", "solutions"], "sentiment": "positive", "upside": -121.6, "linked": [], "volume": 24849948.0, "introduction": "CleanSpark, Inc. (CLSK) is a technology company that solves energy challenges with software and control tech, mines bitcoin through subsidiaries, and has a competitive edge with renewable energy-powered mining solutions.", "update": "2025-02-28", "current": 11.53, "category": "stock"}, {"company": "AT&T Inc", "symbol": "T", "statement": "AT&T is an American multinational telecommunications company headquartered in Dallas, Texas, and is the third largest wireless carrier in the US. The company's wireless business contributes nearly 70% of its revenue, serving 72 million postpaid and 17 million prepaid phone customers. The article also mentions various other news stories, including the departure of Joy Reid from MSNBC, the death of actor Gene Hackman, and the swearing in of Kash Patel as acting chief of the Bureau of Alcohol, Tobacco, Firearms and Explosives.", "keywords": ["customers", "wireless", "chief", "death", "telecommunications", "carrier", "multinational", "departure", "news", "swearing", "revenue", "stories"], "sentiment": "negative", "upside": 38.9, "linked": [], "volume": 43626290.0, "introduction": "AT&T is an American multinational telecommunications company headquartered in Dallas, Texas, and is the third largest wireless carrier in the US, serving 89 million customers.", "update": "2025-02-28", "current": 22.72, "category": "stock"}, {"company": "SoundHound AI Inc", "symbol": "SOUN", "statement": "SoundHound AI, a global leader in voice artificial intelligence, has unveiled its next-generation AI platform for restaurants, enhancing its Dynamic Drive-Thru solution's accuracy, speed, and adding seamless omnichannel ordering capabilities. The platform allows restaurants to extend automation beyond the drive-thru to include call-to-order, text-to-order, scan-to-order, and in-car voice ordering, elevating customer experience and maximizing revenue. The company's CEO discussed the latest developments and plans for 2025, highlighting the transformational power of AI agents in various industries.", "keywords": ["restaurants", "speed", "leader", "omnichannel", "intelligence", "ceo", "customer", "transformation", "experience", "automation", "artificial", "accuracy", "revenue", "voice", "ordering", "platform"], "sentiment": "positive", "upside": -109.4, "linked": [], "volume": 64984504.0, "introduction": "SoundHound AI has unveiled an upgraded platform for restaurants, enhancing its Dynamic Drive-Thru solution with omnichannel ordering capabilities, allowing for seamless ordering across drive-thru, call, text, scan, and in-car voice interfaces.", "update": "2025-02-28", "current": 15.84, "category": "stock"}, {"company": "D-Wave Quantum Inc", "symbol": "QBTS", "statement": "D-Wave Quantum Inc. (QBTS) is experiencing a decline in value in 2025, partly due to raising $150 million through an at-the-market equity offering, which diluted existing shareholders. Despite this, the company is making progress in the quantum computing space, partnering with Japan Tobacco to accelerate drug discovery using quantum AI, and hosting its Qubits 2025 conference in Scottsdale, Arizona, to showcase its products and services. The company is also expanding its Leap Quantum LaunchPad program to fast-track quantum computing applications and has exceeded $23 million in bookings for fiscal year 2024.", "keywords": ["d-wave", "progress", "qbts", "ai", "value", "computing", "quantum", "partnership", "products", "offering", "bookings", "conference", "equity", "services", "decline", "launchpad"], "sentiment": "positive", "upside": -120.8, "linked": [], "volume": 137765140.0, "introduction": "D-Wave Quantum Inc. is experiencing a decline in value in 2025 due to a recent equity offering, but is still making progress in the quantum computing space through partnerships and product developments.", "update": "2025-02-28", "current": 6.09, "category": "stock"}, {"company": "Nu Holdings Ltd", "symbol": "NU", "statement": "Nu Holdings, a fintech company operating in Latin America, has seen significant growth, with revenues surging 56% year-on-year to $2.9 billion in the third quarter. Despite Warren Buffett's Berkshire Hathaway selling some of its stake, analysts consider Nu Holdings a solid stock to own. The company has a strong financial profile, with a return on equity of 7.23% and a net margin of 17.12%. Its customer base has expanded by 22% to 114.2 million, making it Brazil's third-largest financial institution. Despite some recent stock selloff, analysts expect Nu Holdings to continue growing, with projected earnings of $0.58 per share for the current fiscal year.", "keywords": ["revenues", "warren", "growth", "institution", "selloff", "earnings", "profile", "stock", "surging", "customer", "fintech", "margin", "solid", "base", "stake", "buffett", "equity", "financial", "berkshire"], "sentiment": "positive", "upside": -84.9, "linked": [], "volume": 41150864.0, "introduction": "Nu Holdings, a fintech company in Latin America, has seen significant growth with a 56% revenue increase to $2.9 billion in Q3, with analysts considering it a solid stock to own despite Berkshire Hathaway's stake sale.", "update": "2025-02-28", "current": 12.34, "category": "stock"}, {"company": "Advanced Micro Devices Inc", "symbol": "AMD", "statement": "AMD has launched the Radeon RX 9070 XT and RX 9070 graphics cards, part of the Radeon RX 9000 Series, which features the new AMD RDNA 4 graphics architecture. The new architecture focuses on improving ray tracing and machine learning technologies, making enthusiast-level gaming more accessible to a wider audience. AMD is a leading semiconductor company that designs and manufactures a range of products, including microprocessors and graphics processing units. The company is a major competitor to NVIDIA and is driving innovation in the field of artificial intelligence and computing.", "keywords": ["microprocessors", "amd", "innovation", "intelligence", "computing", "rx", "architecture", "gpus", "nvidia", "artificial", "radeon", "semiconductors", "graphics"], "sentiment": "positive", "upside": -77.1, "linked": [], "volume": 31002960.0, "introduction": "AMD has launched the Radeon RX 9070 XT and RX 9070 graphics cards, featuring the new RDNA 4 architecture that improves ray tracing and machine learning technologies, making enthusiast-level gaming more accessible to a wider audience.", "update": "2025-02-28", "current": 122.84, "category": "stock"}, {"company": "Riot Blockchain Inc", "symbol": "RIOT", "statement": "Riot Blockchain, Inc. (NASDAQ: RIOT) announced its Q4 2024 earnings, beating expectations with EPS of $1.95. The company reported record revenue of $376.7 million, a 34% increase from 2023, and net income of $109.4 million or $0.40 per share. Riot also invested in research and development, launching a new subsidiary, RiotX Ventures, to develop new blockchain-based products and services. The company's CEO highlighted the success despite the Bitcoin network's halving in April and a 67% increase in the hash rate worldwide.", "keywords": ["ventures", "ceo", "research", "netincome", "hashrate", "development", "halving", "blockchain", "revenue", "earnings"], "sentiment": "positive", "upside": -94.4, "linked": [], "volume": 46591200.0, "introduction": "Riot Blockchain, Inc. reported Q4 2024 earnings that beat expectations, with record revenue of $376.7 million and net income of $109.4 million, despite the Bitcoin network's halving and increased global hash rate.", "update": "2025-02-28", "current": 13.54, "category": "stock"}, {"company": "Pfizer Inc", "symbol": "PFE", "statement": "Pfizer, a pharmaceutical company, has made several announcements in recent days. The company has expressed concerns about a policy that could limit access to life-saving medicines and has emphasized the importance of innovation in the life sciences. Pfizer has also received FDA approval for a new treatment for hemophilia, marstacimab, and has partnered with Summit Therapeutics to advance cancer treatments. Additionally, the company has named Patrizia Cavazzoni, former head of the FDA's drug evaluation unit, as its new Chief Medical Officer.", "keywords": ["medicine", "innovation", "partnership", "hemophilia", "fda", "leadership", "pharmaceutical", "cancer", "approval", "pfizer", "treatment"], "sentiment": "positive", "upside": -47.3, "linked": [], "volume": 31175632.0, "introduction": "Pfizer has made several announcements, including expressing concerns about access to life-saving medicines, receiving FDA approval for a new hemophilia treatment, partnering with Summit Therapeutics for cancer research, and appointing Patrizia Cavazzoni as Chief Medical Officer.", "update": "2025-02-28", "current": 26.09, "category": "stock"}, {"company": "KULR Technology Group Inc", "symbol": "KULR", "statement": "KULR Technology Group, a company specializing in advanced energy management platforms, has seen its stock rise 13.41% due to new partnerships and innovative product launches. The company has recently achieved certification for its Texas facility, boosting customer trust. KULR has also partnered with Worksport to advance battery technology and strengthen domestic manufacturing. The company's stock has experienced a 106% increase over the last quarter, aligning with the partnership announcement. However, KULR's stock has also seen a significant decline in 2025 due to a class action lawsuit alleging insider trading and its involvement in Bitcoin.", "keywords": ["stock", "lawsuit", "battery", "trust", "innovation", "manufacturing", "growth", "partnerships", "technology", "energy", "certification", "decline"], "sentiment": "positive", "upside": -117.2, "linked": [], "volume": 17017950.0, "introduction": "KULR Technology Group's stock has seen a 13.41% rise due to new partnerships and product launches, including certification of its Texas facility and a partnership with Worksport to advance battery technology.", "update": "2025-02-28", "current": 2.46, "category": "stock"}, {"company": "Amazon.com Inc", "symbol": "AMZN", "statement": "Amazon is preparing to release a slew of new AI-powered devices, according to its hardware chief. The company has also been named the most disruptive company and CEO, alongside Elon Musk, in the inaugural \"Thought Leaders 100\" list. Amazon has unveiled Alexa+, a new version of its voice assistant powered by generative AI, and plans to release companion devices in the fall. Additionally, Amazon has joined the quantum computing race with its \"Ocelot\" chip, aiming to shave years off development time. The company's secret to AI-powered product recommendations is its ability to monetize data with an AI engine, analyzing customer and product data to make accurate and individualized pitches.", "keywords": ["musk", "amazon", "ai", "ceo", "computing", "recommendations", "quantum", "data", "hardware", "ocelot", "alexa", "devices"], "sentiment": "positive", "upside": -49.5, "linked": [], "volume": 26234668.0, "introduction": "Amazon is preparing to release new AI-powered devices, including Alexa+, a new voice assistant, and an \"Ocelot\" chip for quantum computing, as well as plans to monetize data with an AI engine for product recommendations.", "update": "2025-02-28", "current": 234.85, "category": "stock"}, {"company": "iQIYI Inc", "symbol": "IQ", "statement": "iQIYI, a leading online entertainment platform in China, showcased its strategic response to TV drama industry trends at the China TV Drama Production Industry Conference and the 10th China International TV Drama Program Trade Fair. The company highlighted its advancements in virtual production technology and its focus on short-form content and technological innovation to drive growth. iQIYI's portfolio of mini-dramas has surpassed 10,000 titles, and it has secured the highest viewership market share in both Q4 and the full year of 2024. The company's founder and CEO emphasized the \"viewer-centric approach\" in response to industry trends.", "keywords": ["viewership", "ceo", "trends", "innovation", "industry", "growth", "drama", "entertainment", "tv", "mini-dramas", "china", "share", "technology", "market", "platform"], "sentiment": "positive", "upside": 155.4, "linked": [], "volume": 54561920.0, "introduction": "iQIYI, a leading Chinese entertainment platform, showcased its response to TV drama trends at a conference, highlighting advancements in virtual production and short-form content to drive growth and achieving a high viewership market share.", "update": "2025-02-28", "current": 2.23, "category": "stock"}, {"company": "Bit Digital Inc", "symbol": "BTBT", "statement": "Bit Digital, Inc. (BTBT) has seen its stock price increase by 1.66% to $2.45, outpacing the S&P 500's daily gain. The company, a holding company providing digital assets and AI infrastructure, has received optimistic recommendations from Wall Street analysts, who believe it should be added to portfolios. BTBT has been involved in bitcoin mining and has a strong presence in New York City. The company has undergone significant changes, including a name change from Golden Bull Limited to Bit Digital, Inc. in 2020. Analysts have provided mixed opinions on the company's performance, with some recommending it as a buy and others expressing skepticism.", "keywords": ["stock", "digital", "price", "recommendations", "analysts", "presence", "performance", "infrastructure", "city", "increase", "assets", "bitcoin", "mining", "change", "company"], "sentiment": "positive", "upside": -102.4, "linked": ["WULF : TeraWulf Inc., a bitcoin mining firm, reported a net loss of $72.4 million in 2023 and $90.8 million in 2022, but its stock has risen 72.15% despite underperforming by 9.33% last year."], "volume": 21168000.0, "introduction": "Bit Digital, Inc. (BTBT) has seen its stock price increase by 1.66% to $2.45, receiving optimistic recommendations from Wall Street analysts who believe it should be added to portfolios.", "update": "2025-02-28", "current": 3.69, "category": "stock"}, {"company": "Rocket Lab USA Inc", "symbol": "RKLB", "statement": "Rocket Lab, a global leader in launch services and space systems, has made several announcements recently. The company revealed its Ocean Platform for Neutron rocket landings at sea, introduced a new satellite model that could compete with Starlink, and introduced Flatellite, a scalable, long-life, high-power satellite. Rocket Lab also reported a 121% increase in Q4 revenue and achieved a critical design review for the US Space Force's VICTUS HAZE mission, solidifying its position in the space industry.", "keywords": ["starlink", "revenue", "review", "space", "flatellite", "satellite", "mission", "services", "neutron", "launch", "platform", "systems"], "sentiment": "positive", "upside": -106.2, "linked": [], "volume": 23723176.0, "introduction": "Rocket Lab has made several announcements, including a new ocean platform for Neutron rocket landings, a new satellite model, and a scalable satellite, while also reporting a 121% increase in Q4 revenue and achieving a critical design review for the US Space Force's VICTUS HAZE mission.", "update": "2025-02-28", "current": 30.36, "category": "stock"}, {"company": "Warner Bros Discovery Inc", "symbol": "WBD", "statement": "Warner Bros. Discovery Inc. is experiencing a positive stock market momentum, driven by the success of its latest releases and strategic streaming initiatives. The company has formed a joint venture with Mattel to utilize DC's character library, and has announced a global licensing agreement with Mattel to create toys and other products. Warner Bros. Discovery has also shut down three video game studios and cancelled a Wonder Woman title to boost profitability. The company has also formed a joint venture with Cutting Edge Group to manage its music rights portfolio.", "keywords": ["music", "portfolio", "profitability", "venture", "studios", "success", "streaming", "licensing", "cancellation", "momentum", "rights"], "sentiment": "positive", "upside": -323.0, "linked": [], "volume": 20082304.0, "introduction": "Warner Bros. Discovery is experiencing a positive stock market momentum due to its successful releases and strategic streaming initiatives, including partnerships with Mattel, Cutting Edge Group, and a focus on boosting profitability by shutting down video game studios and canceling a Wonder Woman title.", "update": "2025-02-28", "current": 10.25, "category": "stock"}, {"company": "Spirit Airlines Inc", "symbol": "SAVE", "statement": "Spirit Airlines has made headlines recently, with the low-cost carrier landing top honors for its young, modern, all-Airbus fleet. However, the airline has faced financial struggles, filing for Chapter 11 bankruptcy in November 2024. Despite this, Spirit has received Bankruptcy Court approval for its Plan of Reorganization, which will see it emerge from bankruptcy with $795 million of debt converted to equity and $350 million in new equity investment. The airline has also reinstated change fees for its basic fare, with fees ranging from $59 to $99, depending on the timing of the change. Despite these setbacks, Spirit is expected to exit bankruptcy within the next few weeks and begin a new chapter as a private company.", "keywords": ["spirit", "private", "carrier", "fees", "debt", "airbus", "court", "bankruptcy", "reorganization", "headlines", "honors", "chapter", "low-cost", "equity", "financial", "plan", "airline", "investment", "modern"], "sentiment": "positive", "upside": -2961.0, "linked": [], "volume": 25024648.0, "introduction": "Spirit Airlines, a low-cost carrier with a young and modern Airbus fleet, has received bankruptcy court approval for its reorganization plan, which will see it emerge with reduced debt and new equity investment, and is expected to exit bankruptcy within weeks.", "update": "2025-02-28", "current": 1.08, "category": "stock"}, {"company": "Hims & Hers Health Inc", "symbol": "HIMS", "statement": "Hims & Hers Health, Inc. reported its fourth quarter and full year 2024 financial results, beating analysts' expectations, but its stock sank in extended trading. The company plans to stop selling compounded weight-loss drugs, including semaglutide injections, after the FDA removed its pathway to sell them. This decision led to a 27% drop in stock value. Despite the setback, Hims & Hers is guiding for margin expansion and fast growth, but faces a potential legal threat to its weight loss drug program. The company's stock has been on a rollercoaster ride, plummeting over 19% in after-hours trading and then recovering some losses.", "keywords": ["stock", "plans", "results", "expectations", "rollercoaster", "program", "growth", "analysts", "fda", "pathway", "decision", "threat", "drop", "sank", "setback", "financials"], "sentiment": "negative", "upside": -92.5, "linked": [], "volume": 8918405.0, "introduction": "Hims & Hers Health, Inc. reported strong Q4 and full year 2024 financial results, but its stock plummeted 27% after the FDA removed its pathway to sell compounded weight-loss drugs, including semaglutide injections.", "update": "2025-02-28", "current": 30.87, "category": "stock"}, {"company": "Bank of America Corp", "symbol": "BAC", "statement": "Bank of America's digital interactions with clients surged to over 26 billion in 2024, a 12% increase from the previous year. This growth is attributed to the bank's innovative digital capabilities and proactive alerts, which have enhanced the experience for its over 58 million verified digital clients. The bank's small business clients, numbering around 4 million, also benefited from its suite of online products and services. Zelle adoption reached a record high, with 23.7 million clients using the service to send and receive a record 1.6 billion transactions valued at $470 billion.", "keywords": ["digital", "online", "clients", "interactions", "innovation", "growth", "products", "experience", "zelle", "bank", "services", "alerts", "transactions"], "sentiment": "positive", "upside": -56.4, "linked": [], "volume": 23546200.0, "introduction": "Bank of America's digital interactions with clients surged 12% to over 26 billion in 2024, driven by innovative digital capabilities and proactive alerts, with small business clients and Zelle adoption reaching record highs.", "update": "2025-02-28", "current": 46.52, "category": "stock"}, {"company": "IONQ Inc", "symbol": "IONQ", "statement": "IonQ, a leader in quantum computing and networking, has acquired ID Quantique and is expanding its capabilities. The company's current generation quantum computers, IonQ Forte and IonQ Forte Enterprise, boast 36 algorithmic qubits. IonQ has also announced advancements in quantum computing services, collaborations, and financial outlook, including the launch of IonQ Hybrid Services and a demonstration with NVIDIA CUDA-Q. The company has also achieved a breakthrough in making compact quantum systems and is in talks to acquire ID Quantique for $250 million. IonQ has received recognition for its innovative technology and rapid growth, and has appointed a new technology leader, Gabrielle Toledano.", "keywords": ["collaborations", "capabilities", "services", "expansion", "computing", "quantum", "innovation", "acquisition", "growth", "hybrid", "leadership", "computers", "outlook", "technology", "breakthrough", "qubits", "systems", "networking"], "sentiment": "positive", "upside": -109.7, "linked": [], "volume": 19528488.0, "introduction": "IonQ, a quantum computing and networking company, has acquired ID Quantique for $250 million and expanded its capabilities, advancing its quantum computing services, collaborations, and financial outlook.", "update": "2025-02-28", "current": 40.76, "category": "stock"}, {"company": "Energy Transfer LP", "symbol": "ET", "statement": "Energy Transfer LP (ET) has been performing well, with its units rallying 31.9% in the past 12 months, outperforming the Zacks Oil and Gas - Production Pipeline - MLB industry's growth of 24.6%. The company's strong financial metrics and growth prospects have led to a price target raise to $22 from $20 by Citi, and a Buy rating. ET's adjusted earnings before interest, taxes, depreciation, and amortization (EBITDA) grew 13% last year to a partnership record $15.5 billion, driven by acquisitions, organic expansion projects, and strong market conditions. The company's dividend yield is 6.4% per year, and analysts have set target prices ranging from $19.0 to $25.0, with an average rating of Buy.", "keywords": ["pipeline", "growth", "lp", "oil", "expansion", "rally", "transfer", "analyst", "energy", "yield", "acquisition", "metrics", "prospect", "dividend", "target", "market", "ebitda", "industry", "gas"], "sentiment": "positive", "upside": 75.7, "linked": [], "volume": 20415448.0, "introduction": "Energy Transfer LP's units have rallied 31.9% in the past 12 months, outperforming the industry, with strong financial metrics and growth prospects driving a price target raise to $22 and a Buy rating.", "update": "2025-02-28", "current": 21.05, "category": "stock"}, {"company": "Terawulf Inc", "symbol": "WULF", "statement": "TeraWulf Inc., a tech firm specializing in digital assets, has reported its fourth quarter and full year 2024 results, with a net loss of $72.4 million and $90.8 million in 2023 and 2022, respectively. The company operates bitcoin mining facilities in Pennsylvania and has a flexible infrastructure model to maximize operational efficiency while minimizing environmental impact. Despite underperforming by 9.33% in the last year, the stock has risen 72.15% in the same period. TeraWulf owns and operates environmentally sustainable data center infrastructure in the United States, designed for bitcoin mining and high-performance computing. The company has a P/S ratio of 11.8x, making it a strong sell compared to other companies in the industry.", "keywords": ["digital", "data", "assets", "mining", "environmental", "results", "loss", "computing", "tech", "profit", "stock", "efficiency", "infrastructure", "impact", "ratio", "facilities", "bitcoin", "industry", "sustainability"], "sentiment": "negative", "upside": -111.1, "linked": ["BTBT : Bit Digital, Inc. (BTBT) has seen its stock price increase by 1.66% to $2.45, receiving optimistic recommendations from Wall Street analysts who believe it should be added to portfolios."], "volume": 56193060.0, "introduction": "TeraWulf Inc., a bitcoin mining firm, reported a net loss of $72.4 million in 2023 and $90.8 million in 2022, but its stock has risen 72.15% despite underperforming by 9.33% last year.", "update": "2025-02-28", "current": 6.32, "category": "stock"}, {"company": "Lyft Inc", "symbol": "LYFT", "statement": "Lyft, a ride-hailing company, has been in the news recently. The company's CEO, Evan Goldin, discussed the decision to build or buy an applicant tracking system (ATS) to streamline the driver onboarding process. Lyft has also partnered with Anthropic to improve its customer service using AI technology. The company's CFO will participate in a fireside chat at the Morgan Stanley Technology Conference. Additionally, Lyft's stock (LYFT) has been analyzed by various financial institutions, with a predicted upside of 35.37% from its current price. The company's earnings history and analyst ratings are also available.", "keywords": ["ride-hailing", "stock", "service", "ai", "ratings", "ceo", "customer", "ats", "conference", "technology", "onboarding", "earnings"], "sentiment": "positive", "upside": -105.7, "linked": [], "volume": 9037381.0, "introduction": "Lyft, a ride-hailing company, is making moves to streamline its driver onboarding process and improve customer service, while also preparing for a potential stock market boost.", "update": "2025-02-28", "current": 13.8, "category": "stock"}, {"company": "American Airlines Group Inc", "symbol": "AAL", "statement": "American Airlines has made several significant moves in recent days. The airline has announced the addition of two new routes, partnered with British Airways to enhance its OneWorld benefits, and introduced a new security program. It has also been expanding its services and connectivity, including adding routes and enhancing customer experience. American Airlines has been recognized for its competitive edge in the Los Angeles-New York market, offering fully lie-flat seats on its Airbus A321T aircraft. The airline has also received ratings from Fitch Ratings and has joined a campaign to overhaul London's Heathrow Airport.", "keywords": ["edge", "ratings", "expansion", "partnership", "connectivity", "experience", "security", "campaign", "airline", "routes"], "sentiment": "positive", "upside": -39.0, "linked": [], "volume": 37547656.0, "introduction": "American Airlines has made several significant moves, including adding new routes, partnering with British Airways, introducing a new security program, and enhancing customer experience, while also being recognized for its competitive edge in the LA-NY market and joining a campaign to overhaul London's Heathrow Airport.", "update": "2025-02-28", "current": 16.96, "category": "stock"}, {"company": "SRIVARU Holding Ltd", "symbol": "SVMH", "statement": "A resident at Turnberry Towers in Las Vegas is calling a building employee a hero after a gunman fired shots at the front desk. In other news, SVU Holding Limited's dividend overview and grades were published, and INFICON's vacuum-based processes are used in various industries. ATFX Connect, the institutional arm of ATFX, is expanding its global presence and innovating in finance and healthcare. NUBURU Inc, a company developing high-power industrial blue lasers, has agreed to a strategic transaction with a private equity investment group. GRI appointed Dr. Tharindu Atapattu as its new CEO, who will focus on data-driven insights and sustainability. Omnia's mining products aim to reduce environmental impact, and Haveli Investments acquired AppViewX, with Dino DiMarino named CEO. Finally, Innovation Laser offers various manufacturing services, including laser cutting, waterjet cutting, and CNC machining.", "keywords": ["industries", "innovation", "ceo", "finance", "manufacturing", "presence", "transaction", "dividend", "healthcare", "mining", "equity", "hero", "sustainability", "environmental"], "sentiment": "positive", "upside": -447.4, "linked": [], "volume": 122944570.0, "introduction": "A resident at Turnberry Towers in Las Vegas credits a building employee as a hero after a gunman fired shots at the front desk, while various companies in industries such as finance, healthcare, and manufacturing made announcements about expansions, acquisitions, and product developments.", "update": "2025-02-28", "current": 0.03, "category": "stock"}, {"company": "Tonix Pharmaceuticals Holding Corp", "symbol": "TNXP", "statement": "Tonix Pharmaceuticals Holding Corp (TNXP) is a clinical-stage biopharmaceutical company with a PDUFA date of August 15, 2025 for its TNX-102 SL in fibromyalgia. The company has underperformed by -4.36% in the past year, with a 99.22% drop in stock price. Despite this, investors are advised to look at stock chart patterns for technical insight. The company is led by CEO Seth Lederman and has a market capitalization of $509 million. The FDA assigned a PDUFA date for TNX-102 SL in fibromyalgia, and the company's stock price has seen a significant increase in short interest.", "keywords": ["pharmaceuticals", "ceo", "august", "pdufa", "underperform", "sl", "capitalization", "2025", "stage", "fda", "lederman", "tnx-102", "interest", "stock", "chart", "date", "technical", "insight", "market", "tnxp", "patterns", "biotech", "price", "investors", "short", "fibromyalgia", "clinical", "drop"], "sentiment": "negative", "upside": -1044.5, "linked": [], "volume": 179498200.0, "introduction": "Tonix Pharmaceuticals Holding Corp, a clinical-stage biopharmaceutical company, has a PDUFA date of August 15, 2025 for its TNX-102 SL in fibromyalgia, despite underperforming by 4.36% in the past year and having a market capitalization of $509 million.", "update": "2025-02-28", "current": 0.38, "category": "stock"}, {"company": "Akoustis Technologies Inc", "symbol": "AKTS", "statement": "Akoustis Technologies Inc., a fabless company, has seen a significant decline in its net income, increasing its loss by 164.25% to $167.95 million despite flat revenues. The company, headquartered in North Carolina, filed for Chapter 11 bankruptcy in December 2024. Despite the financial struggles, Akoustis Technologies is working on developing innovative filter products for the mobile wireless device industry. The company's financial struggles may be due to an increase in selling, general, and administrative costs as a percentage of sales.", "keywords": ["filter", "wireless", "revenues", "loss", "innovation", "products", "chapter11", "inc", "devices", "technology", "mobile", "bankruptcy", "fabless", "decline", "financials"], "sentiment": "negative", "upside": -13510.6, "linked": [], "volume": 93547736.0, "introduction": "Akoustis Technologies, a fabless company, filed for Chapter 11 bankruptcy in 2024 despite a 164.25% increase in losses to $167.95 million, attributed to increased costs, despite flat revenues.", "update": "2025-02-28", "current": 0.04, "category": "stock"}, {"company": "Tilray Inc", "symbol": "TLRY", "statement": "Tilray is a cannabis company that is a pioneer in the industry, integrating sustainability with its strategies. With a presence in 11 countries, including Argentina, Australia, and Canada, the company offers medical and recreational cannabis products. Despite regulatory complexities, Tilray is cautiously forging ahead, setting new benchmarks. The company has a growing customer base of over 50 million and is poised for big gains.", "keywords": ["medical", "cannabis", "recreational", "benchmarks", "customer", "pioneer", "gains", "regulatory", "complexities", "industry", "sustainability", "strategies"], "sentiment": "positive", "upside": -220.9, "linked": [], "volume": 36058948.0, "introduction": "Tilray is a pioneering cannabis company that operates in 11 countries, offering medical and recreational products while prioritizing sustainability and poised for significant growth.", "update": "2025-02-28", "current": 1.14, "category": "stock"}, {"company": "Wells Fargo & Co", "symbol": "WFC", "statement": "Wells Fargo has dropped its net zero emissions target, abandoning its commitment to reduce greenhouse gas emissions. The bank's decision comes as it faces criticism from the Trump administration and scrutiny over its environmental record. Wells Fargo has also rolled back its diversity, equity, and inclusion (DEI) goals, joining other major banks in scaling back their DEI initiatives. The bank has been criticized for its lack of transparency and accountability on climate change and social responsibility.", "keywords": ["criticism", "commitment", "initiatives", "emissions", "diversity", "goals", "transparency", "accountability", "scrutiny", "target", "equity", "climate", "responsibility", "inclusion", "record", "administration"], "sentiment": "negative", "upside": 90.6, "linked": [], "volume": 9700210.0, "introduction": "Wells Fargo has abandoned its net zero emissions target and rolled back its diversity, equity, and inclusion goals, facing criticism from the Trump administration and scrutiny over its environmental and social responsibility record.", "update": "2025-02-28", "current": 77.32, "category": "stock"}, {"company": "Broadcom Inc", "symbol": "AVGO", "statement": "Broadcom has expanded its AI infrastructure with the availability of its end-to-end PCIe Gen 6 portfolio, offering double the bandwidth of the previous generation for a total of 64 gigabits per second per lane. The company has partnered with Teledyne LeCroy to provide a solid base for PCIe testing, and its new products are designed to meet the evolving demands of the AI industry. Broadcom's PCIe Gen 6 portfolio is available for early access customers, and the company's commitment to the open ecosystem has strengthened over six generations. The new technology is expected to enable next-generation AI rack solutions and improve data center interconnect technology.", "keywords": ["ai", "ecosystem", "testing", "partnership", "rack", "open", "gen6", "infrastructure", "technology", "interconnect", "pcie", "solutions", "datacenter", "bandwidth"], "sentiment": "positive", "upside": -87.2, "linked": [], "volume": 24935682.0, "introduction": "Broadcom has expanded its PCIe Gen 6 portfolio, offering double the bandwidth of the previous generation, and has partnered with Teledyne LeCroy to provide a solid base for PCIe testing, designed to meet the evolving demands of the AI industry.", "update": "2025-02-28", "current": 244.7, "category": "stock"}, {"company": "Amcor PLC", "symbol": "AMCR", "statement": "Amcor and Berry Global shareholders have overwhelmingly approved the combination of the two companies, satisfying the shareholder vote condition for the merger. The deal, originally announced in November 2024, brings together two global leaders in packaging solutions, with Amcor being a global leader in developing and producing responsible packaging solutions across various materials. The combined entity will be positioned to serve customers better, grow faster, and operate globally, with a focus on making packaging more recyclable, reusable, and made from recycled materials.", "keywords": ["global", "customers", "materials", "vote", "condition", "innovation", "packaging", "growth", "acquisition", "shareholders", "focus", "leaders", "merger", "recycling", "solutions", "sustainability", "leadership"], "sentiment": "positive", "upside": -11.3, "linked": ["IP : International Paper and DS Smith have merged to create a global leader in sustainable packaging solutions, combining their strengths to serve customers in over 30 countries and accelerate growth and innovation."], "volume": 13238311.0, "introduction": "Amcor and Berry Global shareholders have approved the merger, combining two global leaders in packaging solutions to create a stronger, more sustainable company.", "update": "2025-02-28", "current": 9.76, "category": "stock"}, {"company": "Alphabet Inc", "symbol": "GOOGL", "statement": "Alphabet, the parent company of Google, is a technology conglomerate that operates in various industries, including internet search, cloud services, and digital advertising. Its subsidiary, Loon, aims to deliver internet via high-altitude balloons. Alphabet's latest product, Claude 3.7 Sonnet, is its most advanced version and will be available on all plans. The company's market capitalization is $2.14 trillion, and it is navigating the AI boom and regulatory challenges. Alphabet is a dominant player in the tech industry, with its subsidiaries including Google, YouTube, and Nest Labs. The company is also involved in various other areas, such as AI, biotechnology, and space research.", "keywords": ["ai", "biotechnology", "boom", "loon", "regulation", "capitalization", "conglomerate", "subsidiary", "cloud", "balloons", "labs", "google", "alphabet", "dominant", "advertising", "internet", "product", "sonnet", "youtube", "space", "claude", "player", "technology", "industry", "nest"], "sentiment": "positive", "upside": -7.9, "linked": [], "volume": 23753208.0, "introduction": "Alphabet, the parent company of Google, is a technology conglomerate that operates in various industries, including internet search, cloud services, and digital advertising, with a market capitalization of $2.14 trillion and a diverse portfolio of subsidiaries and projects.", "update": "2025-02-28", "current": 200.21, "category": "stock"}, {"company": "Reinvent Technology Partners", "symbol": "JOBY", "statement": "Reinvent Technology Partners (RTP) is a company that focuses on effecting a merger or business combination with a technology company. The company has a short interest of 8.74% and institutional ownership of 44.4%. The company's management team has over 50 years of experience. The article also touches on various other topics related to technology, innovation, and emerging trends, including the evolution of tech transfer and innovation, the importance of basic research, and the growth of the American innovation ecosystem. Additionally, it mentions various companies and their innovations, such as GE Healthcare, TNP, and Intel, as well as emerging technologies like AI and IoT.", "keywords": ["ai", "ecosystem", "iot", "business", "innovation", "trends", "evolution", "experience", "merger", "combination", "research", "healthcare", "technology", "company", "ownership"], "sentiment": "positive", "upside": -135.6, "linked": ["TWKS : Several companies, including GE Healthcare, ThoughtSpot, Eleos Health, INFICON, Middleby, E2open, and Red Cat Holdings, are showcasing new technologies and innovations at an expo, with a focus on emerging technologies and growth."], "volume": 12457808.0, "introduction": "Reinvent Technology Partners is a company that focuses on merging or combining with a technology company, with a seasoned management team and significant institutional ownership.", "update": "2025-02-28", "current": 8.76, "category": "stock"}, {"company": "Canaan Inc", "symbol": "CAN", "statement": "Canaan Inc., a Singapore-based company, provides AI solutions, including AI chips, algorithm development, and hardware modules. The company's stock price has been declining, with a 68% loss over the past year, and a 26% drop in the last 30 days. Despite this, the company has received an order from CleanSpark for its Avalon A1566I miners, and has reported a profitable quarter with a net income of $295.87 million. However, investors have lost 15% of their investment, and the company's CEO Nangeng Zhang is the largest shareholder with 12% of shares outstanding.", "keywords": ["stock", "miners", "profit", "ai", "loss", "order", "price", "investors", "decline", "income", "hardware", "singapore", "shareholder", "chips", "solutions", "company", "algorithm"], "sentiment": "negative", "upside": -146.8, "linked": [], "volume": 16907152.0, "introduction": "Canaan Inc., a Singapore-based AI solutions company, has seen its stock price decline 68% over the past year, but has received an order and reported a profitable quarter, despite investors losing 15% of their investment.", "update": "2025-02-28", "current": 2.09, "category": "stock"}, {"company": "CNH Industrial NV", "symbol": "CNH", "statement": "CNH Industrial, a world-class equipment, technology, and services company, has formed a partnership with FIEMG Lab to boost open innovation and generate value for the market. The company has also announced changes to its global leadership team. Additionally, CNH has won several awards, including the Good Design Awards, and has introduced new products, such as autonomous electric tractors. The company is expected to see a decline in equipment sales in 2025, but is focused on innovation, sustainability, and productivity.", "keywords": ["productivity", "innovation", "partnership", "products", "sales", "awards", "technology", "services", "sustainability", "equipment", "leadership"], "sentiment": "positive", "upside": 160.9, "linked": [], "volume": 17033364.0, "introduction": "CNH Industrial has formed a partnership with FIEMG Lab to drive innovation and value creation, while also announcing leadership changes, award wins, and new product introductions, despite anticipating a decline in equipment sales in 2025.", "update": "2025-02-28", "current": 12.96, "category": "stock"}, {"company": "Microsoft Corp", "symbol": "MSFT", "statement": "Microsoft is transforming its IT organization to support its global workforce of over 220,000 employees. The company is also investing in artificial intelligence (AI) innovation, with a major partnership with NVIDIA and a new quantum computing chip, Majorana 1. Microsoft's CEO, Satya Nadella, has led the company's growth and innovation, including the acquisition of LinkedIn and GitHub. The company is also expanding its partnership with Veeam Software to build AI-powered products. Additionally, Microsoft is highlighting its cloud and AI solutions for various industries, including manufacturing, and is investing in new products and features, such as Copilot Studio and Factory Safety Agent.", "keywords": ["ai", "veeam", "growth", "safety", "nvidia", "copilot", "factory", "it", "cloud", "innovation", "partnership", "linkedin", "manufacturing", "acquisition", "majorana", "workforce", "microsoft", "github", "studio"], "sentiment": "positive", "upside": -50.0, "linked": [], "volume": 14658498.0, "introduction": "Microsoft is transforming its IT organization to support its global workforce and investing in AI innovation through partnerships with NVIDIA and Veeam Software, as well as developing new products and features.", "update": "2025-02-28", "current": 444.06, "category": "stock"}, {"company": "Micron Technology Inc", "symbol": "MU", "statement": "Micron Technology, Inc. has announced the shipment of its 1γ (1-gamma) DRAM, a sixth-generation (10nm-class) DRAM node-based DDR5 memory designed for next-generation CPUs. This milestone builds on Micron's previous 1α and 1β DRAM node leadership, delivering innovations that will power future computing platforms. The 1γ DRAM offers up to 9200MT/s speed capabilities, with a 15% speed increase and over 20% power reduction compared to its predecessor. Micron's new DRAM node is designed to support AI workloads and is expected to propel the development of future computing platforms.", "keywords": ["power", "ai", "speed", "cpu", "dram", "innovation", "computing", "node", "memory", "platforms", "ddr5", "leadership"], "sentiment": "positive", "upside": -62.8, "linked": [], "volume": 19387106.0, "introduction": "Micron Technology has shipped its 1γ (1-gamma) DRAM, a 10nm-class DDR5 memory with up to 9200MT/s speed capabilities, 15% speed increase, and 20% power reduction, designed for next-generation CPUs and AI workloads.", "update": "2025-02-28", "current": 103.19, "category": "stock"}, {"company": "AES Corp", "symbol": "AES", "statement": "AES Corporation has achieved its 2024 strategic and financial goals, exceeding market expectations with renewable energy projects and rate base growth in its utilities division. The company signed or awarded 6.8 GW of new contracts, including renewable PPAs and data center load growth. AES initiated 2025 guidance and reaffirmed its long-term growth rate targets. The company's shares rose 5.1% in premarket trading after the announcement, with the company attributing its positive outlook to the contribution of new renewable energy projects and rate base growth.", "keywords": ["utilities", "growth", "positive", "renewable", "energy", "financial", "rate", "targets", "strategic", "shares", "outlook", "contracts", "guidance"], "sentiment": "positive", "upside": -37.9, "linked": [], "volume": 12133432.0, "introduction": "AES Corporation exceeded market expectations, achieving its 2024 goals with renewable energy projects and rate base growth, and initiated 2025 guidance, sending shares up 5.1% in premarket trading.", "update": "2025-02-28", "current": 11.6, "category": "stock"}, {"company": "Hewlett Packard Enterprise Co", "symbol": "HPE", "statement": "Hewlett Packard Enterprise (HPE) is emerging as a key player in the expanding AI market, with new product launches and solutions catering to evolving industry needs. Intel has unveiled its Xeon 6 processors, delivering up to 2.4x the capacity for radio access network (RAN) workloads and 2x higher performance in AI processing. HPE has also hired Beth Wilkinson to defend its $14 billion acquisition of Juniper Networks Inc. from the US Justice Department. Additionally, IBM has completed its acquisition of HashiCorp, creating a comprehensive end-to-end solution for hybrid cloud applications and generative AI.", "keywords": ["ai", "hpe", "ran", "ibm", "hybrid", "intel", "generative", "xeon", "cloud", "hashicorp", "juniper"], "sentiment": "positive", "upside": 101.1, "linked": [], "volume": 9457922.0, "introduction": "Hewlett Packard Enterprise is expanding its presence in the AI market with new product launches and solutions, while Intel has unveiled Xeon 6 processors and IBM has completed its acquisition of HashiCorp.", "update": "2025-02-28", "current": 24.37, "category": "stock"}, {"company": "Crown Electrokinetics Corp.", "symbol": "CRKN", "statement": "Crown ElectroKinetics (CRKN) is a company that has seen its stock price decline by 97.37% since October 2024, with a recent drop of 5.49% on February 24, 2025. The company has announced the addition of two telecommunications veterans to its board to oversee the growth of its fiber optics division, Crown Fiber Optics. CRKN's earnings date is not specified, but it has reported losses in recent years. The company's stock has been downgraded to a \"sell\" rating and has seen its volume increase. CRKN has also announced new products and partnerships in the medical technology sector.", "keywords": ["stock", "fiber", "telecommunications", "losses", "downgrade", "volume", "partnerships", "optics", "decline", "earnings"], "sentiment": "negative", "upside": -721.2, "linked": [], "volume": 36875400.0, "introduction": "Crown ElectroKinetics (CRKN) has seen its stock price plummet 97.37% since October 2024, with recent losses and a \"sell\" rating, despite adding telecom veterans to its board and announcing new products and partnerships.", "update": "2025-02-28", "current": 0.1, "category": "stock"}, {"company": "Nuscale Power Corp", "symbol": "SMR", "statement": "NuScale Power, a leading company in advanced small modular reactors (SMRs), has rescheduled the release of its fourth quarter and full year 2024 results. The company's SMR technology can generate 77 megawatts of electricity and is scalable through flexible configurations. NuScale's stock has surged 553.4% in the trailing 12-month period, outperforming the Zacks Computer & Technology sector. The company has received a buy rating from Craig-Hallum and has received certification for its small modular reactors. Despite some volatility, NuScale's stock has been on an upward trend, with its simple moving average jumping 24.55% in the last 200 days.", "keywords": ["stock", "power", "results", "reactors", "rating", "smr", "nuscale", "electricity", "technology", "volatility", "certification", "trend"], "sentiment": "positive", "upside": -105.6, "linked": [], "volume": 14332117.0, "introduction": "NuScale Power, a leading small modular reactor (SMR) company, has rescheduled its quarterly and annual results, with its stock surging 553.4% in the past year and receiving a buy rating and certification for its SMR technology.", "update": "2025-02-28", "current": 27.97, "category": "stock"}, {"company": "Comcast Corp", "symbol": "CMCSA", "statement": "Comcast NBCUniversal SportsTech has selected 10 new companies for its 2025 program, bringing the total number of pilots, partnerships, and commercial deals to over 162. The program, powered by Boomtown Innovation, aims to drive growth and innovation in the sports industry. The selected companies will work with partners such as NBC Sports, NASCAR, and PGA Tour to develop and test their technologies. The program has already seen success, with alumni achieving significant commercial deals and partnerships.", "keywords": ["sports", "nbcuniversal", "innovation", "comcast", "program", "growth", "partnerships", "deals", "technology", "pilot", "industry", "boomtown", "commercial"], "sentiment": "positive", "upside": 154.8, "linked": [], "volume": 17791812.0, "introduction": "Comcast NBCUniversal SportsTech has selected 10 new companies for its 2025 program, bringing the total number of pilots, partnerships, and commercial deals to over 162, with the selected companies working with partners like NBC Sports and PGA Tour to develop and test their technologies.", "update": "2025-02-28", "current": 37.62, "category": "stock"}, {"company": "Conduit Pharmaceuticals Inc", "symbol": "CDT", "statement": "Conduit Pharmaceuticals has partnered with Charles River Laboratories to evaluate the efficacy of AZD1656, a glucokinase activator, in a preclinical model of systemic lupus erythematosus (SLE) and lupus nephritis (LN). The company's stock price and chart are available, and institutional investors have purchased shares in the last 24 months. Eli Lilly has announced a $27 billion investment in US drug manufacturing, while Alnylam Pharmaceuticals is hosting an R&D Day event to showcase its RNAi therapeutics progress.", "keywords": ["stock", "lupus", "erythematosus", "pharmaceuticals", "chart", "partnership", "investors", "manufacturing", "glucokinase", "efficacy", "azd1656", "activator", "nephritis", "rnai", "therapeutics", "investment"], "sentiment": "positive", "upside": -1079.2, "linked": [], "volume": 24817972.0, "introduction": "Conduit Pharmaceuticals is partnering with Charles River Laboratories to test the effectiveness of AZD1656 in treating systemic lupus erythematosus and lupus nephritis, while also experiencing increased investor interest and other industry news.", "update": "2025-02-28", "current": 0.05, "category": "stock"}, {"company": "Robinhood Markets Inc", "symbol": "HOOD", "statement": "Robinhood Markets, Inc., a commission-free trading platform, has been making waves in the fintech sector with its recent product expansion and strong financial performance. The company's stock has soared, currently valued at $40.78 billion. Robinhood has also received news that the SEC has closed its investigation into the company, which led to a 5.2% drop in shares. Despite this, the company's CEO believes that government oversight is beneficial for the firm. Robinhood has also announced a significant reduction in its workforce and has seen growth in its retirement assets, gold subscribers, and adoption rate.", "keywords": ["ceo", "growth", "valuation", "investigation", "assets", "retirement", "expansion", "performance", "adoption", "subscribers", "reduction", "stock", "commission-free", "sec", "fintech", "trading", "oversight", "workforce", "product", "financial", "drop", "platform"], "sentiment": "positive", "upside": -94.2, "linked": [], "volume": 19477248.0, "introduction": "Robinhood, a commission-free trading platform, has expanded its products, seen strong financial performance, and is valued at $40.78 billion, despite a 5.2% drop in shares after the SEC closed its investigation.", "update": "2025-02-28", "current": 51.12, "category": "stock"}, {"company": "Walmart Inc", "symbol": "WMT", "statement": "Walmart is revolutionizing retail innovation by leveraging cutting-edge Gen AI and advanced engineering solutions to enhance operations, employee experience, and customer satisfaction across 11 countries. The company is investing in technology and supply chains, and emphasizing people as the core of its success. With its new Apple-esque campus, Walmart is diversifying its offerings to include high-end brands and luxury items, and is playing nice with Trump. The company is also using AI to improve customer satisfaction and exceed expectations, and is expanding its e-commerce and digital advertising capabilities.", "keywords": ["digital", "ai", "retail", "engineering", "supply", "innovation", "chain", "customer", "employee", "luxury", "brands", "operations", "advertising", "people", "e-commerce", "satisfaction", "technology", "success", "campus"], "sentiment": "positive", "upside": -35.4, "linked": [], "volume": 14855248.0, "introduction": "Walmart is transforming its retail business by investing in technology, supply chains, and employee experience to enhance operations, customer satisfaction, and e-commerce capabilities, while diversifying its offerings with high-end brands and luxury items.", "update": "2025-02-28", "current": 94.76, "category": "stock"}, {"company": "Walgreens Boots Alliance Inc", "symbol": "WBA", "statement": "Sycamore Partners is planning to split Walgreens Boots Alliance into three parts if a deal to take the company private is reached. The plan would involve separating Walgreens' US retail pharmacy business, Boots UK, and its US healthcare business, with each unit having a distinct capital structure. This move would give the buyer flexibility to operate each business independently, potentially improving performance and increasing value.", "keywords": ["private", "retail", "structure", "flexibility", "value", "capital", "performance", "boots", "healthcare", "pharmacy"], "sentiment": "positive", "upside": -1597.2, "linked": [], "volume": 12702696.0, "introduction": "Sycamore Partners plans to split Walgreens Boots Alliance into three parts if the company goes private, separating its US retail pharmacy business, Boots UK, and US healthcare business, allowing for independent operation and potential improvement of performance and value.", "update": "2025-02-28", "current": 11.87, "category": "stock"}, {"company": "Microvast Holdings Inc", "symbol": "MVST", "statement": "Microvast Holdings (NasdaqCM:MVST) has seen a 104% surge in shareholder returns, driven by recent strategic developments. The company is set to unveil its next-generation fast-charging battery solutions at Smart Energy Week 2025, featuring improved charging speed, increased cycle life, and enhanced safety standards. The company has also announced its quarterly earnings, missing analysts' estimates, but still reporting a revenue increase. Despite this, its stock price has declined, with some institutional investors selling shares. Microvast is an advanced battery technology company that designs, develops, and manufactures battery components and systems for electric commercial vehicles and utility-scale energy storage.", "keywords": ["battery", "speed", "charging", "price", "investors", "vehicles", "life", "safety", "surge", "holdings", "developments", "estimates", "technology", "nasdaqcm", "solutions", "revenue", "earnings", "storage"], "sentiment": "negative", "upside": -181.1, "linked": [], "volume": 14145979.0, "introduction": "Microvast Holdings, an advanced battery technology company, has seen a 104% surge in shareholder returns driven by recent developments, but its stock price declined despite reporting a revenue increase, as institutional investors sold shares.", "update": "2025-02-28", "current": 2.18, "category": "stock"}, {"company": "Snap Inc", "symbol": "SNAP", "statement": "Snap Inc. has announced a partnership with Later, a platform for influencer marketing, allowing for the discovery of creator profiles within Later's platform and integration with Snapchat's APIs. Snap Inc. has also partnered with Co-op, a growth marketing platform, to drive millions of downloads and reinforced its confidence in Snap as a key growth partner. Additionally, Snap Inc. is hiring a Principal Machine Learning Engineer, Generative AI for Ads, and has announced a partnership with Las Vegas-based news station KTNV-TV. The company is also exploring new uses for AI in industries such as healthcare and manufacturing.", "keywords": ["marketing", "ai", "partnership", "manufacturing", "growth", "influencer", "discovery", "healthcare", "news", "engineering", "downloads", "apis", "confidence", "platform", "integration", "ads"], "sentiment": "positive", "upside": -126.1, "linked": [], "volume": 18671880.0, "introduction": "Snap Inc. has formed partnerships with Later, Co-op, and KTNV-TV, and is hiring a Principal Machine Learning Engineer to explore new AI uses in industries like healthcare and manufacturing.", "update": "2025-02-28", "current": 10.89, "category": "stock"}, {"company": "Alibaba Group Holding Ltd", "symbol": "BABA", "statement": "Alibaba Group Holding Ltd. has announced a massive investment of over $53 billion (380 billion yuan) in cloud computing and artificial intelligence (AI) infrastructure over the next three years, a significant pivot for the company as it seeks to establish itself as a global leader in AI and cloud computing. This investment, which exceeds the company's spending in AI and cloud computing over the past decade, is expected to drive growth and innovation in the company's cloud computing and AI capabilities.", "keywords": ["ai", "leader", "innovation", "computing", "pivot", "growth", "infrastructure", "technology", "cloud", "investment"], "sentiment": "positive", "upside": -54.0, "linked": [], "volume": 18520500.0, "introduction": "Alibaba Group Holding Ltd. will invest over $53 billion in cloud computing and AI infrastructure over the next three years to establish itself as a global leader in AI and cloud computing.", "update": "2025-02-28", "current": 89.14, "category": "stock"}, {"company": "Coca-Cola Co", "symbol": "KO", "statement": "Coca-Cola is introducing new products and innovations to stay competitive in the market. The company has launched \"We All Scream for Orange Cream\", a new trademark innovation with a unique flavor profile. Additionally, Coca-Cola is entering the \"better for you\" soda category with its own response to Poppi and Olipop. The company is also expanding its product line with dairy and protein shakes, and has acquired Fairlife, a brand known for its ultra-filtered milk and protein shakes. Coca-Cola is also bringing back a popular discontinued soda flavor and has introduced the Limited Edition Coca-Cola Y3000, a futuristic drink co-created with AI.", "keywords": ["ai", "better", "milk", "flavor", "protein", "profile", "dairy", "innovation", "edition", "acquisition", "competitive", "soda", "category", "market", "futuristic", "product", "brand", "response", "limited", "shakes"], "sentiment": "positive", "upside": -52.0, "linked": [], "volume": 19226488.0, "introduction": "Coca-Cola is introducing new products and innovations, including \"We All Scream for Orange Cream\", a \"better for you\" soda category, dairy and protein shakes, and the reintroduction of a discontinued flavor, as well as a limited edition futuristic drink co-created with AI.", "update": "2025-02-28", "current": 61.92, "category": "stock"}, {"company": "Coinbase Global Inc", "symbol": "COIN", "statement": "Coinbase Global, Inc. (COIN) has been a topic of interest among investors, with its stock being searched heavily on Zacks.com. The company, a leading cryptocurrency exchange platform, faces regulatory challenges and has seen its stock price fluctuate. Analysts predict a 29% increase in revenues and a 27% decline in earnings per share in 2025. The company's CEO, Brian Armstrong, predicts agentic commerce will be a major trend this year. With a market capitalization of $53.6 billion, Coinbase offers a suite of products and services, including its crypto payment provider and developer platform. The company's fundamentals and regulatory environment are expected to shape its future performance.", "keywords": ["commerce", "revenues", "ceo", "cryptocurrency", "coinbase", "fundamentals", "capitalization", "trend", "earnings", "products", "environment", "stock", "challenges", "regulatory", "predict", "services", "market", "price", "analysts", "exchange", "platform"], "sentiment": "positive", "upside": -47.7, "linked": [], "volume": 9693380.0, "introduction": "Coinbase Global, Inc. (COIN), a leading cryptocurrency exchange platform, faces regulatory challenges and fluctuating stock prices, with analysts predicting 29% revenue growth and 27% EPS decline in 2025.", "update": "2025-02-28", "current": 298.0, "category": "stock"}, {"company": "Globalstar Inc", "symbol": "GSAT", "statement": "Globalstar Inc., a company that offers satellite IoT solutions, has announced its 2024 financial results, with revenue increasing 12% to a record $250.3 million. The company's two-way satellite IoT solution provides efficient tracking and monitoring of assets, processing smart data at the edge, and managing analytics with cloud-based telematics solutions. The company's stock has seen a 25.35% quarter-over-quarter increase in sales, indicating a positive trend. The company's Q4 2024 performance is expected to have been driven by continued momentum across Service and Subscriber equipment revenue segments.", "keywords": ["iot", "sales", "increase", "trend", "results", "tracking", "performance", "satellite", "inc", "cloud", "momentum", "monitoring", "telematics", "record", "globalstar", "financial", "solutions", "revenue", "analytics"], "sentiment": "positive", "upside": -103.7, "linked": [], "volume": 9545924.0, "introduction": "Globalstar Inc. reported a 12% revenue increase to a record $250.3 million in 2024, driven by growth in its two-way satellite IoT solutions and cloud-based telematics services.", "update": "2025-02-28", "current": 1.98, "category": "stock"}, {"company": "R1 RCM Inc", "symbol": "RCM", "statement": "The article discusses the U.S. Revenue Cycle Management (RCM) market, which is expected to reach USD 456.78 million. R1 RCM, a leading provider of RCM solutions, has acquired Acclara, a technology-driven RCM company, for USD 675 million. RCM Technologies has expanded its Human Capital Management (HCM) software services with UKG Ready, enabling businesses to optimize payroll, time tracking, talent management, and employee engagement. The company has also launched a reseller program for UKG Ready, enhancing its HCM solutions.", "keywords": ["management", "rcm", "cycle", "tracking", "program", "capital", "software", "talent", "time", "engagement", "payroll", "acquisition", "services", "human", "market", "technology", "solutions", "revenue", "reseller"], "sentiment": "positive", "upside": -125.31, "linked": [], "volume": 12802169.0, "introduction": "The article reports on the growth of the U.S. Revenue Cycle Management market, with R1 RCM acquiring Acclara for $675 million and RCM Technologies expanding its Human Capital Management software services with UKG Ready.", "update": "2025-02-28", "current": 14.31, "category": "stock"}, {"company": "Uber Technologies Inc", "symbol": "UBER", "statement": "Uber is expanding its global presence to over 70 countries and 10,000 cities, using cutting-edge technologies like machine translation and large language models to deliver localized services. The company is also shifting its focus to SaaS, which is expected to provide a competitive edge in the mobility and logistics industry. Uber's CEO, Dara Khosrowshahi, has expressed concerns about Tesla's plans to go solo with its robotaxi rollout, making Uber a potential competitor. The company is also exploring new products and services, such as delivery and logistics, and is working to improve its data strategy to support its AI-driven decision-making.", "keywords": ["robotics", "ai", "expansion", "data", "logistics", "decision-making", "localization", "strategy", "technology", "competition", "saas", "globalization", "mobility"], "sentiment": "positive", "upside": -84.8, "linked": [], "volume": 14244347.0, "introduction": "Uber is expanding its global presence and services to over 70 countries and 10,000 cities, leveraging cutting-edge technologies and shifting its focus to SaaS, while also exploring new products and services and improving its data strategy.", "update": "2025-02-28", "current": 68.56, "category": "stock"}, {"company": "Transocean Ltd", "symbol": "RIG", "statement": "Transocean Ltd. (NYSE:RIG) has seen its shares acquired by the State of New Jersey, with a 1-year low of $3.28 and a 1-year high of $6.88. The company reported revenue of $952 million in the latest quarter, missing analyst expectations. Analysts predict a loss of $0.14 per share for the current year. Despite this, Barclays has set a new price target of $4.00 and maintained a \"Buy\" rating. The company is an international provider of offshore contract drilling services, and its shares have traded down recently, with a market cap of $2.71 billion. Several class-action lawsuits have been filed against the company, alleging securities violations.", "keywords": ["stocks", "services", "expectations", "loss", "lawsuits", "price", "analysts", "securities", "drilling", "shares", "energy", "target", "contract", "violations", "market", "revenue", "offshore", "profit"], "sentiment": "negative", "upside": -207.2, "linked": [], "volume": 20076724.0, "introduction": "Transocean Ltd., an offshore contract drilling services provider, has seen its shares acquired by the State of New Jersey, with analysts predicting a loss this year despite a recent price target of $4.00 from Barclays.", "update": "2025-02-28", "current": 3.85, "category": "stock"}, {"company": "AGNC Investment Corp", "symbol": "AGNC", "statement": "AGNC Investment Corp. (AGNC) reported quarterly earnings that missed estimates, with earnings per share of $0.37 and a dividend yield of 13.66%, higher than the average Finance company. Analysts rate AGNC more positively than other Finance companies, with a consensus rating score of 2.70. Insiders have sold 430,598 shares in the last 24 months, and institutional investors such as Clearbridge Investments and Bank of America have sold significant amounts. The company's dividend payout ratio is 148.45%, which may not be sustainable. Despite this, AGNC's stock price is trading below $11, making it a potentially compelling opportunity for investors.", "keywords": ["insiders", "investors", "finance", "analysts", "institutional", "opportunity", "rating", "sustainable", "consensus", "dividend", "estimates", "ratio", "payout", "yield", "earnings"], "sentiment": "negative", "upside": 236.2, "linked": [], "volume": 15968187.0, "introduction": "AGNC Investment Corp. reported earnings that missed estimates, but its high dividend yield and analyst ratings make it a potentially compelling opportunity for investors despite concerns about its unsustainable dividend payout ratio.", "update": "2025-02-28", "current": 9.68, "category": "stock"}, {"company": "Eyenovia Inc", "symbol": "EYEN", "statement": "Eyenovia, an ophthalmic technology company, has restructured its debt to enhance its cash runway and fuel growth prospects. The company has amended its senior secured convertible debt, deferring monthly interest and amortization payments from March to September 2025, and allowing for the conversion of debt into common shares starting from the same period. This strategic move is expected to improve Eyenovia's cash flow, enabling it to focus on developing its proprietary Optejet device, which has the potential to become a new revenue stream and drive growth.", "keywords": ["runway", "conversion", "growth", "convertible", "focus", "cash", "device", "payments", "cashflow", "prospects", "shares", "debt", "revenue", "interest", "restructuring"], "sentiment": "positive", "upside": -3072.9, "linked": [], "volume": 29827856.0, "introduction": "Eyenovia restructured its debt, deferring interest and amortization payments until 2025 and allowing conversion to shares, to enhance its cash runway and fuel growth prospects.", "update": "2025-02-28", "current": 0.06, "category": "stock"}, {"company": "Cisco Systems Inc", "symbol": "CSCO", "statement": "Cisco and NVIDIA have expanded their partnership to accelerate AI adoption in the enterprise. The partnership aims to integrate Cisco's networking expertise with NVIDIA's Spectrum-X Ethernet platform, enabling interoperability and simplifying AI infrastructure management. Cisco will develop data center solutions using NVIDIA's AI technology, and the companies will work together to provide AI-driven solutions to enterprises. The partnership is expected to drive innovation and business transformation, with Cisco's CEO Jim Kavanaugh stating that the partnership has already resulted in cutting-edge AI solutions.", "keywords": ["acceleration", "expertise", "ai", "transformation", "innovation", "partnership", "business", "simplification", "infrastructure", "technology", "development", "solutions", "enterprise", "interoperability", "integration", "networking"], "sentiment": "positive", "upside": -81.1, "linked": [], "volume": 14244901.0, "introduction": "Cisco and NVIDIA have partnered to accelerate AI adoption in the enterprise by integrating Cisco's networking expertise with NVIDIA's Spectrum-X Ethernet platform, enabling simplified AI infrastructure management and driving innovation and business transformation.", "update": "2025-02-28", "current": 62.23, "category": "stock"}, {"company": "Kenvue Inc", "symbol": "KVUE", "statement": "Kenvue, a consumer health company, faces challenges in the competitive landscape of the consumer health and personal care sectors. Despite decent growth, the company struggles with profitability. Piper Sandler has raised its price target for Kenvue to $27 from $24, citing improvements in margin trajectory, and maintains an \"overweight\" rating. Kenvue's quarterly revenue was $3.9 billion, with a net profit of $383 million. The company operates through three segments: Self Care, Skin Health and Beauty, and Essential Health, and has a market cap of $37.96 billion.", "keywords": ["profit", "growth", "margin", "challenges", "profitability", "health", "trajectory", "rating", "target", "competition", "revenue", "market", "cap", "company", "consumer", "landscape"], "sentiment": "positive", "upside": -33.2, "linked": [], "volume": 12022862.0, "introduction": "Kenvue, a consumer health company, faces challenges in the competitive market but has seen improvements in its margin trajectory, with Piper Sandler raising its price target to $27 and maintaining an \"overweight\" rating.", "update": "2025-02-28", "current": 20.78, "category": "stock"}, {"company": "Intuitive Machines Inc", "symbol": "LUNR", "statement": "Intuitive Machines, a Houston-based space exploration company, is launching its second lunar lander, IM-2, to the moon's south pole. The mission aims to find resources and test cellular technology on the lunar surface, and is part of NASA's Artemis program. The lander is carrying a range of innovative technologies, including a \"battle-hardened\" design and a camera system from Redwire. The mission builds on Intuitive Machines' historic first mission, which successfully landed on the moon's surface last year.", "keywords": ["camera", "nasa", "innovation", "artemis", "space", "resources", "exploration", "lander", "design", "mission", "lunar", "technology", "company", "moon"], "sentiment": "positive", "upside": -258.8, "linked": [], "volume": 23845542.0, "introduction": "Intuitive Machines is launching its second lunar lander, IM-2, to the moon's south pole to find resources and test cellular technology, building on its successful first mission and part of NASA's Artemis program.", "update": "2025-02-28", "current": 23.07, "category": "stock"}, {"company": "Paramount Global", "symbol": "PARA", "statement": "Paramount Global (PARA) has reported its fourth quarter and full year 2024 earnings, with revenue up 5% year-over-year to $7.98 billion, but EPS down to -$0.11, missing expectations. The company will host a conference call and webcast to discuss the results. Analysts expect a 6.1% increase in revenue to $8.106 billion, and the company is expected to show a rise in quarterly revenue. Paramount Global will also participate in the Las Vegas Consumer Electronics Show to debut its latest products.", "keywords": ["global", "quarter", "consumer", "earnings", "results", "products", "eps", "conference", "show", "call", "financials", "expectations", "year", "electronics", "webcast", "paramount", "ces", "las vegas", "analysts", "revenue"], "sentiment": "negative", "upside": -469.2, "linked": ["MRSN : Mersana Therapeutics will present at investor events on March 3 and 11, 2025, to discuss its Q4 and year-end 2024 financial results."], "volume": 22042392.0, "introduction": "Paramount Global reported Q4 and full year 2024 earnings with revenue up 5% to $7.98 billion, but EPS down to -$0.11, missing expectations.", "update": "2025-02-28", "current": 11.07, "category": "stock"}, {"company": "Exxon Mobil Corp", "symbol": "XOM", "statement": "ExxonMobil has launched its new Signature Polymers brand, aiming to become the industry's most valued global partner through improved service and partnership. The company is committed to innovation, providing materials for onsite tests, circularity recommendations, and new approaches to solve problems. ExxonMobil has also invested $200 million in the Kipper 1B Project in Australia to boost gas supply, and has announced a new approach to carbon capture and storage. The company's stock price is predicted to fluctuate between $120 and $145 in the coming years.", "keywords": ["materials", "innovation", "partnership", "supply", "fluctuation", "circularity", "capture", "carbon", "storage", "prediction"], "sentiment": "positive", "upside": -64.7, "linked": [], "volume": 13925682.0, "introduction": "ExxonMobil has launched its Signature Polymers brand, aiming to become a global partner through improved service and innovation, while also investing in gas supply and carbon capture projects.", "update": "2025-02-28", "current": 108.66, "category": "stock"}, {"company": "Triton International Ltd", "symbol": "TRTN", "statement": "Global companies are showcasing cutting-edge technologies at the CIIE, including Siemens Healthineers' new MRI equipment. The American innovation ecosystem is still thriving, with companies like Triton International reporting positive earnings and investing in new manufacturing plants. Other news includes Infineon's acquisition of an Austin fab and Eli Lilly's $27 billion investment in US drug manufacturing. Additionally, there is news on the automotive industry's innovation outlook and a report on Triton International's quarterly earnings.", "keywords": ["global", "triton", "cutting-edge", "lilly", "infineon", "mri", "earnings", "industry", "siemens", "plants", "fab", "companies", "ciie", "ecosystem", "innovation", "manufacturing", "international", "acquisition", "technologies", "healthineers", "austin", "automotive", "eli", "investment"], "sentiment": "positive", "upside": 187.8, "linked": [], "volume": 10882200.0, "introduction": "Global companies are showcasing cutting-edge technologies at the CIIE, including Siemens Healthineers' new MRI equipment, with other news including Infineon's acquisition of an Austin fab and Eli Lilly's $27 billion investment in US drug manufacturing.", "update": "2025-02-28", "current": 79.55, "category": "stock"}, {"company": "Recursion Pharmaceuticals Inc", "symbol": "RXRX", "statement": "Recursion Pharmaceuticals, a clinical-stage biotech company, has been making headlines with its recent merger with AI biotech Exscientia, worth $688 million, and its plans to report its fourth-quarter and full-year 2024 financial results on February 28. The company, which is developing a pipeline of medicines using its proprietary Recursion Operating System, is also considering an Amazon Prime-style subscription model for selling its medicines. Recursion's stock has been surging, with a recent 4.74% increase, and the company is expected to host a earnings call on February 28 to provide business updates and discuss its financial results.", "keywords": ["stock", "pipeline", "ai", "biotech", "pharmaceuticals", "results", "medicine", "finance", "merger", "letmeknowifyou'dlikemetohelpwithanythingelse", "call", "earnings"], "sentiment": "positive", "upside": -165.9, "linked": [], "volume": 24966518.0, "introduction": "Recursion Pharmaceuticals, a clinical-stage biotech company, is set to report its financial results and discuss its plans, including a potential Amazon Prime-style subscription model, on February 28.", "update": "2025-02-28", "current": 7.33, "category": "stock"}, {"company": "Applied Science Products Inc", "symbol": "APLD", "statement": "The article discusses various topics related to innovation, technology, and science. It highlights the importance of basic research in government-supported labs and universities, as well as the potential for automation and holistic solutions in product development. It also mentions the challenges faced by businesses in terms of repetitive tasks and the potential benefits of robotic process automation (RPA) solutions. Additionally, it touches on the advancements in single-cell proteomics and immunopeptidomics, as well as the importance of collaboration and innovation in various fields such as machine learning, optics, and photonics.", "keywords": ["robotics", "immunopeptidomics", "learning", "innovation", "business", "science", "automation", "machine", "research", "technology", "proteomics", "development", "photonics", "optics", "collaboration", "product"], "sentiment": "positive", "upside": -171.4, "linked": [], "volume": 14938410.0, "introduction": "The article explores the intersection of innovation, technology, and science, highlighting the importance of basic research, automation, and collaboration in fields like machine learning, optics, and photonics.", "update": "2025-02-28", "current": 8.96, "category": "stock"}, {"company": "Lumen Technologies Inc", "symbol": "LUMN", "statement": "Lumen Technologies has selected Ciena's optical technology to support its AI workloads, utilizing Ciena's WaveLogic 6 Extreme (WL6e) to drive significant economic benefits for operators, including a 50% increase in bandwidth efficiency. The move is expected to help Lumen meet growing demand for AI workloads. The company's stock has seen a surge in value, up 7.77% in recent days, driven by news of the partnership and strong quarterly earnings. The company's CEO has been at the helm since 2018, and the company has been expanding its network and services to support growing demand for AI and other advanced technologies.", "keywords": ["ciena", "stock", "services", "ai", "lumen", "ceo", "value", "partnership", "advanced", "efficiency", "technology", "demand", "wavelogic", "optical", "network", "operators", "earnings", "bandwidth"], "sentiment": "positive", "upside": -277.7, "linked": [], "volume": 12041460.0, "introduction": "Lumen Technologies has partnered with Ciena to utilize its WaveLogic 6 Extreme technology to boost bandwidth efficiency by 50% and meet growing demand for AI workloads.", "update": "2025-02-28", "current": 5.92, "category": "stock"}, {"company": "Peloton Interactive Inc", "symbol": "PTON", "statement": "Peloton Interactive, Inc. (PTON) has been in the news recently, with its CEO Peter Stern having spent over 20 years in senior roles at big tech and media companies, making him a strong fit to lead the company into a growth and innovation era. The company has announced its participation in the Morgan Stanley Technology, Media & Telecom Conference, and its CFO Liz Coddington will participate in a fireside chat. Peloton has also launched a new app, Peloton Strength+, and has reported earnings, with a projected growth in earnings next year. The company's stock price has been fluctuating, but some analysts believe it has the potential to double by 2030.", "keywords": ["stock", "potential", "ceo", "innovation", "growth", "analysts", "participation", "experience", "leadership", "conference", "cfo", "technology", "projection", "fit", "earnings", "telecom", "media"], "sentiment": "positive", "upside": -161.4, "linked": [], "volume": 9125277.0, "introduction": "Peloton Interactive, led by CEO Peter Stern and CFO Liz Coddington, has launched a new app, reported earnings, and is participating in a Morgan Stanley conference, with analysts predicting potential growth and a doubling of its stock price by 2030.", "update": "2025-02-28", "current": 8.4, "category": "stock"}, {"company": "Fubotv Inc", "symbol": "FUBO", "statement": "FuboTV, a sports-first live TV streaming platform, reported its Q4 2024 results, with revenue reaching $443.277 million and an adjusted EPS loss of 2 cents. The company announced plans to launch a new Sports & Broadcasting service. FuboTV also merged with Disney's Hulu + Live TV, creating a combined subscriber count exceeding 6.2 million in North America. The company reported record revenue and paid subscribers, achieving its first quarter of positive free cash flow.", "keywords": ["service", "sports", "loss", "eps", "hulu", "disney", "subscribers", "tv", "cash", "streaming", "launch", "revenue", "record"], "sentiment": "positive", "upside": -175.5, "linked": [], "volume": 25155248.0, "introduction": "FuboTV reported Q4 2024 results with revenue of $443.277 million and an adjusted EPS loss of 2 cents, while announcing a new service and merger with Disney's Hulu + Live TV, exceeding 6.2 million subscribers.", "update": "2025-02-28", "current": 4.04, "category": "stock"}, {"company": "JetBlue Airways Corp", "symbol": "JBLU", "statement": "JetBlue Airways Corporation is expanding its cruise offerings, allowing customers to book standalone cruises and earn rewards. The airline is also partnering with Plusgrade to launch a new rewards transfer program with Capital One. Additionally, JetBlue has introduced a new craft beer, Surf Beer, on its flights and is exploring new partnerships with multiple airlines. The airline is also expanding its route network and introducing new aircraft.", "keywords": ["network", "expansion", "beer", "aircraft", "airways", "partnering", "cruise", "rewards"], "sentiment": "positive", "upside": -252.5, "linked": [], "volume": 14025745.0, "introduction": "JetBlue is expanding its cruise offerings, launching a rewards transfer program with Capital One, introducing a new craft beer, and expanding its route network and aircraft fleet.", "update": "2025-02-28", "current": 8.07, "category": "stock"}, {"company": "Merck & Co Inc", "symbol": "MRK", "statement": "Merck, a pharmaceutical company, has made recent announcements about its mRNA cancer vaccine, cardiovascular pipeline, and other projects. The company has secured a $30 million commitment from Delaware to set up a new facility, and its executives will participate in a fireside chat at the TD Cowen 45th Annual Health Care Conference. Merck has also announced the reconstitution of its M-M-R vaccine and exceeded market returns. The company is shifting its focus to cardiovascular pipeline after its Keytruda success, with a TGF-beta-targeting PAH drug being a potential new therapy.", "keywords": ["pipeline", "commitment", "focus", "therapy", "vaccine", "conference", "cancer", "returns", "cardiovascular", "pharmaceutical", "facility"], "sentiment": "positive", "upside": -71.4, "linked": [], "volume": 12236716.0, "introduction": "Merck, a pharmaceutical company, has made recent announcements about its mRNA cancer vaccine, cardiovascular pipeline, and other projects, including securing a $30 million commitment and exceeding market returns.", "update": "2025-02-28", "current": 95.55, "category": "stock"}, {"company": "Wolfspeed Inc", "symbol": "WOLF", "statement": "Wolfspeed, Inc. (WOLF) is a semiconductor company based in Durham, North Carolina, specializing in silicon carbide and gallium nitride technologies. The company, formerly known as Cree, Inc., was incorporated in 1987 and has a negative net margin and trailing twelve-month return on equity. Insider buying signals confidence in the company, with a Director acquiring shares in 2024. The company has launched new technology and reported earnings results, but missed analysts' estimates. Analysts have provided ratings and price targets for the stock.", "keywords": ["cree", "wolf", "carolina", "shares", "estimates", "targets", "return", "earnings", "results", "durham", "inc", "director", "stock", "ratings", "semiconductor", "silicon", "acquisition", "nitride", "gallium", "margin", "north", "analysts", "insider", "technology", "equity", "buying", "carbide"], "sentiment": "negative", "upside": -461.9, "linked": ["TTEK : Tetra Tech, Inc. (TTEK) reported earnings per share of $0.35, exceeding estimates, with a strong return on equity and net margin, despite institutional ownership decline and a decrease in short interest."], "volume": 13710478.0, "introduction": "Wolfspeed, Inc., a semiconductor company specializing in silicon carbide and gallium nitride technologies, has a negative net margin and trailing twelve-month return on equity, despite insider buying and new technology launches.", "update": "2025-02-28", "current": 6.67, "category": "stock"}, {"company": "Hecla Mining Co", "symbol": "HL", "statement": "Hecla Mining Company, the largest U.S. and Canadian silver producer, released its February 2025 update, focusing on operational excellence, portfolio optimization, and growth. The company reported record sales and adjusted EBITDA for 2024, with 16.2 million ounces of silver produced. Hecla Mining is a leading miner of precious and base metals, with operations across the U.S., Canada, Asia, and its flagship Lucky Friday and Star Morning silver mines. The company has a strong focus on returns and free cash flow generation, as well as ESG leadership.", "keywords": ["optimization", "flow", "growth", "esg", "metals", "sales", "cash", "ebitda", "production", "mining", "operations", "returns", "silver", "leadership"], "sentiment": "positive", "upside": -102.7, "linked": [], "volume": 13762123.0, "introduction": "Hecla Mining Company, the largest U.S. and Canadian silver producer, reported record sales and adjusted EBITDA for 2024 and produced 16.2 million ounces of silver, focusing on operational excellence, portfolio optimization, and growth.", "update": "2025-02-28", "current": 5.49, "category": "stock"}, {"company": "Cipher Mining Inc", "symbol": "CIFR", "statement": "Cipher Mining, a company spun off from Bitcoin mining hardware giant Bitfury, has acquired over 500 acres of land in Texas and reported revenue of $42 million and adjusted earnings of $51 million in the latest quarter. The company's CEO will participate in industry conferences to discuss its growth strategy and existing site capacity. Cipher Mining aims to be a market leader in bitcoin mining, data center construction, and hosting partner to the world's largest HPC companies. The company reported a net loss of $87 million in Q3 2024 and has a total self-mining hashrate of approximately 13.5 EH/s.", "keywords": ["growth", "data", "mining", "hpc", "earnings", "partner", "loss", "hashtag", "center", "market", "capacity", "leader", "cipher", "hosting", "texas", "bitcoin", "strategy", "bitfury", "revenue"], "sentiment": "positive", "upside": -162.0, "linked": [], "volume": 17340020.0, "introduction": "Cipher Mining, a company spun off from Bitfury, acquired 500 acres of Texas land, reported $42 million revenue and $51 million adjusted earnings in Q3, and aims to be a market leader in bitcoin mining and data center construction.", "update": "2025-02-28", "current": 5.9, "category": "stock"}, {"company": "Sunnova Energy International Inc", "symbol": "NOVA", "statement": "Sunnova Energy International Inc. (NOVA) has announced its solar and battery storage-integrated, Zero Energy Ready Home (ZERH) at VISION House Las Vegas. The company, a leading adaptive energy services provider, aims to make clean energy more accessible, reliable, and affordable for homeowners. The ZERH is part of Green Builder Media's VISION House series, designed to advance sustainability. Sunnova has also sold $296 million worth of asset-backed securities and has been selected by Beazer Homes for its national showcase.", "keywords": ["clean", "growth", "energyefficiency", "residential", "power", "environment", "performance", "renewable", "energy", "storage", "home", "innovation", "green", "efficiency", "solar", "infrastructure", "sustainability", "development", "accessibility", "leadership", "technology", "integration", "affordable", "systems"], "sentiment": "positive", "upside": -610.4, "linked": ["RUN : Sunrun, a residential solar and battery system provider, reported its Q4 and full-year 2024 financial results, with over 20,000 customers participating in virtual power plant programs across nine states and territories."], "volume": 10045774.0, "introduction": "Sunnova Energy International Inc. has launched a solar and battery storage-integrated Zero Energy Ready Home (ZERH) at VISION House Las Vegas, aiming to make clean energy more accessible, reliable, and affordable for homeowners.", "update": "2025-02-28", "current": 3.24, "category": "stock"}, {"company": "Carnival Corp", "symbol": "CCL", "statement": "Carnival Corporation, the world's largest cruise company, is working to improve fuel efficiency and reduce emissions through innovative hull designs, new hardware and technology, and underwater drone inspection and cleaning trials. The company aims to achieve net-zero GHG emissions by 2050 and is testing new hull coatings with advanced biofouling prevention to evaluate durability and efficiency. These efforts are part of its strategy to maximize hydrodynamic performance and enhance ongoing hull maintenance, which reduces a ship's underwater drag and fuel consumption.", "keywords": ["design", "net", "drag", "hydrodynamics", "zero", "consumption", "performance", "emissions", "coatings", "cruise", "fuel", "biofouling", "hull", "innovation", "efficiency", "durability", "carnival", "maintenance", "strategy", "technology", "corporation", "sustainability"], "sentiment": "positive", "upside": -76.3, "linked": [], "volume": 15688947.0, "introduction": "Carnival Corporation, the world's largest cruise company, is working to reduce emissions and improve fuel efficiency through innovative hull designs, new technology, and underwater inspections and cleaning.", "update": "2025-02-28", "current": 25.42, "category": "stock"}, {"company": "Medical Properties Trust Inc", "symbol": "MPW", "statement": "Medical Properties Trust (MPW) rallied 13% on Thursday, despite the broader markets being down, due to its fourth-quarter earnings report. The real estate investment trust, which owns and operates hospital facilities, reported a narrower net loss per share of $0.69, beating estimates. The company's growth and development of net-leased hospital facilities, with 441 facilities and 44,000 licensed beds, has made it one of the largest owners of hospital real estate globally.", "keywords": ["global", "properties", "medical", "trust", "loss", "facilities", "hospital", "net", "growth", "estate", "rally", "shares", "real", "development", "report", "earnings"], "sentiment": "positive", "upside": -572.6, "linked": [], "volume": 17636662.0, "introduction": "Medical Properties Trust (MPW) rallied 13% on Thursday after reporting a narrower net loss per share of $0.69, beating estimates, despite the broader markets being down.", "update": "2025-02-28", "current": 4.69, "category": "stock"}, {"company": "Pinduoduo Inc", "symbol": "PDD", "statement": "Pinduoduo, a Chinese e-commerce company, is expanding its global reach, having launched an online marketplace called \"Temu\" in the US. The company has formed multiple large-scale model teams and is investing in AI to improve its ecosystem. Pinduoduo's shift in strategy is a response to global competitive pressures and a desire to refine its brand image and supply chain capabilities. The company has disrupted traditional e-commerce models in China and has raised over $1.6 billion in its IPO. Pinduoduo is now entering the US market, which is expected to have an impact on Alibaba. The company's innovative business model has led to significant growth, with sales of marked products increasing by over 138% compared to last year.", "keywords": ["brand", "alibaba", "ai", "e-commerce", "supplychain", "expansion", "innovation", "growth", "disruption", "ipo", "strategy", "competition", "globalization", "marketplace"], "sentiment": "positive", "upside": 158.8, "linked": [], "volume": 12641314.0, "introduction": "Pinduoduo, a Chinese e-commerce company, is expanding its global reach by launching an online marketplace called \"Temu\" in the US, a move expected to impact Alibaba and driven by a desire to refine its brand image and supply chain capabilities.", "update": "2025-02-28", "current": 111.34, "category": "stock"}, {"company": "BigBear.ai Holdings Inc", "symbol": "BBAI", "statement": "BigBear.ai, a leading provider of AI-powered decision intelligence solutions, is deploying its ConductorOS at Exercise Talisman Sabre 2025. The company's stock has seen significant growth, surging 165% in the last quarter, driven by key events such as its participation in the exercise and securing contracts with the US Army and Navy. BigBear.ai offers solutions for national security, supply chain management, and digital identity, and has partnered with SoftPoint. The company's inclusion in the Russell 2000 Value Index and significant contracts have enhanced investor visibility and demand.", "keywords": ["military", "digital", "management", "value", "growth", "softpoint", "defense", "decision", "artificial", "supply", "stock", "russell", "innovation", "intelligence", "partnership", "chain", "identity", "index", "security", "market", "visibility", "technology"], "sentiment": "positive", "upside": -511.4, "linked": [], "volume": 29238060.0, "introduction": "BigBear.ai, a leading AI-powered decision intelligence solutions provider, is deploying its ConductorOS at Exercise Talisman Sabre 2025, driving its stock growth by 165% in the last quarter.", "update": "2025-02-28", "current": 4.13, "category": "stock"}, {"company": "Citigroup Inc", "symbol": "C", "statement": "Citi is collaborating with FinTech partners to drive growth and efficiency, and is offering a compelling valuation despite lower profitability metrics. The bank is undergoing a significant transformation under CEO Jane Fraser, with a focus on core businesses and restructuring. Citi has set her compensation at $34.5 million, a 33% increase from the previous year. The bank has hired a new head of its private bank for North America and is renaming its diversity, equity, and inclusion team. Citi estimates that Chinese and Taiwanese companies will invest around $500 billion in outbound investments over the next five years, and is among the best Fortune 500 stocks to buy, with a strong market value of $43 trillion.", "keywords": ["stocks", "ceo", "value", "growth", "valuation", "restructuring", "transformation", "diversity", "investments", "businesses", "efficiency", "fintech", "profitability", "market", "inclusion", "compensation", "equity", "core", "outbound", "collaboration"], "sentiment": "positive", "upside": -58.9, "linked": [], "volume": 15021470.0, "introduction": "Citi is undergoing a transformation under CEO Jane Fraser, focusing on core businesses and restructuring, with a strong market value and a compelling valuation despite lower profitability metrics.", "update": "2025-02-28", "current": 81.48, "category": "stock"}, {"company": "Marvell Technology Group Ltd", "symbol": "MRVL", "statement": "Marvell Technology has received high scores from Lightwave+BTR Innovation Reviews, and its products have been recognized as among the best in the industry. The company has been making waves in the tech world with its cutting-edge AI solutions and 5G innovations, partnering with top-tier firms to power smart applications across sectors. Marvell's Q4 results are expected to exceed estimates, driven by strong demand for AI networking and application-specific integrated circuits. The company's stock has rallied on investor enthusiasm, and it is considered a leader in the semiconductor industry, along with Nvidia, Broadcom, and Taiwan Semiconductor Manufacturing Company.", "keywords": ["ai", "circuits", "marvell", "estimates", "applications", "reviews", "q4", "enthusiasm", "partnerships", "networking", "stock", "scores", "innovation", "semiconductor", "sectors", "demand", "5g", "leader", "technology", "solutions", "industry"], "sentiment": "positive", "upside": -134.4, "linked": [], "volume": 9542648.0, "introduction": "Marvell Technology has received high praise for its cutting-edge AI solutions and 5G innovations, driving strong demand and exceeding expectations, with its stock rallying on investor enthusiasm.", "update": "2025-02-28", "current": 124.02, "category": "stock"}, {"company": "PG&E Corp", "symbol": "PCG", "statement": "Procter & Gamble (P&G) is a multinational consumer goods corporation founded in 1837 by William Procter and James Gamble. The company is organized into segments including beauty, grooming, healthcare, fabric and home care, and baby, feminine, and family care. P&G is traded on the NYSE and is a component of the S&P 500. The company has released its quarterly earnings, beating estimates, and has announced plans to keep rates stable through 2025. The stock price is currently around $172.08, with a forecasted upside of 4.85%. P&G has also launched a new soap opera called \"Beyond the Gates\" and has a strong presence on social media platforms.", "keywords": ["grooming", "stocks", "opera", "care", "baby", "estimates", "earnings", "consumer", "soap", "feminine", "beauty", "multinational", "rates", "goods", "home", "media", "family", "healthcare", "stable", "finance", "forecast", "social", "corporation", "fabric"], "sentiment": "positive", "upside": 56.2, "linked": [], "volume": 20685864.0, "introduction": "Procter & Gamble is a multinational consumer goods corporation founded in 1837, organized into various segments, and has recently released its quarterly earnings, beating estimates, with a current stock price and forecasted upside.", "update": "2025-02-28", "current": 16.54, "category": "stock"}, {"company": "Bloom Energy Corp", "symbol": "BE", "statement": "Bloom Energy Corporation reported record revenue of $1.47 billion for the full year 2024, driven by growth in product and service revenue. The company achieved record revenue and profits for both the fourth quarter and the entire year. Bloom Energy's solid oxide fuel cell technology enables cleaner and more reliable on-site power generation, helping businesses meet rising energy demands sustainably. The company has expanded its data center power agreement with Equinix, a leading digital infrastructure company, and has collaborated with SoCalGas and Caltech on a hydrogen project.", "keywords": ["service", "power", "generation", "agreement", "growth", "profits", "sustainable", "technology", "energy", "hydrogen", "revenue", "record", "collaboration", "product"], "sentiment": "positive", "upside": -109.5, "linked": [], "volume": 11694563.0, "introduction": "Bloom Energy Corporation reported record revenue of $1.47 billion in 2024, driven by growth in product and service revenue, with the company achieving record revenue and profits for both the fourth quarter and the entire year.", "update": "2025-02-28", "current": 29.81, "category": "stock"}, {"company": "Nextera Energy Inc", "symbol": "NEE", "statement": "NextEra Energy, Inc. (NEE) is a top pick among investors, with a growing customer base and diverse solutions, poised for big gains. The company has a strong return on equity and has increased its quarterly dividend, reflecting its commitment to shareholder value. NEE is also a leading renewable energy company, with a diverse portfolio of wind, solar, nuclear, coal, and natural gas facilities. The company has formed a strategic partnership with GE Vernova to develop natural gas generation solutions, opening up new avenues for growth and diversification. NEE is considered a good investment opportunity, with Wall Street analysts recommending it as a \"buy\" and its dividend aristocrat status making it attractive to income-seeking investors.", "keywords": ["natural", "growth", "growing", "diverse", "wind", "gains", "renewable", "energy", "partnership", "diversification", "opportunity", "solar", "dividend", "aristocrat", "investors", "nuclear", "analysts", "equity", "buy", "solutions", "gas", "investment"], "sentiment": "positive", "upside": -54.5, "linked": [], "volume": 23938956.0, "introduction": "NextEra Energy, Inc. (NEE) is a top pick among investors due to its strong return on equity, growing customer base, and diverse renewable energy portfolio, making it a good investment opportunity for both growth and income.", "update": "2025-02-28", "current": 72.83, "category": "stock"}, {"company": "Keurig Dr Pepper Inc", "symbol": "KDP", "statement": "Keurig Dr Pepper reported strong Q4 and full-year 2024 results, with net sales increasing 5.2% to $4.1 billion and adjusted EPS of $0.58, beating analyst estimates. The company reported a 10.3% increase in U.S. refreshment beverage net sales and a 1.5% operating margin. The company's CEO attributed the strong performance to its social media efforts and the success of its Dirty Soda brand. Keurig Dr Pepper also provided guidance for 2025, expecting net sales growth in the mid-single-digit range and adjusted EPS growth in the high-single-digit range.", "keywords": ["brand", "media", "results", "net", "growth", "performance", "eps", "sales", "social", "earnings", "guidance"], "sentiment": "positive", "upside": 34.8, "linked": [], "volume": 8763313.0, "introduction": "Keurig Dr Pepper reported strong Q4 and full-year 2024 results, with 5.2% net sales growth and beating analyst estimates, driven by social media efforts and the success of its Dirty Soda brand.", "update": "2025-02-28", "current": 31.15, "category": "stock"}, {"company": "Oracle Corp", "symbol": "ORCL", "statement": "Oracle has been named a leader in the 2025 IDC MarketScape for Worldwide Public Cloud Services, offering customers flexibility and control over their data and applications across hyperscalers. The company has expanded its Oracle Cloud Infrastructure (OCI) to 50 public cloud regions across 24 countries, with more sites planned. Oracle's Fusion Cloud Applications Suite has been enhanced with AI capabilities, and its Fusion Cloud Service has been recognized as a standard of excellence in SaaS service technology. The company has also achieved various awards and recognitions, including being named a leader in Oracle Cloud and Technology, and has continued to grow its cloud business in the US.", "keywords": ["ai", "flexibility", "control", "data", "fusion", "applications", "marketscape", "hyperscalers", "cloud", "recognition", "infrastructure", "oracle", "awards", "suite", "regions", "leader", "excellence", "idc", "technology", "saas", "countries"], "sentiment": "positive", "upside": -88.4, "linked": [], "volume": 12050373.0, "introduction": "Oracle has been named a leader in the 2025 IDC MarketScape for Worldwide Public Cloud Services, offering customers flexibility and control over their data and applications across 50 public cloud regions in 24 countries.", "update": "2025-02-28", "current": 183.6, "category": "stock"}, {"company": "Digital World Acquisition Corp", "symbol": "DJT", "statement": "CoStar Group has acquired Matterport, a leading provider of digital home tours and virtual staging technology. Digital World Acquisition has raised $300 million in an initial public offering and has made several acquisitions, including IBM's purchase of DataStax, a provider of NoSQL and vector database capabilities. The tech industry is expected to see significant mergers and acquisitions in 2025, driven by companies seeking to stay ahead in a rapidly changing market. Meanwhile, Advantech is a leading brand in IoT intelligent systems and Industry 4.0 technology.", "keywords": ["digital", "nosql", "iot", "database", "virtual", "acquisition", "intelligent", "industry4", "staging", "technology", "vector", "market", "mergers", "industry", "systems"], "sentiment": "positive", "upside": -129.7, "linked": [], "volume": 8378045.0, "introduction": "The tech industry is expected to see significant mergers and acquisitions in 2025, driven by companies seeking to stay ahead in a rapidly changing market, with recent examples including CoStar Group's acquisition of Matterport and Digital World Acquisition's $300 million IPO and acquisitions.", "update": "2025-02-28", "current": 32.71, "category": "stock"}, {"company": "Canoo Inc", "symbol": "GOEV", "statement": "Several electric vehicle manufacturers have gone bankrupt, including Canoo, which was forced to pay a $1.5 million fine for misreporting revenue. Meanwhile, Nikola, another EV manufacturer, has filed for bankruptcy. In other news, GE Healthcare is showcasing new medical technologies in China, while Cato Networks' CEO Shlomo Kramer was named one of the most innovative tech startup leaders. Advantech launched a family of edge appliances for network security, and Dresden & Company is pushing the boundaries of basket technology. Additionally, a little-known Chinese company developed a drug that beat the world's leading treatments for a particular disease, and Avant Technologies reached a milestone in global development and commercialization of its Vision AI platform.", "keywords": ["edge", "ai", "commercialization", "platform", "treatment", "startups", "fine", "bankruptcy", "tech", "disease", "innovation", "vehicle", "security", "china", "development", "network", "appliance", "medical", "leader", "technologies", "electric", "revenue", "manufacturer"], "sentiment": "positive", "upside": -51254.7, "linked": [], "volume": 278908670.0, "introduction": "Several electric vehicle manufacturers have struggled, including Canoo's $1.5 million fine and Nikola's bankruptcy, while other companies have made breakthroughs in healthcare, technology, and innovation.", "update": "2025-02-28", "current": 0.48, "category": "stock"}, {"company": "Lam Research Corp", "symbol": "LRCX", "statement": "Lam Research Corporation is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry, enabling the production of smaller and better performing devices. The company's products and services are used in the production of advanced memory and logic chips, and its equipment is critical for TSV formation and advanced packaging processes. Lam Research is recognized as a leading supplier of advanced wafer fabrication equipment and services, and its employees are dedicated to driving innovation and solving the biggest challenges in the semiconductor industry.", "keywords": ["advanced", "innovation", "fabrication", "semiconductor", "tsv", "packaging", "logic", "challenges", "memory", "production", "wafer", "devices", "technology", "chips", "services", "industry", "equipment", "leadership"], "sentiment": "positive", "upside": -39.1, "linked": [], "volume": 8978737.0, "introduction": "Lam Research Corporation is a leading supplier of innovative wafer fabrication equipment and services, enabling the production of smaller and better performing devices in the semiconductor industry.", "update": "2025-02-28", "current": 79.68, "category": "stock"}, {"company": "Pacific Biosciences of California Inc", "symbol": "PACB", "statement": "Pacific Biosciences of California, Inc. is a company that designs, develops, and manufactures sequencing solutions to resolve genetically complex problems. The company's stock has received a consensus rating of Moderate Buy, with analysts predicting an inline return from the shares. The company's Q4 2024 results were disappointing, with revenue and margin misses, and 2025 guidance below expectations. Several large investors have recently made changes to their positions in the company. An insider sold shares of the company's stock, and the company will participate in a health care conference.", "keywords": ["stocks", "biotechnology", "shares", "california", "guidance", "sequencing", "results", "investing", "conference", "healthcare", "predictions", "margin", "insidertrading", "genomics", "biotech", "investors", "finance", "analysts", "rating", "stockmarket", "pacific", "revenue"], "sentiment": "negative", "upside": -536.2, "linked": [], "volume": 20040912.0, "introduction": "Pacific Biosciences of California, Inc. has a moderate buy rating, but its Q4 2024 results were disappointing and guidance for 2025 is below expectations.", "update": "2025-02-28", "current": 1.65, "category": "stock"}, {"company": "Kinder Morgan Inc", "symbol": "KMI", "statement": "Kinder Morgan, Inc. has announced several significant developments, including a $640 million deal to acquire a gas pipeline, a growth forecast for the industry, and the announcement of new pipeline projects. The company's Permian Highway Pipeline has finalized its investment, and its Tennessee Gas Pipeline has announced a new project. Kinder Morgan's fourth-quarter earnings were mixed, but the company predicts growth in 2025. The company's stock price has fluctuated, but it remains a major player in the energy infrastructure industry, with a diverse range of businesses and projects.", "keywords": ["stock", "pipeline", "business", "forecast", "acquisition", "growth", "infrastructure", "energy", "development", "industry", "earnings", "investment"], "sentiment": "positive", "upside": -5.6, "linked": ["MRO : Comstock Fuels partners with Marathon Petroleum to develop lignocellulosic biomass refining solutions, while ConocoPhillips acquires Marathon Oil for $22 billion, boosting its resources and expected production growth."], "volume": 12764777.0, "introduction": "Kinder Morgan, Inc. has announced various developments, including a $640 million pipeline acquisition, growth forecasts, and new pipeline projects, with its stock price fluctuating despite being a major player in the energy infrastructure industry.", "update": "2025-02-28", "current": 30.27, "category": "stock"}, {"company": "Sunrun Inc", "symbol": "RUN", "statement": "Sunrun, a residential solar and battery system provider, reported its Q4 and full-year 2024 financial results, with over 20,000 customers participating in virtual power plant programs across nine states and territories. The company's stock price fell 3.66% on October 2, and analysts expect a quarterly loss of $0.27 per share. Sunrun's prices are sometimes higher than other solar energy providers due to its technology. The company's services, cost, and customer reviews are discussed in various articles, with some customers expressing satisfaction and others expressing concerns about the cost.", "keywords": ["customers", "cost", "provider", "concerns", "reviews", "system", "power", "battery", "loss", "renewable", "energy", "stock", "green", "services", "price", "analysts", "satisfaction", "technology", "solar"], "sentiment": "negative", "upside": -183.4, "linked": ["NOVA : Sunnova Energy International Inc. has launched a solar and battery storage-integrated Zero Energy Ready Home (ZERH) at VISION House Las Vegas, aiming to make clean energy more accessible, reliable, and affordable for homeowners."], "volume": 17331664.0, "introduction": "Sunrun, a residential solar and battery system provider, reported its Q4 and full-year 2024 financial results, with over 20,000 customers participating in virtual power plant programs across nine states and territories.", "update": "2025-02-28", "current": 10.23, "category": "stock"}, {"company": "CVS Health Corp", "symbol": "CVS", "statement": "CVS Health has formed an alliance with Microsoft to develop a digital-first technology foundation, and has acquired Signify Health, a home health care services company, for $8 billion. The acquisition presents opportunities for CVS to drive growth and expansion in the healthcare industry. CVS has also reported strong quarterly earnings, beating estimates and showing growth in revenues. Analysts are optimistic about the company's future, with Leerink Partners reiterating a Buy rating and setting a price target of $75.00.", "keywords": ["alliance", "revenues", "expansion", "growth", "acquisition", "rating", "health", "optimistic", "technology", "target", "industry", "earnings"], "sentiment": "positive", "upside": 82.7, "linked": [], "volume": 13082734.0, "introduction": "CVS Health forms an alliance with Microsoft and acquires Signify Health for $8 billion, driving growth and expansion in healthcare, and reports strong quarterly earnings, with analysts optimistic about its future.", "update": "2025-02-28", "current": 54.55, "category": "stock"}, {"company": "Red Cat Holdings Inc", "symbol": "RCAT", "statement": "Red Cat Holdings, a drone technology company, has announced that its Black Widow and FlightWave Edge 130 drones have been selected for the Blue UAS Refresh program, pending NDAA verification and cybersecurity review. This is a significant achievement, making Red Cat the first US-based drone manufacturer to source motors from Unusual Machines. The company has also received a $518,000 order for its Edge 130 drone from the Army National Guard and another US government agency. The drones are designed for military, government, and commercial operations, providing critical situational awareness and actionable intelligence.", "keywords": ["review", "achievement", "verification", "cybersecurity", "motors", "drone", "program", "announcement", "guard", "national", "company", "intelligence", "army", "selection", "agency", "operations", "government", "awareness", "technology", "manufacturer"], "sentiment": "positive", "upside": -127.7, "linked": [], "volume": 12865448.0, "introduction": "Red Cat Holdings, a US-based drone manufacturer, has had its Black Widow and FlightWave Edge 130 drones selected for the Blue UAS Refresh program and received a $518,000 order from the Army National Guard and another government agency.", "update": "2025-02-28", "current": 8.63, "category": "stock"}, {"company": "Faraday Future Intelligent Electric Inc", "symbol": "FFIE", "statement": "Faraday Future, a California-based global shared intelligent electric mobility ecosystem company, has launched a Global AI Innovation Competition, inviting individuals, teams, and companies worldwide to contribute cutting-edge AI solutions that enhance vehicle intelligence, driving experiences, and human-machine interaction. The competition aims to redefine the future of mobility and disrupt the automotive industry. The company plans to change its ticker to \"FFAI\" on March 10 and host a \"FF Open AI Day\" on March 17.", "keywords": ["global", "ai", "ecosystem", "innovation", "intelligence", "experience", "machine", "vehicle", "future", "automotive", "technology", "electric", "competition", "human", "california", "industry", "mobility"], "sentiment": "positive", "upside": -2522.0, "linked": [], "volume": 9802119.0, "introduction": "Faraday Future, a global electric mobility company, has launched a global AI innovation competition to enhance vehicle intelligence, driving experiences, and human-machine interaction, with plans to change its ticker to \"FFAI\" and host an \"FF Open AI Day\" on March 17.", "update": "2025-02-28", "current": 1.45, "category": "stock"}, {"company": "Unity Software Inc", "symbol": "U", "statement": "Unity Software is a leading platform for creating and operating interactive, real-time 3D content, and is set to migrate its ad network to a new platform, Unity Vector, in the first quarter. The company's revenue has been declining, with a 25% year-over-year decline in Q4 2024, and a 17% decrease in full-year 2024 revenue. Unity has announced a proposed $500 million offering and priced an upsized $600 million offering, and its stock price has declined 2.4% in recent days. The company's software solutions support creators through the development lifecycle, and its platform is used by enterprises, small businesses, and individuals to create and grow interactive content.", "keywords": ["stock", "lifecycle", "unity", "content", "business", "decline", "offering", "software", "ad", "individual", "migration", "vector", "creators", "revenue", "network", "development", "enterprise", "platform"], "sentiment": "negative", "upside": -144.2, "linked": [], "volume": 9501645.0, "introduction": "Unity Software, a leading platform for creating and operating interactive 3D content, is planning to migrate its ad network to a new platform, Unity Vector, in the first quarter, amidst declining revenue and a recent stock price decline.", "update": "2025-02-28", "current": 22.32, "category": "stock"}, {"company": "Vertiv Holdings Co", "symbol": "VRT", "statement": "Vertiv Holdings Co (VRT) is a digital infrastructure technology company that provides solutions for data centers, communication networks, and commercial environments. The company's Digital KVM solutions are expected to grow from $10.30 billion to $31.56 billion by 2032, driven by strong demand. Despite recent market volatility, VRT's growth trajectory is expected to withstand and attract investor confidence. The company's portfolio, focusing on data centers, communication networks, and commercial environments, positions it at the heart of the digital revolution. With a strong financial performance, including EPS of $2.37 and total revenue of $4.6 billion, VRT is a trending stock with a Buy rating from Evercore ISI and a price target of $150.00.", "keywords": ["networks", "data", "growth", "environments", "performance", "\"and\"", "volatility", "\"a\"", "portfolio", "centers", "infrastructure", "etc.andfocusedonthemostimportantandrelevantwordsthatconveythemainideasandthemesofthesentence", "demand", "target", "rating", "note:i'veexcludedcommonstopwordslike\"the\"", "technology", "solutions", "confidence", "revenue"], "sentiment": "positive", "upside": -94.7, "linked": [], "volume": 8507476.0, "introduction": "Vertiv Holdings Co (VRT) is a digital infrastructure technology company with a strong growth trajectory, driven by demand for its Digital KVM solutions, and is a trending stock with a Buy rating and price target of $150.00.", "update": "2025-02-28", "current": 146.32, "category": "stock"}, {"company": "Ast Spacemobile Inc", "symbol": "ASTS", "statement": "AST SpaceMobile, a satellite communications company, has secured a $43 million contract to support the U.S. Space Force's satellite-based cellular network. The company's technology allows for live video calls between devices connected via satellite and cellular networks, with Verizon and AT&T testing this capability in recent trials. The tests, which included a live video call between two mobile devices, one connected via satellite and the other via Verizon's terrestrial network, demonstrate the capability of AST SpaceMobile's technology for specialized government and commercial applications. The company's BlueBird satellites, launched in September, are now being tested with smartphones supporting voice, data, and video applications, and the FCC has given temporary clearance for the satellites to connect with up to 2,000 devices in the US.", "keywords": ["satellites", "trials", "applications", "bluebird", "fcc", "satellite", "communications", "clearance", "video", "calls", "cellular", "verizon", "government", "network", "force", "at&t", "space", "technology", "commercial"], "sentiment": "positive", "upside": -125.1, "linked": [], "volume": 12003951.0, "introduction": "AST SpaceMobile has secured a $43 million contract to support the US Space Force's satellite-based cellular network, enabling live video calls between devices connected via satellite and cellular networks.", "update": "2025-02-28", "current": 20.35, "category": "stock"}, {"company": "Meta Platforms Inc", "symbol": "META", "statement": "Meta Platforms, Inc., formerly known as Facebook, Inc., is a pioneer in artificial intelligence and digital connectivity. The company is constantly upgrading its products and services, integrating multiple platforms to provide a seamless digital experience and increasing user engagement. Meta plans to release a standalone AI app and raise $35 billion to fund its data center push in the US. The company's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal, and it has acquired several companies, including Oculus and Giphy. Meta is expanding its AI reach with Arabic support and has a strong commitment to AI democratization, driving innovation in AI technologies, LLMs, and open-source frameworks.", "keywords": ["digital", "data", "portal", "oculus", "watch", "products", "facebook", "llms", "democratization", "artificial", "engagement", "innovation", "intelligence", "connectivity", "experience", "app", "center", "services", "arabic", "giphy", "platforms", "messenger", "frameworks"], "sentiment": "positive", "upside": -29.5, "linked": [], "volume": 19003096.0, "introduction": "Meta Platforms, Inc. (formerly Facebook) is a pioneer in AI and digital connectivity, constantly upgrading products and services, planning a standalone AI app and raising $35 billion for data centers, with a strong commitment to AI democratization.", "update": "2025-02-28", "current": 647.49, "category": "stock"}, {"company": "Boeing Co", "symbol": "BA", "statement": "Boeing has made several announcements in the past few days. Collins Aerospace, a subsidiary of RTX, has been selected by Boeing to provide the ACES II ejection seat for the F-15EX aircraft. Boeing is also looking to divest its Insitu drone unit, a defense subsidiary that manufactures small, long-range military drones. Additionally, Boeing has announced the selection of GEnx engines to power new 787 Dreamliners, and has showcased the capabilities of its ScanEagle drone, which provides persistent imagery for commercial and defense missions.", "keywords": ["787", "boeing", "drone", "dreamliners", "genx", "defense", "aces", "seat", "ejection", "f15ex", "rtx", "engines", "scaneagle", "aircraft", "imagery", "unit", "collins", "announcements", "aerospace", "insitu", "divest"], "sentiment": "positive", "upside": -130.3, "linked": [], "volume": 9003419.0, "introduction": "Boeing has made several announcements, including selecting Collins Aerospace for the ACES II ejection seat for the F-15EX, considering divesting its Insitu drone unit, and selecting GEnx engines for new 787 Dreamliners.", "update": "2025-02-28", "current": 176.06, "category": "stock"}, {"company": "Host Hotels & Resorts Inc", "symbol": "HST", "statement": "Host Hotels & Resorts, Inc. (HST) has been named one of the world's most sustainable companies by S&P Global's 2025 Sustainability Yearbook for the sixth consecutive year. The company is a real estate investment trust that operates luxury and upper-upscale hotels, and has reported a strong fourth-quarter performance with earnings surpassing expectations. Despite headwinds, HST projects modest comparable hotel RevPAR growth of 0.5%-2.5% for 2025. The company's dividend yield is lower than the average Finance company, but its dividend payout ratio is expected to be more sustainable next year.", "keywords": ["trust", "earnings", "estate", "finance", "performance", "inc", "luxury", "dividend", "hst", "real", "resorts", "investment", "yield", "sustainability", "hotels"], "sentiment": "positive", "upside": 52.2, "linked": [], "volume": 10220377.0, "introduction": "Host Hotels & Resorts, Inc. has been named one of the world's most sustainable companies by S&P Global for the sixth consecutive year, despite reporting modest RevPAR growth projections and a lower dividend yield compared to the average finance company.", "update": "2025-02-28", "current": 16.94, "category": "stock"}, {"company": "Quantum-Si Inc", "symbol": "QSI", "statement": "Quantum-Si Incorporated is a life sciences company that develops a single-molecule detection platform for next-generation protein sequencing. The company's platform includes the Platinum NGPS instrument, software, and reagent kits. Insiders who acquired shares over the past year are still profitable despite a 12% decline in the stock price. The company is expected to report positive earnings, boosted by year-end capital spending and new product launches, despite increased competition and market volatility.", "keywords": ["quantum", "sciences", "shares", "competition", "protein", "earnings", "sequencing", "capital", "software", "spending", "volatility", "kits", "decline", "reagent", "launches", "stock", "detection", "profitable", "product", "si", "instrument", "platform"], "sentiment": "positive", "upside": -207.6, "linked": [], "volume": 15093409.0, "introduction": "Quantum-Si Incorporated, a life sciences company, is expected to report positive earnings despite a 12% decline in its stock price, driven by year-end capital spending and new product launches.", "update": "2025-02-28", "current": 2.3, "category": "stock"}, {"company": "Bristol-Myers Squibb Co", "symbol": "BMY", "statement": "Bristol Myers Squibb is a global biopharmaceutical company that is advancing its oncology pipeline through the use of collaborative hybrid intelligence, which combines human ingenuity with leading edge technology. The company has recently received FDA approvals for its Opdivo and Abecma treatments, and has signed deals to expand its capabilities in antibody-drug conjugates. The company is also focused on cost management, with plans to achieve $1 billion in savings by 2025 and an additional $1 billion by 2027.", "keywords": ["approvals", "pipeline", "oncology", "intelligence", "conjugates", "fda", "cost", "biopharmaceutical", "savings", "technology", "treatments"], "sentiment": "positive", "upside": -130.0, "linked": [], "volume": 12325724.0, "introduction": "Bristol Myers Squibb is a global biopharmaceutical company advancing its oncology pipeline through hybrid intelligence, with recent FDA approvals and deals, while also focusing on cost management to achieve $2 billion in savings by 2027.", "update": "2025-02-28", "current": 59.67, "category": "stock"}, {"company": "Freeport-McMoRan Inc", "symbol": "FCX", "statement": "Freeport-McMoRan, the largest copper producer in the US, is poised to thrive in the growing copper market, projected to reach $12.1 billion by 2032. The company has reported strong financial performance and investment in technology and innovation, with annual revenue of $25.46 billion and net income of $1.88 billion in 2024. Despite challenges, Freeport's margins have fallen from 21% to 7.4%, and its stock price has dropped. The company is focusing on copper production and growth opportunities, with a strong financial position and leach initiative to produce copper at low costs.", "keywords": ["initiative", "innovation", "finance", "growth", "leach", "challenges", "copper", "letmeknowifyou'dlikemetohelpwithanythingelse", "production", "margins", "mining", "netincome", "technology", "stockprice", "market", "revenue"], "sentiment": "positive", "upside": -7.8, "linked": [], "volume": 18222910.0, "introduction": "Freeport-McMoRan, the largest US copper producer, is poised to thrive in the growing copper market, despite challenges and declining margins, with a strong financial position and focus on copper production and growth opportunities.", "update": "2025-02-28", "current": 37.81, "category": "stock"}, {"company": "ChargePoint Holdings Inc", "symbol": "CHPT", "statement": "ChargePoint Holdings, Inc. (CHPT) is a leading provider of electric vehicle (EV) charging stations in North America and Europe, aiming to enable the widespread adoption of EVs. However, its stock has been falling due to a non-compliance notice from the New York Stock Exchange (NYSE) and concerns about its growth and security. Despite this, some analysts believe the company may find a bottom soon due to its innovative solutions and growing customer base. Others are concerned about its ability to meet market expectations and the potential for NYSE delisting.", "keywords": ["stock", "delisting", "expectations", "charging", "innovation", "compliance", "growth", "customer", "nyse", "adoption", "vehicle", "security", "electric", "provider"], "sentiment": "negative", "upside": -453.8, "linked": [], "volume": 23508516.0, "introduction": "ChargePoint Holdings, a leading EV charging station provider, faces challenges due to a NYSE non-compliance notice and growth concerns, but some analysts see potential for a turnaround.", "update": "2025-02-28", "current": 1.0, "category": "stock"}, {"company": "3D Systems Corp", "symbol": "DDD", "statement": "3D Systems, a leading additive manufacturing solutions company, empowers manufacturers to create new products and business models through its digital manufacturing ecosystem. The company offers a range of products and services, including 3D printers, print materials, on-demand manufacturing services, and software. 3D Systems has a strong presence in the dental 3D printing market, offering end-to-end solutions and low-cost printers. The company's stock (DDD) has seen fluctuations in recent days, with Barclays increasing its stake in the company and shares experiencing a drop. 3D Systems provides 3D printing and digital manufacturing solutions for plastics and metals, as well as services like maintenance and advanced manufacturing.", "keywords": ["digital", "shares", "products", "software", "metals", "printing", "printers", "stock", "advanced", "ecosystem", "manufacturing", "additive", "services", "market", "materials", "dental", "maintenance", "plastics", "solutions"], "sentiment": "positive", "upside": -592.7, "linked": [], "volume": 10724781.0, "introduction": "3D Systems is a leading additive manufacturing solutions company that offers a range of products and services, including 3D printers, materials, and software, empowering manufacturers to create new products and business models.", "update": "2025-02-28", "current": 3.85, "category": "stock"}, {"company": "Pinterest Inc", "symbol": "PINS", "statement": "Pinterest is a visual discovery and search platform with over 500 million monthly active users worldwide. The company has been evolving its advertising features, including shopping features and creator tools, and has seen growth in its global average revenue per user (ARPU). Pinterest has also issued guidance for its first quarter 2025 earnings, with revenue expected to be between $837-852 million. The company has also made recent acquisitions and has seen growth in its user base and revenue.", "keywords": ["creator", "earnings", "acquisitions", "shopping", "discovery", "advertising", "revenue", "tools", "users", "platform", "pinterest", "guidance"], "sentiment": "positive", "upside": -95.1, "linked": [], "volume": 12530499.0, "introduction": "Pinterest is a visual discovery and search platform with over 500 million monthly active users, experiencing growth in revenue and user base, and has issued guidance for its first quarter 2025 earnings.", "update": "2025-02-28", "current": 32.9, "category": "stock"}, {"company": "Quantumscape Corp", "symbol": "QS", "statement": "QuantumScape Corp (QS) is a research and development stage company focused on solid-state lithium-metal batteries for electric vehicles and other applications. The company has a market capitalization of $1.14 billion and a 1-year price target of $5.75. Several brokerages have issued reports on QS, with HSBC upgrading it from \"reduce\" to \"hold\" and setting a target price of $5.30. The company's financial data shows a 52-week range of $4.65 to $9.52, with a beta of 4.45.", "keywords": ["metal", "batteries", "quantum", "data", "research", "scape", "applications", "brokerages", "capitalization", "beta", "lithium", "range", "reports", "upgrade", "target", "development", "market", "vehicles", "price", "electric", "corp"], "sentiment": "positive", "upside": -190.1, "linked": [], "volume": 10445177.0, "introduction": "QuantumScape Corp, a research and development company focused on solid-state lithium-metal batteries, has a market capitalization of $1.14 billion and a 1-year price target of $5.75.", "update": "2025-02-28", "current": 5.16, "category": "stock"}, {"company": "Altus Midstream Co", "symbol": "ALTM", "statement": "The articles discuss various companies and industries, including Altus Midstream (ALTM) and Minerals Technologies, which are compared based on various factors. Altus Midstream Company and Atlas Lithium Corporation are also compared. The articles also touch on the innovation drive in the energy industry, with companies like GE Healthcare and Williams executing agreements for certified low-emission products. Additionally, there are articles on the attractiveness of US midstream energy plays, smart cities, and disruptive technology ETFs.", "keywords": ["minerals", "agreements", "etfs", "lithium", "products", "energy", "companies", "plays", "cities", "innovation", "healthcare", "attractiveness", "williams", "us", "industries", "technologies", "midstream", "altus", "altas", "technology"], "sentiment": "positive", "upside": -37.3, "linked": [], "volume": 19341980.0, "introduction": "The articles discuss various companies and industries, comparing Altus Midstream and Minerals Technologies, and highlighting innovation in the energy industry and attractiveness of US midstream energy plays.", "update": "2025-02-28", "current": 5.75, "category": "stock"}, {"company": "Patterson-UTI Energy Inc", "symbol": "PTEN", "statement": "Patterson-UTI Energy (PTEN) is a company that provides oilfield services, including drilling and completion fluids, and natural gas-powered frac equipment. The company has been expanding its assets and operating rigs in the US, while also offering mobile power solutions for fracking and drilling. The company's CEO, Michael Sabella, has a long history in the industry, having started his career with his father's company before branching out on his own. PTEN has had a mixed performance in recent times, with its stock price fluctuating and experiencing a recent 2-for-1 stock split. Analysts have issued optimistic forecasts for the company's earnings, and it has received awards for its innovative work in the energy sector.", "keywords": ["ceo", "drilling", "assets", "completion", "mobile", "earnings", "equipment", "power", "fluids", "performance", "forecasts", "energy", "frac", "stock", "fracking", "awards", "services", "oilfield", "innovative", "analysts", "split", "rigs", "industry", "gas"], "sentiment": "positive", "upside": -501.5, "linked": [], "volume": 8393117.0, "introduction": "Patterson-UTI Energy (PTEN) is a US-based oilfield services company that provides drilling and completion fluids, frac equipment, and mobile power solutions, with a CEO with industry experience and mixed performance in recent times.", "update": "2025-02-28", "current": 8.75, "category": "stock"}, {"company": "Chipotle Mexican Grill Inc", "symbol": "CMG", "statement": "Chipotle Mexican Grill has premiered a new animated short film, \"Unfolded\", which showcases sustainable agriculture and the company's Food With Integrity principles. The film premiered as a national TV ad on Roblox, marking the first time a restaurant brand has used the metaverse for a TV ad. The company has also announced new partnerships with innovative companies like Plantible and CH4 Global to offer unique, sustainable, and high-quality menu options. Additionally, Chipotle has debuted a new short film on Roblox, highlighting the importance of the farming community that grows real ingredients. The company has also been investing in digital prowess and has a strong financial position with $1.4 billion in cash, investments, and cash equivalents.", "keywords": ["roblox", "menu", "innovation", "agriculture", "finance", "principles", "farming", "cash", "sustainable", "tv", "ad", "partnerships", "community", "ingredients", "film", "animation", "metaverse", "quality"], "sentiment": "positive", "upside": -52.0, "linked": [], "volume": 11113387.0, "introduction": "Chipotle Mexican Grill has premiered a new animated short film \"Unfolded\" on Roblox, showcasing sustainable agriculture and its Food With Integrity principles, while announcing new partnerships and investing in digital prowess.", "update": "2025-02-28", "current": 56.7, "category": "stock"}, {"company": "Johnson & Johnson", "symbol": "JNJ", "statement": "Johnson & Johnson is a multinational pharmaceutical and medical technology company that innovates at the intersection of biology and technology, focusing on treating complex diseases with pinpoint precision. The company believes health is everything and is working to build a world where diseases are prevented, treated, and cured. In other news, various individuals with the surname Johnson are making headlines, including Mike Johnson, the Speaker of the US House of Representatives, who vows not to cut entitlements, and Will Johnson, a former Michigan star whose NFL draft stock has fallen. Additionally, Alice Marie Johnson has been appointed as Trump's \"pardon czar\", and Johnson College of Technology is receiving funding for its Industry Fast Track Program.", "keywords": ["nfl", "treatment", "disease", "innovation", "cure", "health", "draft", "biology", "politics", "technology", "prevention", "pharmaceutical", "pardon", "precision"], "sentiment": "positive", "upside": -51.4, "linked": [], "volume": 9885562.0, "introduction": "Johnson & Johnson is a pharmaceutical and medical technology company that innovates to treat complex diseases with precision, while various individuals with the surname Johnson are making news in politics, sports, and education.", "update": "2025-02-28", "current": 146.82, "category": "stock"}, {"company": "KeyCorp", "symbol": "KEY", "statement": "KeyCorp's business model focuses on commercial and investment banking expertise, setting it apart in the competitive banking landscape. The company will present at the 2025 RBC Capital Markets Global Financial Institutions Conference. KeyCorp's recent full-year 2024 earnings missed expectations, with a net loss of $306 million and a price target of $21.00 from Barclays. The company's stock outlook is shaped by its BNS investment and NII. KeyCorp operates as the holding company for KeyBank National Association, providing various banking services.", "keywords": ["expertise", "commercial", "loss", "holding", "competitive", "conference", "outlook", "banking", "target", "services", "earnings", "investment", "landscape"], "sentiment": "negative", "upside": -104.6, "linked": [], "volume": 11064423.0, "introduction": "KeyCorp, a commercial and investment banking company, will present at the 2025 RBC Capital Markets Global Financial Institutions Conference, despite missing earnings expectations and facing a challenging outlook.", "update": "2025-02-28", "current": 17.68, "category": "stock"}, {"company": "Core Scientific Inc", "symbol": "CORZ", "statement": "Core Scientific, a leader in digital infrastructure for high-performance computing, has announced a $1.2 billion expansion at its Denton, TX location, solidifying its position as a premier provider of application-specific data centers for HPC workloads. The expansion is a result of a new agreement with CoreWeave, an AI Hyperscaler, bringing in additional $1.2 billion in contracted revenue.", "keywords": ["ai", "computing", "expansion", "agreement", "data", "centers", "workloads", "infrastructure", "scientific", "revenue", "core", "hyperscaler", "hpc"], "sentiment": "positive", "upside": -236.4, "linked": [], "volume": 11035888.0, "introduction": "Core Scientific is expanding its data center in Denton, TX with a $1.2 billion investment, solidifying its position as a premier provider of application-specific data centers, thanks to a new agreement with AI Hyperscaler CoreWeave.", "update": "2025-02-28", "current": 16.34, "category": "stock"}, {"company": "Microchip Technology Inc", "symbol": "MCHP", "statement": "Microchip Technology has launched its MSC750SMA140 discrete mSiC MOSFET, available in a TO-263-7L XL package with 1400V and 750mΩ. Deca Technologies has expanded its wafer-level chip scale packaging and M-Series fan-out wafer level packaging technologies through a collaboration with RRP Electronics. Microchip Technology's MPLAB XC Unified Compiler Licenses have seen a 9.09% increase in share price. There are various collaborations and expansions in the industry, including between GlobalFoundries and MIT, Socionext and Google Quantum AI, and MaxLinear and RFHIC. Additionally, Amazon has joined the quantum computing race, announcing its \"Ocelot\" chip, while Microchip Technology has seen a boost in its share price.", "keywords": ["mit", "ai", "amazon", "packaging", "socionext", "package", "quantum", "licenses", "ocelot", "globalfoundries", "xl", "mosfet", "rfhic", "to-263-7l", "google", "level", "wafer", "microchip", "compiler", "maxlinear", "deca", "technologies", "msc750sma140", "technology"], "sentiment": "positive", "upside": -35.5, "linked": [], "volume": 10295832.0, "introduction": "Microchip Technology has launched a new MOSFET and various companies in the industry have formed collaborations and expanded their technologies, while Microchip's share price has increased.", "update": "2025-02-28", "current": 56.39, "category": "stock"}, {"company": "Nikola Corporation", "symbol": "NKLA", "statement": "Nikola Corporation, a electric and hydrogen fuel cell electric vehicle manufacturer, filed for Chapter 11 bankruptcy protection after its founder Trevor Milton was convicted of securities and wire fraud. The company's collapse is attributed to misleading marketing and deception in the EV industry. Nikola's market value surged to $30 billion before plummeting to bankruptcy, exposing the green tech bubble. The company's assets and technology could live on, but its demise highlights the financial and supply chain woes in the EV sector, with Nikola's bankruptcy being one of two large filings last week.", "keywords": ["marketing", "chain", "green", "woes", "supply", "nikola", "technology", "bankruptcy", "electric", "deception", "financial", "fraud", "industry", "ev"], "sentiment": "negative", "upside": -4215.4, "linked": [], "volume": 41875224.0, "introduction": "Nikola Corporation, an electric and hydrogen fuel cell vehicle manufacturer, filed for Chapter 11 bankruptcy protection after its founder was convicted of fraud, causing its market value to plummet and exposing the financial and supply chain woes in the EV sector.", "update": "2025-02-28", "current": 0.91, "category": "stock"}, {"company": "CSX Corp", "symbol": "CSX", "statement": "CSX Corporation, a rail-based freight transportation services provider, is part of the growing transportation market, which is expected to rise from $6941.93 billion in 2024 to $7522.07 billion in 2025. LongRange Capital has agreed to acquire US Synthetic from ChampionX Corporation, pending regulatory approvals. CSX Corporation provides rail services and transportation of intermodal containers and trailers, and its stock price is currently quoted at $4.6/5. The company's services include transportation of agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment, as well as coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants.", "keywords": ["rail", "growth", "minerals", "steel", "coke", "coal", "forest", "equipment", "power", "transportation", "containers", "metals", "industrial", "stock", "approvals", "ore", "acquisition", "intermodal", "iron", "regulatory", "services", "market", "freight", "price", "fertilizers", "food", "automotive", "electricity", "agricultural", "trailers"], "sentiment": "positive", "upside": -71.3, "linked": [], "volume": 24741722.0, "introduction": "CSX Corporation, a rail-based freight transportation services provider, is expected to benefit from the growing transportation market, which is projected to increase from $6941.93 billion in 2024 to $7522.07 billion in 2025.", "update": "2025-02-28", "current": 32.69, "category": "stock"}, {"company": "Permian Resources Corp", "symbol": "PR", "statement": "Atlas Energy Solutions acquired Moser Energy Systems, expanding its logistics solutions. Permian Resources reported its Q4 2024 results, missing EPS forecast with $0.29 EPS and beating revenue expectations. The company declared a quarterly cash dividend of $0.15 per share and increased full-year guidance. Permian Resources' stock has been upgraded to a Buy rating, driving optimism about its earnings prospects. The company's Q4 adjusted EPS dropped to $0.36 per diluted share, while revenue rose.", "keywords": ["results", "acquisition", "eps", "logistics", "dividend", "upgrade", "energy", "solutions", "earnings", "guidance"], "sentiment": "positive", "upside": -58.2, "linked": [], "volume": 8529477.0, "introduction": "Atlas Energy Solutions acquired Moser Energy Systems, while Permian Resources reported Q4 2024 results, missing EPS forecast but increasing guidance and dividend, and its stock was upgraded to a Buy rating.", "update": "2025-02-28", "current": 15.22, "category": "stock"}, {"company": "Kosmos Energy Ltd", "symbol": "KOS", "statement": "Kosmos Energy, a deepwater oil and gas exploration and production company, reported a net loss of $7 million in the fourth quarter of 2024. The company generated oil and gas revenue of $397.6 million and had a production volume of approximately 66,800 barrels. Kosmos has a diverse portfolio of oil and gas assets, including production and exploration in Ghana, Equatorial Guinea, and the Gulf of America, as well as a world-class gas development in Mauritania and Senegal. The company plans to reduce its leverage ratio to below 1.5 times by the back half of 2026.", "keywords": ["ghana", "production", "assets", "gulf", "oil", "america", "loss", "volume", "senegal", "energy", "guinea", "portfolio", "leverage", "ratio", "equatorial", "mauritania", "exploration", "revenue", "gas"], "sentiment": "negative", "upside": -32.6, "linked": [], "volume": 15448627.0, "introduction": "Kosmos Energy reported a net loss of $7 million in Q4 2024, despite generating $397.6 million in oil and gas revenue, and plans to reduce its leverage ratio to below 1.5 times by 2026.", "update": "2025-02-28", "current": 3.43, "category": "stock"}, {"company": "Uranium Energy Corp", "symbol": "UEC", "statement": "Uranium Energy Corp (UEC) is a uranium mining company with operations in the US, Canada, and Paraguay. The company has achieved several milestones, including intersecting 11.4% eU3O8 over 2.4 meters at the Roughrider North Discovery and achieving a key production milestone with drummed uranium concentrates at the Irigaray Plant. The company has a diverse portfolio of projects, including the Palangana mine and others in Texas. UEC has a strong financial position, with $190.60 million in cash and $2.45 million in debt, giving it a net cash position of $188.15 million or $0.44 per share. The company's stock price has been fluctuating, with a current price of $5.40 and a forecasted increase of 96.85% from the current stock price of 5.40.", "keywords": ["stock", "milestones", "price", "portfolio", "finance", "projects", "uranium", "forecast", "cash", "discovery", "production", "mining", "operations", "energy", "debt", "company"], "sentiment": "positive", "upside": -104.3, "linked": [], "volume": 9015665.0, "introduction": "Uranium Energy Corp (UEC) is a uranium mining company with operations in the US, Canada, and Paraguay, with a strong financial position and a diverse portfolio of projects, including the Palangana mine in Texas.", "update": "2025-02-28", "current": 8.01, "category": "stock"}, {"company": "Stem Inc", "symbol": "STEM", "statement": "The articles discuss various aspects of STEAM education, innovation, and leadership. ACEBOTT is launching innovative products to meet changing educational needs, while MakerBot highlights the benefits of hands-on technology learning. Elevating STEM leadership is crucial, and programs like QUBES provide resources for educators. The US Department of Education is launching an initiative to enhance STEM education for all students. Other news includes the launch of a STEM mobile lab, the report on STEM equity, and the potential negative earnings report from Stem Inc. The Stanford Emerging Technology Review provides policymakers with insights on frontier technologies, and Favero enhances STEM education with innovative lessons.", "keywords": ["qubes", "initiative", "review", "mobile", "earnings", "department", "emerging", "steam", "makerbot", "stanford", "innovation", "stem", "us", "leadership", "lab", "education", "acebott", "technology", "equity", "report", "favero"], "sentiment": "positive", "upside": -3403.1, "linked": [], "volume": 15912758.0, "introduction": "The articles discuss various aspects of STEAM education, innovation, and leadership, highlighting initiatives and products from organizations such as ACEBOTT, MakerBot, and the US Department of Education to enhance STEM education and leadership.", "update": "2025-02-28", "current": 0.78, "category": "stock"}, {"company": "Valley National Bancorp", "symbol": "VLY", "statement": "Valley Bank, a wholly-owned subsidiary of Valley National Bancorp, has partnered with Finley Technologies to launch a credit management system, designed to help mid-sized businesses manage their debt. The system, which replaces legacy technology, enables Valley Bank to focus on growing its loan portfolios while maintaining quality control over its debt. The partnership has already seen success in two initial use cases: securities-based collateral management and syndicated loan servicing. The system provides a fully digital experience across Valley Bank's portfolio, including securities-based and syndicated loan portfolios.", "keywords": ["digital", "system", "management", "control", "partnership", "portfolio", "growth", "credit", "experience", "bank", "technology", "loan", "success", "debt", "quality"], "sentiment": "positive", "upside": -12.9, "linked": [], "volume": 10078324.0, "introduction": "Valley Bank has partnered with Finley Technologies to launch a credit management system, replacing legacy technology and enabling the bank to focus on growing its loan portfolios while maintaining quality control over its debt.", "update": "2025-02-28", "current": 10.17, "category": "stock"}, {"company": "Nano Nuclear Energy Inc", "symbol": "NNE", "statement": "NANO Nuclear Energy Inc. (NASDAQ: NNE) is an advanced technology-driven nuclear energy company focused on developing clean energy solutions. The company is diversifying its business lines across five areas: portable and microreactor technologies, fuel fabrication, fuel transportation, and more. NNE has signed a memorandum of understanding with Everstar AI to leverage AI services for licensing and regulatory frameworks. The company has also been named a Two Star Partner of the Operational Energy Summit and has appointed Darlene T. DeRemer as a key executive. Additionally, NNE has highlighted its recent acquisition of key intellectual property and has announced its active corporate role in the industry.", "keywords": ["clean", "advanced", "transportation", "ai", "microreactor", "industry", "intellectual", "executive", "summit", "technology", "energy", "portable", "regulatory", "property", "frameworks", "fuel", "nuclear"], "sentiment": "positive", "upside": -103.4, "linked": [], "volume": 12122096.0, "introduction": "NANO Nuclear Energy Inc. is a technology-driven company developing clean energy solutions through five business lines, including portable and microreactor technologies, and has made recent strategic moves through partnerships and acquisitions.", "update": "2025-02-28", "current": 44.51, "category": "stock"}, {"company": "Schlumberger NV", "symbol": "SLB", "statement": "Schlumberger, a global technology company, has made several strategic moves to drive growth and efficiency. The company has acquired ChampionX and made a significant contract win with Petrobras. The wellbore cleaning tool market is growing, with companies like Schlumberger innovating solutions like second-generation wellbore conditioning tools. The company's net sales break down into well development and construction, oil production equipment and systems, optimizing reservoir performance and yield, and digital solutions and technological and geophysical services. Schlumberger is also advancing its acquisition of ChampionX after clearing US antitrust hurdles.", "keywords": ["digital", "services", "antitrust", "construction", "innovation", "optimization", "growth", "acquisition", "efficiency", "production", "technology", "contract", "solutions", "wellbore", "yield", "oil"], "sentiment": "positive", "upside": 86.9, "linked": [], "volume": 18999390.0, "introduction": "Schlumberger, a global technology company, has made strategic moves to drive growth and efficiency through acquisitions and contract wins, particularly in the wellbore cleaning tool market.", "update": "2025-02-28", "current": 42.25, "category": "stock"}, {"company": "Occidental Petroleum Corp", "symbol": "OXY", "statement": "Occidental Petroleum Corporation (OXY) has announced a $1.1 billion deal to acquire Carbon Engineering Ltd. and a $1.1 billion project to expand its facility in Deer Park, Texas. The company's carbon capture expansion and domestic energy production capabilities make it an attractive bet for investors. OXY has also reduced its debt by $4.5 billion and is expected to post earnings of $0.92 per share in the current quarter. The company's SWOT analysis highlights its operational successes and financial challenges.", "keywords": ["expansion", "analysis", "acquisition", "production", "debt", "energy", "carbon", "earnings", "swot"], "sentiment": "positive", "upside": -52.6, "linked": [], "volume": 12464546.0, "introduction": "Occidental Petroleum Corporation (OXY) has announced a $1.1 billion deal to acquire Carbon Engineering Ltd. and expand its Texas facility, reducing debt by $4.5 billion and expected to post $0.92 earnings per share in the current quarter.", "update": "2025-02-28", "current": 49.29, "category": "stock"}, {"company": "PainReform Ltd", "symbol": "PRFX", "statement": "PainReform Ltd. (PRFX) is a clinical-stage specialty pharmaceutical company focused on reformulating established therapeutics for extended post-surgical pain relief. The company is developing PRF-110, a viscous clear oil-based solution to provide localized and extended post-operative pain relief. The company is expected to report a loss of $18.96 per share for the period ending September 30, 2024. The company's CEO was interviewed on \"The Big Biz Show\" and discussed the large market opportunity, with over 40-45 million procedures in the US per year.", "keywords": ["ceo", "relief", "share", "localized", "therapeutics", "specialty", "loss", "stage", "post-operative", "solution", "opportunity", "market", "pain", "extended", "pharmaceutical", "reformulating", "viscous", "interview", "clinical"], "sentiment": "negative", "upside": -2945.1, "linked": [], "volume": 18376632.0, "introduction": "PainReform Ltd. is a clinical-stage pharmaceutical company developing a viscous oil-based solution for extended post-surgical pain relief, expected to report a loss and eyeing a large market opportunity of 40-45 million procedures per year in the US.", "update": "2025-02-28", "current": 3.57, "category": "stock"}, {"company": "TAL Education Group", "symbol": "TAL", "statement": "TAL Education Group (TAL) is a holding company that offers after-school tutoring programs for primary and secondary school students in China. The company has 32 hedge fund holders and 10 analysts following it. Despite recent declines, TAL Education Group has a strong performance and fundamentals, with a float of 443.43 million shares and 458.10 million shares outstanding. The company is expected to announce its third-quarter financial results on January 23, 2025.", "keywords": ["fund", "results", "after-school", "education", "analysts", "performance", "secondary", "tutoring", "fundamentals", "china", "shares", "float", "company", "financial", "hedge", "primary"], "sentiment": "positive", "upside": -94.6, "linked": [], "volume": 13331581.0, "introduction": "TAL Education Group, a Chinese after-school tutoring company, is expected to announce its third-quarter financial results on January 23, 2025, despite recent declines, with strong fundamentals and a significant number of hedge fund and analyst followers.", "update": "2025-02-28", "current": 11.69, "category": "stock"}, {"company": "Moderna Inc", "symbol": "MRNA", "statement": "Moderna, a biotechnology company, is partnering with OpenAI to accelerate its mRNA research. The company has announced ambitious plans to launch multiple products in the coming years, but faces challenges in the vaccine market, including a revenue shortfall. Moderna has seen success in its mRNA technologies and partnerships, such as its collaboration with Merck on a cancer vaccine, which has shown promise in its first efficacy trial. The company is also expanding its strategic alliances and advancing its technologies to develop treatments for various diseases.", "keywords": ["alliance", "mrna", "disease", "partnership", "products", "biotechnology", "trial", "efficacy", "challenges", "vaccine", "research", "success", "cancer", "revenue", "treatment"], "sentiment": "positive", "upside": -448.9, "linked": [], "volume": 17101748.0, "introduction": "Moderna, a biotech company, is partnering with OpenAI to accelerate its mRNA research and expand its product pipeline, despite facing revenue challenges in the vaccine market.", "update": "2025-02-28", "current": 41.41, "category": "stock"}, {"company": "ZoomInfo Technologies Inc", "symbol": "ZI", "statement": "ZoomInfo, a go-to-market intelligence and engagement platform, has been named a Leader in Intent Data Providers for B2B by Forrester. The company reported strong financial results for the fourth quarter of 2024, beating earnings expectations with EPS of $0.26. ZoomInfo's stock surged after the announcement, with analysts predicting growth in its Up-Market (100+ employees) customer segment. The company expects full-year earnings to range from $0.95 to $0.97 per share and revenue between $1.19 billion to $1.21 billion.", "keywords": ["stock", "b2b", "results", "expectations", "leader", "providers", "intent", "data", "growth", "analysts", "surge", "financial", "revenue", "earnings", "prediction"], "sentiment": "positive", "upside": -93.4, "linked": [], "volume": 9430513.0, "introduction": "ZoomInfo, a go-to-market intelligence and engagement platform, has been named a Leader in Intent Data Providers for B2B by Forrester and reported strong financial results for Q4 2024, beating earnings expectations and surging its stock.", "update": "2025-02-28", "current": 9.98, "category": "stock"}, {"company": "Monster Beverage Corp", "symbol": "MNST", "statement": "Monster Beverage Corporation reported a strong fourth quarter in 2024, with a 4.7% increase in net sales to $1.81 billion. The company's Monster Energy drinks segment saw a 4.5% increase in net sales to $1.67 billion, driven by growth in various regions and categories. Despite challenges, the company's gross profit margin expanded 90 basis points to 54%, but its operating income decreased 12.2% due to reserves and impairment charges. The company is expected to see \"rebounding\" top-line growth, driven by its energy drinks and new product launches.", "keywords": ["regions", "billion", "growth", "income", "challenges", "sales", "launches", "increase", "energy", "categories", "quarter", "charges", "margin", "product", "profit"], "sentiment": "positive", "upside": -59.0, "linked": [], "volume": 8402920.0, "introduction": "Monster Beverage Corporation reported a strong Q4 2024 with a 4.7% net sales increase to $1.81 billion, driven by growth in energy drinks and new product launches.", "update": "2025-02-28", "current": 48.28, "category": "stock"}, {"company": "Norwegian Cruise Line Holdings Ltd", "symbol": "NCLH", "statement": "Norwegian Cruise Line (NCLH) reported strong Q4 earnings, beating revenue expectations with a 6.2% year-over-year increase to $2.11 billion. Non-GAAP profit was $0.26 per share. CEO expects strong bookings and growth in 2025 and 2026. Despite initial profit forecast being below estimates, shares rose due to strong demand and bookings. The company reported record revenue and net income in 2024, with a 448% increase in GAAP net income.", "keywords": ["growth", "forecast", "record", "bookings", "increase", "share", "demand", "revenue", "earnings", "profit"], "sentiment": "positive", "upside": -75.7, "linked": [], "volume": 8834639.0, "introduction": "Norwegian Cruise Line reported strong Q4 earnings, beating revenue expectations with a 6.2% year-over-year increase to $2.11 billion, despite initial profit forecast being below estimates, shares rose due to strong demand and bookings.", "update": "2025-02-28", "current": 25.68, "category": "stock"}, {"company": "Abbott Laboratories", "symbol": "ABT", "statement": "The articles cover various topics related to Abbott Laboratories, a company that is driving innovation in healthcare through its products and services. The company is a leader in tissue diagnostics and is expanding into new markets, including digital health technologies. Abbott Laboratories has a strong growth strategy and has been expanding its presence in emerging markets. The company's products and services are improving patient outcomes and addressing unmet medical needs. Additionally, Abbott Laboratories is a key player in the blood cancer diagnostics market, which is expected to grow significantly in the coming years. The company's financial performance is also strong, with revenue growth and a high rating under Peter Lynch's P/E/Growth strategy.", "keywords": ["digital", "innovation", "emerging", "products", "growth", "markets", "performance", "diagnostics", "healthcare", "outcomes", "services", "cancer", "financial"], "sentiment": "positive", "upside": 54.5, "linked": [], "volume": 9883882.0, "introduction": "Abbott Laboratories is a leading healthcare company driving innovation through products and services, with a strong growth strategy, expanding presence in emerging markets, and improving patient outcomes in areas like blood cancer diagnostics.", "update": "2025-02-28", "current": 125.03, "category": "stock"}, {"company": "Texas Instruments Inc", "symbol": "TXN", "statement": "Texas Instruments (TI) is a semiconductor company that designs, manufactures, and sells analog and embedded semiconductors for various industries, including industrial, automotive, and personal electronics. The company is committed to pushing the limits of power management and has signed a preliminary agreement for up to $1.6 billion in funding from the US Department of Commerce. TI is also showcasing new products, including edge AI-enabled radar sensors and automotive audio processors, and has declared its first quarter dividend. The company has a strong track record of innovation and has been recognized for its contributions to the development of advanced technologies.", "keywords": ["management", "radar", "quarter", "power", "industrial", "personal", "electronics", "processors", "innovation", "analog", "semiconductor", "sensors", "advanced", "dividend", "agreement", "technologies", "funding", "audio", "automotive", "embedded"], "sentiment": "positive", "upside": -85.8, "linked": [], "volume": 14873525.0, "introduction": "Texas Instruments is a semiconductor company that designs, manufactures, and sells analog and embedded semiconductors for various industries, and has secured $1.6 billion in funding from the US Department of Commerce and is showcasing new products.", "update": "2025-02-28", "current": 185.52, "category": "stock"}, {"company": "Senseonics Holdings Inc", "symbol": "SENS", "statement": "Senseonics Holdings, Inc. (SENS) is a medical technology company that develops and manufactures glucose monitoring products for the diabetes community. The company has integrated its software, Eversense 365, with SweetSpot, a virtual CGM monitoring system, to enhance patient care. The company has a one-year CGM system, Eversense, and has partnered with endocrinology practices to provide virtual monitoring. The company's stock has experienced a decline, with a 11.83% drop in the last trading session, and analysts have set new price targets, with some recommending a \"sell\" rating.", "keywords": ["stock", "glucose", "medical", "price", "virtual", "analysts", "diabetes", "software", "endocrinology", "monitoring", "technology", "cgm"], "sentiment": "negative", "upside": -159.7, "linked": [], "volume": 19030192.0, "introduction": "Senseonics Holdings, a medical technology company, develops and manufactures glucose monitoring products, including a virtual CGM system, but its stock has declined 11.83% and analysts recommend a \"sell\" rating.", "update": "2025-02-28", "current": 1.13, "category": "stock"}, {"company": "Clover Health Investments Corp", "symbol": "CLOV", "statement": "Clover Health Investments Corp. (CLOV) announced its Q4 2024 earnings, with revenue of $331 million and adjusted EBITDA of $8 million, representing a 9% year-over-year growth. The company reported average Medicare Advantage membership of 103,000-107,000, a 30% year-over-year growth, and insurance revenue of $1.8-1.875 billion, a 37% year-over-year growth. The company's full-year 2024 GAAP net loss from continuing operations improved by $164 million year-over-year, and adjusted EBITDA increased by $112 million year-over-year.", "keywords": ["insurance", "loss", "growth", "membership", "net", "ebitda", "medicare", "revenue", "earnings"], "sentiment": "positive", "upside": -118.9, "linked": [], "volume": 10155186.0, "introduction": "Clover Health Investments Corp. reported Q4 2024 earnings with 9% year-over-year revenue growth and 30% growth in Medicare Advantage membership, with adjusted EBITDA increasing by $112 million year-over-year.", "update": "2025-02-28", "current": 4.82, "category": "stock"}, {"company": "Planet Labs PBC", "symbol": "PL", "statement": "Planet Labs PBC (NYSE: PL) has announced an expanded relationship with Bayer, a leading provider of agricultural products, through a multi-year enterprise license agreement. This partnership will increase Bayer's access to Planet's satellite imagery and analytics, enabling enhanced decision-making across its global agricultural operations. The agreement is expected to accelerate digital innovation in agriculture and drive growth for both companies.", "keywords": ["labs", "planet", "innovation", "products", "imagery", "pbc", "growth", "bayer", "decision", "satellite", "agricultural", "nyse", "pl", "analytics"], "sentiment": "positive", "upside": -136.6, "linked": [], "volume": 14386348.0, "introduction": "Planet Labs PBC has entered a multi-year enterprise license agreement with Bayer, expanding access to its satellite imagery and analytics to enhance decision-making in Bayer's agricultural operations and drive growth for both companies.", "update": "2025-02-28", "current": 5.44, "category": "stock"}, {"company": "ON Semiconductor Corp", "symbol": "ON", "statement": "ON Semiconductor is cutting 2,400 jobs as part of a company-wide restructuring plan to reduce costs. The move is aimed at refocusing on AI chip growth. The company is also facing challenges in the global chip shortage, which has exposed vulnerabilities in supply chains and led to a renewed focus on innovation in semiconductor manufacturing. Meanwhile, NVIDIA's dominance is being threatened by the chip ban on Huawei, which could force the development of an alternative to their CUDA ecosystem. The future of semiconductor technology is shaped by cost, supply risks, and rapid innovation, driving new industry challenges ahead.", "keywords": ["risks", "ai", "ecosystem", "innovation", "manufacturing", "ban", "growth", "challenges", "refocusing", "dominance", "technology", "future", "shortage", "costs", "restructuring"], "sentiment": "negative", "upside": 89.1, "linked": [], "volume": 8764990.0, "introduction": "ON Semiconductor is cutting 2,400 jobs and restructuring to focus on AI chip growth, amid challenges in the global chip shortage and the impact of Huawei's chip ban on NVIDIA's dominance.", "update": "2025-02-28", "current": 54.5, "category": "stock"}, {"company": "SES AI Corp", "symbol": "SES", "statement": "SES (Satellite Earth Station) is partnering with Quvia, an AI-powered quality of experience (QoE) platform, to develop new-generation multi-orbit connectivity solutions. The collaboration will enhance network orchestration capabilities, intelligently managing network resources and adapting to customer demand. This partnership will advance SES's multi-orbit connectivity solutions, which provide high-quality connectivity anywhere on land, at sea, or in the air.", "keywords": ["ai", "station", "partnership", "connectivity", "resources", "experience", "satellite", "high-quality", "solutions", "earth", "demand", "orchestration", "network", "platform", "quality", "multi-orbit"], "sentiment": "positive", "upside": -193.7, "linked": [], "volume": 66331300.0, "introduction": "SES is partnering with Quvia to develop new-generation multi-orbit connectivity solutions that enhance network orchestration capabilities and adapt to customer demand.", "update": "2025-02-28", "current": 1.13, "category": "stock"}, {"company": "Blue Hat Interactive Entertainment Technology", "symbol": "BHAT", "statement": "Blue Hat Interactive Entertainment Technology (BHAT) is a company that develops and markets augmented reality (AR) products, including AR Racer, AR Crazy Bug, and AR 3D Magic. The company's stock price has been fluctuating, with a recent earnings report showing a loss of $0.98 per share and revenue of $73.68 million. The company's products are gaining attention, with articles highlighting the potential of its AR technology and its potential to revolutionize the gaming industry.", "keywords": ["stock", "augmented", "gaming", "loss", "products", "industry", "entertainment", "reality", "technology", "revenue", "company", "earnings"], "sentiment": "positive", "upside": -591.8, "linked": [], "volume": 40276130.0, "introduction": "Blue Hat Interactive Entertainment Technology, a company that develops and markets augmented reality products, has seen its stock price fluctuate after reporting a loss and revenue, despite gaining attention for its innovative AR technology's potential to revolutionize the gaming industry.", "update": "2025-02-28", "current": 0.06, "category": "stock"}, {"company": "ADiTx Therapeutics Inc", "symbol": "ADTX", "statement": "Aditx Therapeutics (ADTX) is a biotech company that develops treatments for rare genetic diseases. Its stock price has fluctuated recently, with a low of $0.0654 and a high of $0.158 over the past 30 days. The company has a recent agreement with Travere Therapeutics, and its product, Mirum, gained FDA approval for a rare genetic disease. Other news includes Lilly's obesity drug Orforglipron showing promising results in a phase 2 trial and the FDA approving 50 new treatments in 2024. Additionally, GSK completed its acquisition of IDRx, a clinical-stage biopharmaceutical company.", "keywords": ["stock", "obesity", "genetic", "biotech", "price", "agreement", "acquisition", "fda", "trial", "biopharmaceutical", "approval", "rare", "therapeutics", "diseases", "product"], "sentiment": "positive", "upside": -12138.3, "linked": [], "volume": 23388628.0, "introduction": "Aditx Therapeutics, a biotech company developing treatments for rare genetic diseases, has seen its stock price fluctuate, with recent news including FDA approval for its product Mirum and promising results from Lilly's Orforglipron trial.", "update": "2025-02-28", "current": 0.12, "category": "stock"}, {"company": "International Paper Co", "symbol": "IP", "statement": "International Paper and DS Smith have merged to create a global leader in sustainable packaging solutions. The merger combines the strengths of two leading producers of packaging, containerboard, and pulp, with a focus on sustainable growth and profitability. The new entity aims to serve customers in over 30 countries and accelerate growth and innovation. International Paper has also appointed new leaders, including Tim Nicholls, who will lead DS Smith as Executive Vice President and President. The company aims to become more innovative and environmentally conscious, with a net sales record of $18.6 billion in 2024.", "keywords": ["global", "customers", "packaging", "growth", "executive", "sales", "vice", "\"the\"", "environment", "leaders", "sustainable", "\"to\"", "innovation", "president", "profitability", "etc.whicharenotconsideredasmeaningfulkeywords", "mergers", "record", "leadership", "note:i'veexcludedwordslike\"and\"", "countries", "sustainability"], "sentiment": "positive", "upside": -72.4, "linked": ["AMCR : Amcor and Berry Global shareholders have approved the merger, combining two global leaders in packaging solutions to create a stronger, more sustainable company."], "volume": 8804611.0, "introduction": "International Paper and DS Smith have merged to create a global leader in sustainable packaging solutions, combining their strengths to serve customers in over 30 countries and accelerate growth and innovation.", "update": "2025-02-28", "current": 60.09, "category": "stock"}, {"company": "CNS Pharmaceuticals Inc", "symbol": "CNSP", "statement": "CNS Pharmaceuticals Inc. (CNSP) has seen its stock price soar 30.8% after presenting positive clinical trial results and providing an update on its cash position, which is expected to fund operations into the first quarter of 2026. The company has also executed a reverse stock split to maintain compliance with Nasdaq's listing requirements. CNSP is developing treatments for brain and central nervous system cancers, with a focus on its Berubicin trial and TPI 287 clinical program. The company's cash position is $14 million as of February 26, 2025, and it plans to announce primary data analysis for its global Berubicin trial in the first half of 2025.", "keywords": ["pharmaceuticals", "berubicin", "requirements", "program", "analysis", "cash", "position", "stock", "cancers", "nasdaq", "tpi", "287", "price", "listing", "split", "brain", "clinical", "reverse", "cnsp", "trials"], "sentiment": "positive", "upside": -1502.1, "linked": [], "volume": 29763440.0, "introduction": "CNS Pharmaceuticals Inc. (CNSP) has seen its stock price surge 30.8% after presenting positive clinical trial results and providing an update on its cash position, which is expected to fund operations into the first quarter of 2026.", "update": "2025-02-28", "current": 0.11, "category": "stock"}, {"company": "Endeavor Group Holdings Inc", "symbol": "EDR", "statement": "TKO Group Holdings, Inc. has completed its acquisition of IMG, On Location, and Professional Bull Riders from Endeavor Group Holdings, Inc. The acquisition strengthens TKO's portfolio of sports and entertainment businesses. Endeavor Group Holdings, Inc. reported a fourth-quarter net loss of $165.9 million, but exceeded revenue estimates, sending its stock up 3.9% in after-hours trading. The acquisition was announced on February 11, and TKO Group Holdings, Inc. is a subsidiary of Endeavor Group Holdings, Inc. The companies did not provide detailed financial information about the acquisition, but Endeavor Group Holdings, Inc. reported its quarterly earnings and stock performance.", "keywords": ["stock", "sports", "loss", "business", "portfolio", "net", "acquisition", "performance", "entertainment", "trading", "inc", "holdings", "estimates", "financial", "revenue", "earnings"], "sentiment": "positive", "upside": -150.4, "linked": [], "volume": 8282036.0, "introduction": "TKO Group Holdings, Inc. has acquired IMG, On Location, and Professional Bull Riders from Endeavor Group Holdings, Inc., strengthening TKO's portfolio of sports and entertainment businesses.", "update": "2025-02-28", "current": 30.9, "category": "stock"}, {"company": "Sealsq Corp", "symbol": "LAES", "statement": "SEALSQ Corp, a leading developer of semiconductors, PKI, and post-quantum technology solutions, has entered into exclusive negotiations to acquire 100% of IC'ALPS, an ASIC design and supply specialist based in France. The acquisition would bring together IC'ALPS' expertise in ASIC design, sales, and supply chain capabilities with SEALSQ's semiconductor and post-quantum technology solutions, enhancing its position in the market. The deal follows a Letter of Intent and is expected to strengthen SEALSQ's footprint in the medical and automotive segments, as well as its security IP portfolio.", "keywords": ["medical", "design", "chain", "france", "post-quantum", "acquisition", "asic", "ip", "pki", "supply", "security", "automotive", "semiconductors"], "sentiment": "positive", "upside": -183.5, "linked": [], "volume": 23068194.0, "introduction": "SEALSQ Corp has entered into exclusive negotiations to acquire 100% of IC'ALPS, an ASIC design and supply specialist, to enhance its position in the market and strengthen its footprint in the medical and automotive segments.", "update": "2025-02-28", "current": 4.3, "category": "stock"}, {"company": "Bionano Genomics Inc", "symbol": "BNGO", "statement": "Bionano Genomics is a life sciences company focused on developing and commercializing innovative solutions for genome analysis. The company's mission is to revolutionize genomics by providing researchers and clinicians with high-resolution, structural variation detection tools. The stock price has been down 7.5% and has an average 12-month stock price forecast of $90.00. The company has received positive analyst ratings and has had insider purchases. Bionano Genomics is also competing in the genomics industry with other companies like Illumina, Inc.", "keywords": ["revolutionize", "detection", "stock", "genomics", "genome", "ratings", "innovation", "price", "analysis", "forecast", "purchases", "solutions", "variation"], "sentiment": "positive", "upside": -4096.3, "linked": [], "volume": 16854894.0, "introduction": "Bionano Genomics is a life sciences company focused on developing and commercializing genome analysis solutions, with a stock price that has declined 7.5% and receives positive analyst ratings.", "update": "2025-02-28", "current": 0.12, "category": "stock"}, {"company": "BioXcel Therapeutics Inc", "symbol": "BTAI", "statement": "BioXcel Therapeutics, a biopharmaceutical company using artificial intelligence to develop transformative medicines, regained compliance with Nasdaq's minimum bid price rule. The company develops medicines in neuroscience, including BXCL501, a drug candidate for treating agitation in Alzheimer's disease, and BXCL504, a drug candidate to target aggression in dementia. BioXcel Therapeutics has received written notice from Nasdaq that it has regained compliance, allowing its stock to continue trading on the Nasdaq Stock Market.", "keywords": ["stock", "medicine", "intelligence", "compliance", "market", "alzheimer's", "dementia", "artificial", "biopharmaceutical", "neuroscience", "nasdaq"], "sentiment": "positive", "upside": -2272.4, "linked": [], "volume": 29840332.0, "introduction": "BioXcel Therapeutics, a biotech company using AI to develop medicines, regained compliance with Nasdaq's minimum bid price rule, allowing its stock to continue trading on the Nasdaq Stock Market.", "update": "2025-02-28", "current": 0.34, "category": "stock"}, {"company": "MicroCloud Hologram Inc", "symbol": "HOLO", "statement": "MicroCloud Hologram Inc., a technology service provider, has made breakthroughs in optimizing scaling laws, providing key support for the scaling of large models in open-source configurations. The company has also proposed a new theory of Wasserstein distance extended to quantum states, supporting quantum technology innovation. Additionally, MicroCloud Hologram has developed holographic technology services, including high-precision holographic LiDAR solutions, holographic imaging, and holographic vehicle intelligent systems. The company has also introduced the DeepSeek model, which has improved digital simulated quantum computing and provided new insights for the design and optimization of future quantum algorithms.", "keywords": ["imaging", "innovation", "optimization", "hologram", "quantum", "wasserstein", "scaling", "intelligent", "simulation", "algorithms", "technology", "cloud", "lidar"], "sentiment": "positive", "upside": -2291.3, "linked": [], "volume": 15024515.0, "introduction": "MicroCloud Hologram Inc. has made breakthroughs in scaling laws, quantum distance theory, and holographic technology services, including LiDAR solutions, imaging, and vehicle intelligent systems, and introduced a DeepSeek model for digital simulated quantum computing.", "update": "2025-02-28", "current": 1.55, "category": "stock"}, {"company": "Tetra Tech Inc", "symbol": "TTEK", "statement": "Tetra Tech, Inc. (TTEK) reported earnings per share of $0.35, beating analysts' estimates of $0.34. The company has a trailing twelve-month return on equity of 22.58% and a net margin of 4.81%. Institutional ownership of the company has decreased, with 315 institutional investors selling shares in the last 24 months. Options traders are betting big on three tech stocks, including Tetra Tech. The company has a short interest of 4.75 million shares, a -3.26% decrease from the previous month. Tetra Tech's stock price is up, and the company has announced its fourth quarter and total year 2024 results, with unrestricted cash of $37 million and availability under its credit agreements of $75 million.", "keywords": ["stocks", "credit", "estimates", "ownership", "earnings", "results", "institutional", "cash", "traders", "tech", "interest", "stock", "options", "margin", "decrease", "investors", "price", "analysts", "equity"], "sentiment": "positive", "upside": -46.6, "linked": ["WOLF : Wolfspeed, Inc., a semiconductor company specializing in silicon carbide and gallium nitride technologies, has a negative net margin and trailing twelve-month return on equity, despite insider buying and new technology launches."], "volume": 8225928.0, "introduction": "Tetra Tech, Inc. (TTEK) reported earnings per share of $0.35, exceeding estimates, with a strong return on equity and net margin, despite institutional ownership decline and a decrease in short interest.", "update": "2025-02-28", "current": 38.37, "category": "stock"}, {"company": "Consolidated Communications Holdings Inc", "symbol": "CNSL", "statement": "Several companies have made recent announcements in the technology and telecommunications sectors. Kyocera, Ataya, and Ecrio have collaborated on an end-to-end Edge AI solution for human-to-machine communication. MYCOM OSI has rebranded as Mycom, emphasizing its innovative approach to AI and automation. Tiami Networks and Airspan have expanded their partnership to develop 5G-based sensing and tracking technologies. CCC Intelligent Solutions Holdings Inc. has announced its fourth-quarter earnings and reported investing $100 million annually in research and development. Other companies, such as Vonage, have received awards for their 5G innovation.", "keywords": ["edge", "ai", "5g", "innovation", "partnership", "telecommunications", "automation", "research", "technology", "development", "earnings"], "sentiment": "positive", "upside": -267.1, "linked": [], "volume": 13276579.0, "introduction": "Several companies in the technology and telecommunications sectors have made recent announcements, including collaborations, rebranding, and investments in AI, automation, and 5G innovation.", "update": "2025-02-28", "current": 4.72, "category": "stock"}, {"company": "Richtech Robotics Inc", "symbol": "RR", "statement": "Richtech Robotics Inc (RR) saw a significant decline in its stock price, falling 15.12% to $1.88, with a market valuation of $215.27M. The company's beta touched -8.97, indicating high volatility. The stock has been down 40.07% in the last 30 days and has had below-average volume. There is a 30% chance of a \"red\" month in February, according to seasonality analysis. The company's next earnings date is May 14, 2025.", "keywords": ["stock", "robotics", "price", "earnings", "valuation", "chance", "volume", "inc", "volatility", "seasonality", "market", "decline", "down", "beta"], "sentiment": "negative", "upside": -123.6, "linked": [], "volume": 25294012.0, "introduction": "Richtech Robotics Inc's stock price declined 15.12% to $1.88, with a market valuation of $215.27M, indicating high volatility and a 30% chance of a \"red\" month in February.", "update": "2025-02-28", "current": 3.31, "category": "stock"}, {"company": "Electronic Arts Inc", "symbol": "EA", "statement": "Electronic Arts (EA) is a global leader in digital interactive entertainment, focusing on building games and experiences around key franchises, deepening engagement through interactive storytelling, and scaling live services and growth in annualized sports franchises. The company is led by Mala Singh, Chief People Officer, who translates the company strategy into a talent strategy. EA's stock has been performing well, with a 12.66% increase in the last 30 days and a dividend yield of 0.58%. The company has a strong track record of financial performance, with an ROCE of 15% and a dividend payout ratio of 19.34%.", "keywords": ["games", "sports", "finance", "growth", "franchises", "performance", "storytelling", "entertainment", "talent", "roce", "strategy", "dividend", "interactive", "ratio", "payout", "yield", "leadership"], "sentiment": "positive", "upside": -14.5, "linked": [], "volume": 9158789.0, "introduction": "Electronic Arts is a global leader in digital interactive entertainment, led by Chief People Officer Mala Singh, with a strong track record of financial performance and a growing stock price.", "update": "2025-02-28", "current": 116.56, "category": "stock"}, {"company": "United Airlines Holdings Inc", "symbol": "UAL", "statement": "United Airlines has invested in Heirloom, a company that uses limestone to absorb CO2, through its Sustainable Flight Fund. The investment will help scale Heirloom's technology to remove 500,000 tons of carbon dioxide from the atmosphere, which will be used to produce sustainable aviation fuel. This is United's third carbon capture investment and its first in direct air capture technology, which is listed by the IEA as a key carbon removal option in the transition to a net-zero energy system. The investment aligns with United's goal to fully reduce greenhouse gas emissions by 2050 without relying on carbon offsets.", "keywords": ["system", "aviation", "emissions", "sustainable", "reduction", "netzero", "technology", "energy", "capture", "carbon", "investment"], "sentiment": "positive", "upside": 128.0, "linked": [], "volume": 8609616.0, "introduction": "United Airlines invested in Heirloom, a company that uses limestone to absorb CO2, to remove 500,000 tons of carbon dioxide from the atmosphere and produce sustainable aviation fuel, supporting its goal to reduce greenhouse gas emissions by 2050.", "update": "2025-02-28", "current": 105.0, "category": "stock"}, {"company": "Twilio Inc", "symbol": "TWLO", "statement": "Twilio, a company providing cloud-based communication platforms, is a potential long-term investment opportunity due to its innovative offerings and partnerships. The company has established a strong foothold in the booming SaaS market, driven by its customer base, leading products, and high R&D investments. Analysts have upgraded Twilio's stock price target to $170, citing its AI-driven growth and potential for margin expansion. The company's solutions enable personalized interactions between companies and customers, and its impressive customer base and high R&D investments bode well for its future success.", "keywords": ["customers", "ai", "foothold", "growth", "communication", "r&d", "expansion", "products", "partnerships", "cloud", "customer", "opportunity", "target", "margin", "personalized", "interactions", "innovative", "base", "analysts", "platforms", "saas", "solutions", "investment"], "sentiment": "positive", "upside": -111.1, "linked": [], "volume": 17471732.0, "introduction": "Twilio, a cloud-based communication platform, is a promising long-term investment opportunity due to its innovative offerings, strong foothold in the SaaS market, and upgraded stock price target of $170.", "update": "2025-02-28", "current": 136.23, "category": "stock"}, {"company": "Kopin Corp", "symbol": "KOPN", "statement": "Kopin Corporation, a provider of high-performance optical systems and microdisplays, has received multiple production orders worth over $4 million for microdisplays to be used in pilot helmet-mounted display systems. The company's microdisplays will be used in various platforms, further solidifying its position as a leading supplier of application-specific microdisplays and optical systems in high-stakes scenarios.", "keywords": ["orders", "helmet", "supplier", "opticalsystems", "platforms", "production", "displays", "optical", "pilot", "microdisplays", "systems"], "sentiment": "positive", "upside": -175.1, "linked": [], "volume": 24496832.0, "introduction": "Kopin Corporation received multiple production orders worth over $4 million for microdisplays to be used in pilot helmet-mounted display systems, solidifying its position as a leading supplier of microdisplays and optical systems in high-stakes scenarios.", "update": "2025-02-28", "current": 2.03, "category": "stock"}, {"company": "Lichen China Ltd", "symbol": "LICN", "statement": "Lichen China Limited has acquired the remaining 40% equity in Bondly, gaining full control over its technologies and skilled team. The company has also announced an effective date and ratio for its reverse stock split, changing its name to Lichen International Limited, and par value from $0.00004 to $0.008. The reverse stock split will take effect on March 3, 2025, and the name change was approved by shareholders on February 10, 2025.", "keywords": ["stock", "control", "value", "technologies", "date", "acquisition", "par", "split", "shareholders", "approved", "reverse", "equity", "ratio", "team", "name", "change"], "sentiment": "positive", "upside": 535.4, "linked": [], "volume": 9871662.0, "introduction": "Lichen China Limited has acquired full control of Bondly's technologies and team, and is undergoing a reverse stock split and name change to Lichen International Limited.", "update": "2025-02-28", "current": 0.15, "category": "stock"}, {"company": "Himax Technologies Inc", "symbol": "HIMX", "statement": "Himax Technologies (HIMX) surged 82% after reporting strong Q4 earnings and announcing a $20 million buyback plan, boosting investor confidence. The company's collaboration with AUO Corporation and showcase of innovative products at CES 2025 may have also contributed to the surge. Himax specializes in display imaging processing technologies and plays a key role in the electronics industry. The company has a strong dividend yield and has seen a quarter-over-quarter increase in sales. Analysts believe the company presents a great opportunity, citing its dividend and sales growth.", "keywords": ["imaging", "buyback", "electronics", "technologies", "innovative", "growth", "opportunity", "sales", "dividend", "confidence", "display", "earnings"], "sentiment": "positive", "upside": -4.5, "linked": [], "volume": 18595200.0, "introduction": "Himax Technologies (HIMX) surged 82% after reporting strong Q4 earnings, announcing a $20 million buyback plan, and showcasing innovative products at CES 2025, boosting investor confidence.", "update": "2025-02-28", "current": 12.85, "category": "stock"}, {"company": "NUBURU Inc", "symbol": "BURU", "statement": "NUBURU, Inc., a leading innovator in high-power and high-brightness industrial blue laser technology, has announced a strategic acquisition to expand its current defense business and establish a new presence in the security sector. The company has entered into a commitment letter with a private equity investment group and plans to develop a new hub focused on defense and security solutions. NUBURU will also acquire interests in additional technology companies that align with its strategic goals. The acquisition is expected to drive growth and innovation in defense and cybersecurity solutions.", "keywords": ["expansion", "innovation", "defense", "growth", "acquisition", "security", "technology", "cybersecurity"], "sentiment": "positive", "upside": -1380.9, "linked": [], "volume": 13185179.0, "introduction": "NUBURU, Inc. acquires a private equity investment group and plans to expand its defense business and establish a new presence in the security sector, driving growth and innovation in defense and cybersecurity solutions.", "update": "2025-02-28", "current": 0.43, "category": "stock"}, {"company": "Aclarion Inc", "symbol": "ACON", "statement": "Aclarion, Inc. (ACON) is a healthcare technology company that uses Magnetic Resonance Spectroscopy (MRS) to develop software applications for analyzing biomarkers in the body. The company has received a US patent for expanded applications of MRS data processing to identify pain and infection biomarkers throughout the body. Aclarion's stock price has been declining, hitting a 52-week low of $3.82 amid a sharp annual decline, despite maintaining a healthy current ratio and holding more cash than debt. The company's financial health score remains weak, and its stock is currently a \"Buy or Hold\" candidate.", "keywords": ["stock", "infection", "price", "pain", "patent", "cash", "magnetic", "health", "spectroscopy", "healthcare", "technology", "financial", "debt", "biomarkers", "decline", "resonance"], "sentiment": "negative", "upside": -792.2, "linked": [], "volume": 65850400.0, "introduction": "Aclarion, Inc., a healthcare technology company, has received a US patent for expanding Magnetic Resonance Spectroscopy data processing to identify biomarkers for pain and infection, but its stock price has declined to a 52-week low due to weak financial health.", "update": "2025-02-28", "current": 0.04, "category": "stock"}, {"company": "Kraft Heinz Co", "symbol": "KHC", "statement": "Kraft Heinz is focusing on innovation to drive growth, despite projected sales downturns in its core product lines. The company is highlighting three main platforms: taste elevation, easy-ready meals, and substantial snacking. The company is also reducing added sugars and sodium in its products, such as ketchup, and launching new globally-inspired sauces. The company's Agile@Scale strategy is credited with these advancements. Kraft Heinz is also celebrating its 70th anniversary and has launched a new line of condiments inspired by international cuisines. Despite challenges, the company remains optimistic about its future under new leadership.", "keywords": ["elevation", "sodium", "innovation", "snacking", "anniversary", "growth", "challenges", "platforms", "sauces", "downturns", "strategy", "cuisines", "meals", "condiments", "optimism", "sugars"], "sentiment": "positive", "upside": -3.4, "linked": [], "volume": 9760296.0, "introduction": "Kraft Heinz is focusing on innovation and diversification through three main platforms to drive growth despite projected sales downturns in its core product lines.", "update": "2025-02-28", "current": 29.31, "category": "stock"}, {"company": "Deep Medicine Acquisition Corp", "symbol": "TRUG", "statement": "A Chinese company has developed a drug that beats the world's leading treatments, according to CNN. The company, DeepSeek, uses artificial intelligence to develop open-source large language models at a fraction of the cost of US-based competitors. Deep Medicine Acquisition Corp. is a blank-check company that plans to merge with a business in the healthcare space. Other healthcare startups, including Innovaccer and TruGolf, have made recent acquisitions. Additionally, Orchard Therapeutics has priced its gene therapy for metachromatic leukodystrophy at $4.25 million, making it the costliest US medicine.", "keywords": ["models", "ai", "cost", "gene", "treatment", "drug", "language", "startups", "company", "acquisition", "therapy", "leukodystrophy", "healthcare", "metachromatic", "innovaccer", "deepseek", "price", "competitors", "cnn", "merger", "trugolf"], "sentiment": "positive", "upside": -147.7, "linked": [], "volume": 8554142.0, "introduction": "A Chinese company, DeepSeek, has developed a drug that outperforms the world's leading treatments, using AI to develop language models at a lower cost than US competitors.", "update": "2025-02-28", "current": 0.56, "category": "stock"}, {"company": "SPI Energy Co Ltd", "symbol": "SPI", "statement": "SPI Energy Co., Ltd., a renewable energy company, has announced the resignation of an independent director and has begun manufacturing and delivering solar panels. The company has also struck a massive deal to supply cutting-edge components, which is driving increased demand in the industry. Meanwhile, other companies are showcasing innovative technologies, including a US medical technology company exhibiting its largest collection of new products ever at an expo. Additionally, a solar company is manufacturing and delivering solar panels, and a global company is pushing boundaries in innovative engineering solutions.", "keywords": ["medical", "products", "innovative", "components", "panels", "renewable", "energy", "demand", "technology", "expo", "engineering", "industry", "solar"], "sentiment": "positive", "upside": -893.7, "linked": [], "volume": 135038940.0, "introduction": "SPI Energy Co., Ltd. has announced the resignation of an independent director, while also manufacturing and delivering solar panels and striking a deal for cutting-edge components, amidst a backdrop of innovation in the industry and other companies showcasing new products.", "update": "2025-02-28", "current": 0.68, "category": "stock"}, {"company": "Snow Lake Resources Ltd", "symbol": "LITM", "statement": "Snow Lake Resources Ltd (LITM) is a Canadian clean energy exploration company with a portfolio of clean energy mineral projects. The company's stock has underperformed, falling 53.22% in the last year, with highs and lows ranging from $1.88 to $0.15. Analysts predict a sell rating for the company, with a price target of $0.469. In other news, Snowflake, a US medical technology company, is showcasing new products at a Chinese expo, while Disruptive Technology ETFs are an investment option.", "keywords": ["clean", "stocks", "medicine", "products", "exploration", "analysts", "rating", "mining", "expo", "energy", "target", "technology", "canada", "market", "investment", "prediction"], "sentiment": "negative", "upside": -130.1, "linked": [], "volume": 32566096.0, "introduction": "Snow Lake Resources Ltd, a Canadian clean energy exploration company, has seen its stock plummet 53.22% in the past year and is predicted to be a sell by analysts.", "update": "2025-02-28", "current": 1.39, "category": "stock"}, {"company": "Mullen Automotive Inc", "symbol": "MULN", "statement": "Mullen Automotive, Inc. has made several significant announcements recently. The company purchased additional battery line equipment from Nikola Corporation to enhance its battery production capabilities. Mullen's stock surged 75.85% after announcing a $680 million electric van delivery deal with a prominent client, boosting investor confidence. The company's electric vehicles, the Mullen ONE and Mullen THREE, were added to the National Auto Parts Catalog, and it formed a partnership with EO Charging to enhance electrification solutions. Mullen's stock price has been fluctuating, with earnings reports showing a loss of $661.33 per share in Q1 2025, but the company is expanding its presence in the commercial EV truck market.", "keywords": ["stock", "battery", "loss", "truck", "charging", "partnership", "earnings", "delivery", "van", "automotive", "nikola", "electric", "confidence", "vehicles", "investor"], "sentiment": "positive", "upside": -11652.5, "linked": [], "volume": 10298864.0, "introduction": "Mullen Automotive, Inc. has made several significant announcements, including purchasing battery equipment, securing a $680 million electric van deal, adding its vehicles to a national parts catalog, and partnering with EO Charging, which has boosted investor confidence and driven its stock price.", "update": "2025-02-28", "current": 0.44, "category": "stock"}, {"company": "Cellect Biotechnology Ltd", "symbol": "QNRX", "statement": "Syngenta has inaugurated a cutting-edge biologicals production facility in South Carolina, USA, to help farmers transition to more sustainable practices. The global cell dissociation market is expected to grow at a CAGR of 13.58% by 2034, reaching $1451.89 million. Cellect Biotechnology's financials and balance sheet are available on MarketBeat. The NK cell therapy market is on track for exponential growth, driven by regulatory approvals and new standards of care. Gene therapy products account for 28% of designations, with 2025 expected to be a continuation of FDA's 2024 efforts. The global stem cell therapy market is projected to grow at a CAGR of 23.97% from $394.5 million in 2024 to $2,612.9 million by 2033. Impact BioMedical Inc. has acquired Celios, a biotechnology company, and healthcare innovators are accelerating the development of vaccines and genomics.", "keywords": ["standards", "biotechnology", "growth", "care", "production", "gene", "acceleration", "exponential", "fda", "vaccines", "facility", "financials", "approvals", "balance", "stem", "innovation", "therapy", "healthcare", "continuation", "development", "market", "designations", "efforts", "cagr", "genomics", "sheet", "agriculture", "finance", "cell", "marketbeat", "farmers", "industry", "sustainability"], "sentiment": "positive", "upside": -637.6, "linked": [], "volume": 60422240.0, "introduction": "Syngenta has opened a biologicals production facility in South Carolina to support farmers in transitioning to sustainable practices, while the global cell therapy and stem cell therapy markets are expected to experience rapid growth driven by regulatory approvals and new standards of care.", "update": "2025-02-28", "current": 0.41, "category": "stock"}, {"company": "Save Foods Inc", "symbol": "NITO", "statement": "Save Foods, Inc. (NASDAQ: SVFD) is an agri-food tech company that develops eco-friendly treatments for the food industry to enhance food safety and shelf life. The company's products are based on a proprietary blend of food acids and sanitizers for cleaning, sanitizing, and controlling pathogens. Meanwhile, top 10 food technology trends in 2025 include improving supply chain transparency and operational efficiency, while addressing dynamic consumer demands. Other news includes gluten-free innovation, new products and partnerships reshaping the industry, and cutting-edge machines revolutionizing the modern food industry.", "keywords": ["eco", "sanitizers", "innovation", "life", "efficiency", "safety", "partnerships", "food", "transparency", "technology", "shelf", "pathogens", "industry", "friendly", "acids"], "sentiment": "positive", "upside": -234.4, "linked": [], "volume": 122185940.0, "introduction": "Save Foods, Inc. develops eco-friendly treatments to enhance food safety and shelf life using a proprietary blend of food acids and sanitizers, aligning with top 2025 food tech trends prioritizing supply chain transparency and efficiency.", "update": "2025-02-28", "current": 1.17, "category": "stock"}, {"company": "Mersana Therapeutics Inc", "symbol": "MRSN", "statement": "Mersana Therapeutics, a clinical-stage biopharmaceutical company, will present at several upcoming investor events, including a conference call and webcast on March 3, 2025, to discuss its fourth quarter and year-end 2024 financial results. The company will also participate in investor conferences on March 11, 2025.", "keywords": ["results", "year", "webcast", "events", "conference", "biopharmaceutical", "clinical", "financial", "call", "quarter", "company", "investor"], "sentiment": "positive", "upside": -601.5, "linked": ["PARA : Paramount Global reported Q4 and full year 2024 earnings with revenue up 5% to $7.98 billion, but EPS down to -$0.11, missing expectations."], "volume": 18574278.0, "introduction": "Mersana Therapeutics will present at investor events on March 3 and 11, 2025, to discuss its Q4 and year-end 2024 financial results.", "update": "2025-02-28", "current": 0.64, "category": "stock"}, {"company": "Arrowroot Acquisition Corp", "symbol": "AILE", "statement": "Global companies are showcasing cutting-edge technologies at an expo, with GE Healthcare debuting its largest collection of new products in China. SEALSQ is in exclusive negotiations to acquire 100% of IC'ALPS, a specialist in ASIC design and supply. Other news includes LongRange Capital acquiring US Synthetic from ChampionX, and Lorama acquiring the Colorant Dispersions Business of DCL Corporation. Avant Technologies has reached global development and commercialization agreements for its Vision AI platform, which detects diabetic retinopathy and other diseases. Additionally, a new era of American innovation is being touted, with a focus on basic research and innovation.", "keywords": ["global", "ai", "diabetic", "negotiations", "research", "diseases", "business", "products", "capital", "companies", "innovation", "acquisition", "china", "healthcare", "expo", "development", "vision", "agreement", "technology", "platform"], "sentiment": "positive", "upside": -53363.0, "linked": [], "volume": 11964075.0, "introduction": "Global companies are showcasing cutting-edge technologies at an expo, with various deals and agreements announced, including product debuts, acquisitions, and partnerships.", "update": "2025-02-28", "current": 0.42, "category": "stock"}, {"company": "Ostin Technology Group Co Ltd", "symbol": "OST", "statement": "The articles cover a range of topics related to technology, innovation, and industry trends. Ostin Technology Group Co., Ltd. is a company profiled on OTC Markets, with metrics on profitability and underlying metrics. Next Level Craftsmanship highlights the blend of skill and innovation in craftsmanship. Crystallization Systems Technology provides quality-by-control solutions for pharmaceutical and fine chemical industries. The textile industry is advancing towards Industry 4.0 with automation and cutting-edge tools. The Stanford Emerging Technology Review provides policymakers with insights on frontier technologies, while technology pacesetters invest in innovative companies driving advancements. Deloitte offers emerging technology consulting services, and Intel discusses smart city solutions enabled by IoT devices and AI. Finally, Innovation Laser provides CNC machining services and showcases cutting-edge laser and waterjet cutting capabilities.", "keywords": ["waterjet", "ai", "iot", "trends", "innovation", "craftsmanship", "emerging", "laser", "industry4", "consulting", "profitability", "automation", "cnc", "technology", "industry", "frontier"], "sentiment": "positive", "upside": -857.8, "linked": [], "volume": 11619682.0, "introduction": "The articles cover a range of topics related to technology, innovation, and industry trends, featuring companies and organizations offering various products and services, including technology consulting, CNC machining, and smart city solutions.", "update": "2025-02-28", "current": 2.7, "category": "stock"}, {"company": "Evaxion Biotech A/S", "symbol": "EVAX", "statement": "Evaxion Biotech has extended its phase 2 trial for its lead asset EVX-01, a personalized cancer vaccine, from two to three years to gather more data on its efficacy and durability. The trial is ongoing and aims to treat metastatic melanoma. The company's goal is to enhance the data package and provide a stronger foundation for regulatory submissions and potential commercialization.", "keywords": ["trial", "efficacy", "durability", "commercialization", "melanoma", "vaccine", "regulatory", "cancer"], "sentiment": "positive", "upside": -1554.8, "linked": [], "volume": 55592724.0, "introduction": "Evaxion Biotech has extended its phase 2 trial for its lead cancer vaccine, EVX-01, from two to three years to gather more data on its efficacy and durability in treating metastatic melanoma.", "update": "2025-02-28", "current": 6.03, "category": "stock"}, {"company": "Windtree Therapeutics Inc", "symbol": "WINT", "statement": "Windtree Therapeutics, a biotechnology company, has filed a patent application for its investigational therapy, Istaroxime, for the prevention and treatment of cardiogenic shock and arrhythmia. The company has also strengthened its intellectual property portfolio with a new Japanese patent for its oncology pipeline. Windtree Therapeutics is focused on developing innovative therapies for critical conditions and diseases, and its stock price and news are tracked by various financial websites and media outlets.", "keywords": ["pipeline", "biotechnology", "diseases", "treatment", "cardiogenic", "arrhythmia", "application", "patent", "shock", "news", "stock", "oncology", "portfolio", "conditions", "therapy", "innovative", "intellectual", "prevention", "property", "critical"], "sentiment": "positive", "upside": -2551.6, "linked": [], "volume": 52615884.0, "introduction": "Windtree Therapeutics has filed a patent application for its investigational therapy Istaroxime to prevent and treat cardiogenic shock and arrhythmia, while also expanding its intellectual property portfolio with a new Japanese patent for its oncology pipeline.", "update": "2025-02-28", "current": 0.18, "category": "stock"}, {"company": "GlucoTrack Inc", "symbol": "GCTK", "statement": "Glucotrack, a medical device company, has achieved a significant milestone in its mission to transform diabetes management. The company has completed its first in-human clinical study and is transitioning from concept to reality. Glucotrack is developing a long-term implantable continuous blood glucose monitor (CBGM) for people with Type 1 and insulin-dependent Type 2 diabetes. The company has also appointed Guillermo Umpierrez, MD, CDCES, FACE, MACP, to its medical advisory board, strengthening its diabetes expertise. With its successful clinical trial completion, Glucotrack plans to present its findings at an upcoming diabetes conference, providing critical exposure and engagement with key stakeholders.", "keywords": ["type1", "insulin", "medical", "glucose", "medicaladvisoryboard", "monitor", "diabetes", "blood", "device", "study", "conference", "clinical", "diabetesmanagement", "type2", "implantable", "glucotrack"], "sentiment": "positive", "upside": -5239.8, "linked": [], "volume": 31951254.0, "introduction": "Glucotrack, a medical device company, has completed its first in-human clinical study and is transitioning its long-term implantable continuous blood glucose monitor for people with Type 1 and insulin-dependent Type 2 diabetes from concept to reality.", "update": "2025-02-28", "current": 0.09, "category": "stock"}, {"company": "Allarity Therapeutics Inc", "symbol": "ALLR", "statement": "Allarity Therapeutics is a clinical-stage pharmaceutical company developing stenoparib, a dual PARP/Wnt pathway inhibitor, as a personalized cancer treatment. The company has announced the beginning of enrollment for a new Phase 2 protocol to advance stenoparib and its companion diagnostic, DRP, toward FDA approval. The protocol will test different doses of the drug and identify best responders using the DRP tool. Two patients in the ongoing Phase 2 trial have already exceeded 17 months on stenoparib treatment. The company is also planning to provide critical data by the end of summer.", "keywords": ["summer", "drug", "fda", "trial", "protocol", "clinical", "cancer", "approval", "pharmaceutical", "treatment"], "sentiment": "positive", "upside": -1706.1, "linked": [], "volume": 9265936.0, "introduction": "Allarity Therapeutics is advancing its stenoparib treatment for cancer through a new Phase 2 trial, testing different doses and identifying best responders using a companion diagnostic, with two patients already exceeding 17 months on treatment.", "update": "2025-02-28", "current": 1.32, "category": "stock"}, {"company": "Luna Innovations Inc", "symbol": "LUNA", "statement": "Luna Innovations (LUNA) has a consensus rating of \"Buy\" with a potential upside of 788.89% to $8.00. The company's stock has received no research coverage in the past 90 days. Short interest is 5.35% of shares outstanding, with 1,670,000 shares sold short as of December 31st. Institutional ownership has seen selling from various investors, including AMH Equity Ltd and Rice Hall James & Associates LLC. The company's financials are available on MarketBeat, and news and headlines are also provided.", "keywords": ["upside", "investors", "short", "research", "news", "buy", "ownership", "coverage", "interest", "financials"], "sentiment": "negative", "upside": -276.4, "linked": [], "volume": 12151284.0, "introduction": "Luna Innovations has a \"Buy\" consensus rating with a potential upside of 788.89% to $8.00, despite no research coverage in the past 90 days and institutional selling.", "update": "2025-02-28", "current": 0.89, "category": "stock"}, {"company": "Chanson International Holding", "symbol": "CHSN", "statement": "Chanson International (CHSN) is a company with a negative beta of -4.67, indicating high volatility. The company's financials, balance sheet, and 10K report can be viewed on MarketBeat. There is also news about CHSN's competitor Borealis Foods, which has a beta of 0.58. Additionally, various companies are showcasing their innovative technologies, including Chanson International's latest generation of MRI equipment and Siemens Healthineers' localization strategy for manufacturing. Other companies mentioned include Flow Waterjet, Numotion, dormakaba Group, and Feintool International Holding AG, which provide various products and services in industries such as waterjet cutting, mobility solutions, access solutions, and fineblanking technology.", "keywords": ["mri", "equipment", "beta", "products", "localization", "volatility", "news", "company", "financials", "competitor", "manufacturing", "access", "services", "cutting", "industries", "technologies", "marketbeat", "technology", "solutions"], "sentiment": "negative", "upside": -119.9, "linked": [], "volume": 21119074.0, "introduction": "Chanson International (CHSN) has a high volatility with a negative beta of -4.67, and its financials and 10K report can be viewed on MarketBeat, along with news about its competitor Borealis Foods and various companies showcasing innovative technologies.", "update": "2025-02-28", "current": 0.82, "category": "stock"}, {"company": "Hepion Pharmaceuticals Inc", "symbol": "HEPA", "statement": "Hepion Pharmaceuticals (HEPA) is a clinical-stage biopharmaceutical company focused on artificial intelligence-assisted therapeutic drug development. The company has announced a $5 million registered direct offering and private placement, priced at-the-market under Nasdaq rules. HEPA's stock has underperformed by 9.20% in the last year, with a 93.12% decline in value, and its simple moving average has fallen 76.47% in the last 200 days. The company has received funding and is involved in a reverse merger transaction with Pharma Two B Ltd. valued at $58.5 million.", "keywords": ["stock", "pharmaceuticals", "private", "value", "intelligence", "placement", "decline", "funding", "offering", "merger", "artificial", "biopharmaceutical", "clinical", "therapeutic", "development", "company"], "sentiment": "negative", "upside": -8255.4, "linked": [], "volume": 534644670.0, "introduction": "Hepion Pharmaceuticals, a clinical-stage biotech company focused on AI-assisted drug development, has announced a $5 million registered direct offering and private placement, despite its stock having underperformed by 9.20% in the last year.", "update": "2025-02-28", "current": 0.2, "category": "stock"}, {"company": "China Liberal Education Holdings Ltd", "symbol": "CLEU", "statement": "China Liberal Education Holdings Limited (CLEU) has announced a share consolidation of 80 ordinary shares with a par value of $0.225 per share. The company, which provides technological consulting services for smart campus solutions and other educational services, made the announcement on February 26, 2025. The news was reported by various sources, including PR Newswire, YCharts, and MarketBeat.", "keywords": ["education", "consolidation", "announcement", "marketbeat", "consulting", "limited", "ycharts", "china", "holdings", "share", "campus", "news", "services", "pr", "solutions", "liberal"], "sentiment": "negative", "upside": -124.2, "linked": [], "volume": 26378912.0, "introduction": "China Liberal Education Holdings Limited has announced a share consolidation of 80 ordinary shares with a par value of $0.225 per share.", "update": "2025-02-28", "current": 7.11, "category": "stock"}, {"company": "Transcode Therapeutics Inc", "symbol": "RNAZ", "statement": "TransCode Therapeutics, Inc. (RNAZ) announced the results of its special meeting, where Proposal Two was approved by a majority of votes cast. The company is a clinical-stage oncology company focused on treating metastatic disease. The meeting was adjourned and shareholders voted on two proposals. The company is committed to developing RNA therapeutics for cancer treatment.", "keywords": ["metastatic", "oncology", "treatment", "disease", "proposal", "shareholders", "clinical", "meeting", "cancer", "transcode", "therapeutics", "rnaz"], "sentiment": "positive", "upside": -1622.6, "linked": [], "volume": 12648869.0, "introduction": "TransCode Therapeutics, Inc. (RNAZ) announced that Proposal Two was approved by a majority of votes cast at its special meeting, with the company focused on developing RNA therapeutics for cancer treatment.", "update": "2025-02-28", "current": 7.04, "category": "stock"}, {"company": "BTC Digital Ltd", "symbol": "BTCT", "statement": "BTC Digital Ltd. (BTCT) is a crypto asset technology company that engages in bitcoin mining and mining machine resale and rental. The company's stock price has hit a new 90-day low of $1.84. Analysts predict a surge in revenue and earnings, with a 782.75% increase by 2045. Meanwhile, the company's 10K Form and SEC Filings show recent activity, including a Form S-13G filed by Empery Asset Management. Other news includes the debut of cutting-edge technologies, including a new MRI equipment and Bitcoin options trading on the CME Group.", "keywords": ["crypto", "increase", "mining", "mri", "filing", "earnings", "equipment", "surge", "company", "stock", "group", "activity", "options", "trading", "form", "price", "analysts", "bitcoin", "technology", "revenue"], "sentiment": "positive", "upside": -106.4, "linked": [], "volume": 13010535.0, "introduction": "BTC Digital Ltd. (BTCT), a crypto asset technology company, has seen its stock price hit a 90-day low, but analysts predict a surge in revenue and earnings by 2045, despite recent financial filings and the introduction of new technologies.", "update": "2025-02-28", "current": 7.46, "category": "stock"}, {"company": "Starbox Group Holdings Ltd", "symbol": "STBX", "statement": "Starbox Group Holdings Ltd. will effect a 1-for-10 reverse stock split of its Class A Ordinary Shares, with the new par value changing from $0.018 to $0.18, effective March 3, 2025. The company has also filed for an offering of 3.2 million Class A Ordinary Shares offered by selling shareholders. No other significant news or updates are mentioned in the remaining articles, which cover unrelated topics such as medical technology, basketmaking, food distribution, and entrepreneurship.", "keywords": ["stock", "entrepreneurship", "value", "par", "split", "offering", "food", "shares", "reverse", "news", "class", "technology", "company"], "sentiment": "negative", "upside": -969.9, "linked": [], "volume": 43502772.0, "introduction": "Starbox Group Holdings Ltd. will perform a 1-for-10 reverse stock split and change its par value from $0.018 to $0.18, effective March 3, 2025.", "update": "2025-02-28", "current": 0.58, "category": "stock"}]