[{"company": "ELEVAI Labs Inc", "symbol": "ELAB", "statement": "PMGC Holdings Inc. (ELAB) is a US-based company operating in the personal care products industry. The company has filed patents with Yuva Biosciences for hair and scalp care technology utilizing YuvaBio Y100 and Elevai Exosomes. The stock price has fallen 0.429% in the last trading day, and is down 56.36% in the last 10 days. The company has 18 full-time employees and went IPO in 2023. Elevai Labs, Inc., the company's gene editing and R&D business, has collaborated with Amazon's genAI tools to design CRISPR therapeutics.", "keywords": ["gene", "hair", "care", "patents", "therapeutics", "genai", "crispr", "products", "editing", "r&d", "biosciences", "employees", "exosomes", "technology", "ipo", "industry", "amazon", "company", "scalp"], "sentiment": "negative", "upside": -440.6, "linked": [], "volume": 76778720.0, "introduction": "PMGC Holdings Inc., a US-based personal care products company, has developed hair and scalp care technology with Yuva Biosciences and has collaborated with Amazon's genAI tools for gene editing and R&D.", "update": "2025-03-12", "current": 3.1, "category": "stock"}, {"company": "NVIDIA Corp", "symbol": "NVDA", "statement": "NVIDIA Corporation (NVDA) has solidified its position as a leader in the artificial intelligence (AI) industry, driving transformative technologies across various industries. The company's cutting-edge GPU innovations and partnerships have captured the attention of investors and analysts, who predict a bright future for the company. With its dominance in AI, NVIDIA is poised to continue its growth trajectory, with its latest deals and partnerships positioning it ahead of the competition. The company's CEO, Jensen Huang, will deliver a keynote at COMPUTEX 2025, and its collaborations with other companies, such as Lenovo, are bringing AI capabilities to every business and industry.", "keywords": ["nvidia", "future", "computex", "investors", "ai", "ceo", "partnerships", "competition", "intelligence", "growth", "computing", "technology", "innovation", "dominance", "keynote", "artificial", "industry", "analysts", "leadership"], "sentiment": "positive", "upside": -54.9, "linked": ["RGTI : Rigetti Computing, a quantum computing company, reported a net loss in Q4 2024, but its stock surged 8.5% due to investor confidence in its future potential and growth in its cutting-edge technology and cloud-based solutions."], "volume": 232797900.0, "introduction": "NVIDIA has solidified its leadership in the AI industry with its cutting-edge GPU innovations and partnerships, driving growth and predicting a bright future for the company.", "update": "2025-03-12", "current": 142.62, "category": "stock"}, {"company": "Marathon Digital Holdings Inc", "symbol": "MARA", "statement": "Marathon Digital Holdings, Inc. (MARA) is a digital asset technology company based in Las Vegas, Nevada. The company has been heavily searched by investors and has seen its shares return -10.2% over the past month. MARA has been expanding its mining operations, launching new digital asset products, and exploring partnerships with other blockchain technology companies. The company has also recently invested in mining equipment. Meanwhile, GameSquare Holdings, Inc. has entered into a multi-year partnership with efuse and Sideqik, a GameSquare Company, to shape the future of gaming experiences.", "keywords": ["blockchain", "investors", "gaming", "experiences", "digital", "shares", "mining", "company", "partnerships", "technology"], "sentiment": "negative", "upside": -57.7, "linked": [], "volume": 45912380.0, "introduction": "Marathon Digital Holdings, a digital asset technology company, has seen its shares decline 10.2% in a month, while expanding mining operations, launching new products, and investing in equipment, amidst a separate gaming partnership with GameSquare Holdings.", "update": "2025-03-12", "current": 19.99, "category": "stock"}, {"company": "Rigetti Computing Inc", "symbol": "RGTI", "statement": "Rigetti Computing, a quantum computing company, has made significant strides despite reporting a $153 million net loss in Q4 2024. Despite this, its stock surged by 8.5%, indicating investor confidence in its future potential. The company has been pushing boundaries with innovation and strategic partnerships, and its cutting-edge technology and cloud-based solutions have driven growth. With a 237% surge in its stock price over the past year, Rigetti Computing is well-positioned to capitalize on the growing quantum computing industry.", "keywords": ["quantum", "innovation", "industry", "growth", "computing", "cloud", "partnerships", "stock", "technology"], "sentiment": "positive", "upside": -109.5, "linked": ["NVDA : NVIDIA has solidified its leadership in the AI industry with its cutting-edge GPU innovations and partnerships, driving growth and predicting a bright future for the company."], "volume": 212161810.0, "introduction": "Rigetti Computing, a quantum computing company, reported a net loss in Q4 2024, but its stock surged 8.5% due to investor confidence in its future potential and growth in its cutting-edge technology and cloud-based solutions.", "update": "2025-03-12", "current": 13.2, "category": "stock"}, {"company": "Tesla Inc", "symbol": "TSLA", "statement": "Tesla has revolutionized the electric vehicle industry with its innovative products, setting new standards for performance, range, and innovation. Despite a recent downturn in its stock, Wedbush Securities remains optimistic about Tesla's potential, setting a price target of $550. The company plans to double its vehicle output in the US within two years, and its commitment to sustainability and innovation has earned it a spot on Wedbush's \"Best Ideas List\". However, Tesla's stock has hit a new low, sparking concerns about the company's growth and future prospects.", "keywords": ["future", "performance", "innovation", "industry", "best", "ideas", "range", "standards", "stocks", "securities", "target", "sustainability", "growth", "electric"], "sentiment": "positive", "upside": -75.6, "linked": [], "volume": 55806692.0, "introduction": "Tesla, despite a recent stock downturn, is expected to double its US vehicle output in two years and has been recognized for its commitment to sustainability and innovation, with a price target of $550, according to Wedbush Securities.", "update": "2025-03-12", "current": 406.58, "category": "stock"}, {"company": "Plug Power Inc", "symbol": "PLUG", "statement": "Plug Power Inc. (PLUG) is a company that develops hydrogen and fuel cell product solutions, offering GenDrive, a hydrogen-fueled proton exchange membrane (PEM) fuel cell system, and GenSure, a stationary fuel cell that supports backup and grid-support. The company has a joint venture with Olin Corporation to produce 1,000 tons per day of liquid hydrogen by 2028. Plug Power is a pioneer in hydrogen and fuel cell technologies, offering a wide range of products across North America, Europe, Asia, and beyond. The company has reported revenues of $191.47 million in the last quarter, with a year-over-year change of -13.8%, and EPS of -$1.65.", "keywords": ["pem", "power", "stationary", "venture", "fuel", "cell", "plug", "backup", "olin", "corporation", "grid", "revenues", "hydrogen", "gensure", "pioneer", "eps", "gendrive"], "sentiment": "negative", "upside": -472.4, "linked": [], "volume": 75948296.0, "introduction": "Plug Power Inc. is a company that develops and offers hydrogen and fuel cell solutions, including GenDrive and GenSure products, with a focus on producing liquid hydrogen through a joint venture with Olin Corporation and reporting quarterly revenues of $191.47 million.", "update": "2025-03-12", "current": 2.08, "category": "stock"}, {"company": "Intel Corp", "symbol": "INTC", "statement": "Intel Labs is working on intelligent edge infrastructure and services, employing over 700 engineers and scientists. QNX has launched a functional safety platform built on Intel Core i7 processors and QNX OS for Safety, aiming to meet growing demand for integrated and safety-certified solutions in industrial automation. Intel has also launched a cutting-edge AI development platform, and its 18A manufacturing process is being tested by industry heavyweights NVIDIA and Broadcom. Meanwhile, MSI IPC is showcasing edge AI computing solutions at Embedded World 2025, and Altera is operating independently as an Intel-owned FPGA provider.", "keywords": ["platform", "nvidia", "broadcom", "engineers", "services", "edge", "qnx", "ai", "processors", "msi", "automation", "manufacturing", "labs", "safety", "scientists", "os", "infrastructure", "intel", "ipc", "fpga", "development"], "sentiment": "positive", "upside": -188.8, "linked": [], "volume": 65888810.0, "introduction": "Intel is working on intelligent edge infrastructure and services, employing over 700 engineers and scientists, and has launched various products and platforms, including a functional safety platform, AI development platform, and edge AI computing solutions.", "update": "2025-03-12", "current": 20.83, "category": "stock"}, {"company": "Palantir Technologies Inc", "symbol": "PLTR", "statement": "Palantir Technologies Inc. (PLTR) has made significant advancements in deploying AI-powered systems, including delivering mobile battle stations to the US Army as part of a $178 million contract. The company has also announced the delivery of AI-enabled systems to the US Army, marking a milestone in the integration of AI into modern warfare. Additionally, Palantir has partnered with Shanghai Jiao Tong University to focus on cutting-edge technologies and emerging industries, such as AI, integrated circuits, and biomedicine. The company has also made headlines for its defense contracts, including a $178 million deal with the US Army, and has seen its stock surge over 204% in the last 12 months.", "keywords": ["army", "partnership", "contract", "artificial", "university", "industry", "stock", "surge", "defense", "biomedicine", "intelligence", "circuits", "technology"], "sentiment": "positive", "upside": -93.4, "linked": [], "volume": 55107276.0, "introduction": "Palantir Technologies has made significant advancements in deploying AI-powered systems, delivering mobile battle stations to the US Army and partnering with Shanghai Jiao Tong University to focus on emerging industries, while also securing defense contracts and experiencing a 204% stock surge in the past year.", "update": "2025-03-12", "current": 78.98, "category": "stock"}, {"company": "Thoughtworks Holding Inc", "symbol": "TWKS", "statement": "The articles and news stories cover a range of topics, including product development, earnings reports, AI governance, local news, and innovation. Thoughtworks, a global IT consultancy, is featured in several articles, including its earnings report and a profile of its Director, Software Architect, and Meme Wrangler, Neal Ford. The articles also discuss AI innovation, including Adobe Sensei's integration of AI and machine learning into its marketing and creative products. Additionally, there are mentions of product development, innovation, and entrepreneurship, including the importance of innovation for small companies to break into new markets and the use of cutting-edge technology to stay competitive.", "keywords": ["entrepreneurship", "creative", "competitive", "news", "innovation", "governance", "small", "ai", "company", "earnings", "marketing", "product", "development", "technology"], "sentiment": "positive", "upside": -139.97, "linked": [], "volume": 52182156.0, "introduction": "The articles and news stories cover a range of topics including product development, earnings reports, AI governance, local news, and innovation, featuring Thoughtworks and Adobe Sensei, among others.", "update": "2025-03-12", "current": 4.47, "category": "stock"}, {"company": "SoFi Technologies Inc", "symbol": "SOFI", "statement": "SoFi Technologies, Inc. (SOFI) has transformed from a fintech startup to a profitable financial institution, delivering its first full year of GAAP profitability with $2.61 billion in revenue and $666 million in adjusted EBITDA. The company has expanded its offerings beyond student loan refinancing to digital banking, investing, and insurance. With a strong track record of growth, SoFi has become a leader in the financial services industry, with a market capitalization of over $11 billion. The company's stock has risen as investors bet on its continued growth, with a consensus rating of \"Hold\" from analysts.", "keywords": ["banking", "ebitda", "leader", "profitability", "stock", "revenue", "analysts", "fintech", "growth", "capitalization", "investing", "insurance"], "sentiment": "positive", "upside": -94.5, "linked": [], "volume": 54306476.0, "introduction": "SoFi Technologies, Inc. has transitioned from a fintech startup to a profitable financial institution, achieving $2.61 billion in revenue and $666 million in adjusted EBITDA, and expanding its offerings beyond student loan refinancing to digital banking, investing, and insurance.", "update": "2025-03-12", "current": 17.92, "category": "stock"}, {"company": "Ford Motor Co", "symbol": "F", "statement": "Ford Motor Company is exploring the potential of Augmented Reality (AR) technology in its manufacturing process, having successfully implemented an AR application at its Dearborn, Michigan plant. The company is also committed to sustainability, with a growing lineup of electric vehicles (EVs) designed to meet modern drivers' demands. Ford has also partnered with Tesla to provide fast-charging adapters to its customers, allowing them to access the Tesla Supercharger network. The company's mission is to drive human progress through the freedom of movement, and it is working to reduce its environmental impact by reducing emissions and promoting sustainable practices in its supply chain.", "keywords": ["environment", "freedom", "partnership", "ford", "augmented", "movement", "emissions", "manufacturing", "reality", "sustainability", "practices", "charging", "tesla", "vehicles", "electric", "technology"], "sentiment": "positive", "upside": -56.1, "linked": [], "volume": 42802990.0, "introduction": "Ford Motor Company is exploring AR technology in its manufacturing process and prioritizing sustainability through its growing electric vehicle lineup and partnerships, such as providing Tesla Supercharger adapters to customers.", "update": "2025-03-12", "current": 10.12, "category": "stock"}, {"company": "NIO Inc", "symbol": "NIO", "statement": "BASF Coatings and NIO, a pioneer in the global smart electric vehicle market, have agreed to a strategic partnership to enhance cooperation in the automotive coatings sector. NIO's stock surged higher due to a partnership with BASF Coatings, and analysts predict it will continue to grow. NIO is a leading electric vehicle manufacturer that offers a range of products, including the ES8, ES6, EC6, and ET7, and has launched its new EC6 smart electric coupe SUV in China. The company is also expanding its power solutions, including home charging and battery swapping services.", "keywords": ["analysis", "china", "coatings", "coupe", "products", "expansion", "surge", "partnership", "prediction", "range", "growth", "swapping", "charging", "stock", "technology", "vehicle", "innovation", "solutions", "manufacturer", "electric", "suv"], "sentiment": "positive", "upside": -262.9, "linked": ["LCID : Lucid Group, Inc. is a luxury electric vehicle manufacturer that has delivered over 10,000 units and reported 35.71% sales growth, despite production hurdles and geopolitical challenges, and plans to launch lower-priced midsize vehicles by 2026."], "volume": 39487612.0, "introduction": "BASF Coatings and NIO, a leading electric vehicle manufacturer, have partnered to enhance cooperation in the automotive coatings sector, driving NIO's stock to surge higher and analysts predicting continued growth.", "update": "2025-03-12", "current": 4.29, "category": "stock"}, {"company": "Lucid Group Inc", "symbol": "LCID", "statement": "Lucid Group, Inc. is a luxury electric vehicle manufacturer that has emerged as a trailblazer in the rapidly evolving EV landscape. Its flagship model, the Lucid Air, offers an opulent driving experience with cutting-edge technology and sustainable innovation. Despite being behind Rivian in production, Lucid has delivered over 10,000 units and reported a 35.71% sales growth in fiscal 2024. The company is investing $1.4 billion in capital expenditures for 2025 and plans to launch lower-priced midsize vehicles by 2026. However, it faces production hurdles and geopolitical challenges, but has shown operational excellence and market foothold.", "keywords": ["trailblazer", "vehicle", "innovation", "production", "challenges", "manufacturer", "rivian", "opulent", "capital", "growth", "luxury", "foothold", "expenditures", "sustainable", "electric", "technology"], "sentiment": "positive", "upside": -276.8, "linked": ["NIO : BASF Coatings and NIO, a leading electric vehicle manufacturer, have partnered to enhance cooperation in the automotive coatings sector, driving NIO's stock to surge higher and analysts predicting continued growth."], "volume": 80242350.0, "introduction": "Lucid Group, Inc. is a luxury electric vehicle manufacturer that has delivered over 10,000 units and reported 35.71% sales growth, despite production hurdles and geopolitical challenges, and plans to launch lower-priced midsize vehicles by 2026.", "update": "2025-03-12", "current": 2.79, "category": "stock"}, {"company": "Apple Inc", "symbol": "AAPL", "statement": "Apple unveiled several new products this week, including two new iPad models, two new Mac models, and an ultra-powerful Apple Silicon chip. The company also released an iPhone with 6GB of memory and the A16 chip, which some have criticized as not being as powerful as previous models. Apple's new Mac Studio and MacBook Air models promise high-performance capabilities for creative professionals and power users. The company's product development strategy has been analyzed and praised for its innovative approach, with a focus on creating new products that drive industry trends rather than simply copying competitors.", "keywords": ["competitors", "apple", "iphone", "strategy", "trends", "studio", "products", "ipad", "creative", "professionals", "macbook", "chip", "unveiled", "silicon", "approach", "a16", "power", "industry", "innovative", "memory", "mac", "users", "air"], "sentiment": "positive", "upside": -62.1, "linked": [], "volume": 52645956.0, "introduction": "Apple unveiled a range of new products, including two new iPads, two new Macs, an iPhone with 6GB of memory, and an ultra-powerful Apple Silicon chip, showcasing the company's innovative approach to product development.", "update": "2025-03-12", "current": 222.78, "category": "stock"}, {"company": "AT&T Inc", "symbol": "T", "statement": "AT&T is an American multinational telecommunications company headquartered in Dallas, Texas, and is the world's third-largest telecommunications company by revenue. The company offers various services, including internet and mobile communications. The article also mentions AT&T's dividend yield, stock price, and news about its partnerships and events. Additionally, there are links to various Wikipedia articles and news stories about the company, as well as a section on how to type the '@' symbol on a Mac.", "keywords": ["wikipedia", "telecommunications", "news", "price", "multinational", "internet", "dividend", "yield", "revenue", "events", "mobile", "company", "partnerships", "communications", "stock"], "sentiment": "neutral", "upside": 38.9, "linked": [], "volume": 43626290.0, "introduction": "AT&T is a multinational telecommunications company headquartered in Texas, offering internet and mobile services and ranking as the world's third-largest telecommunications company by revenue.", "update": "2025-03-12", "current": 22.72, "category": "stock"}, {"company": "SoundHound AI Inc", "symbol": "SOUN", "statement": "SoundHound AI Inc. is gaining attention after announcing a major collaboration with CardFree to enhance its AI capabilities, driving an 8.66% increase in its stock price. The company expects revenue to double this year, with a nearly $1.2 billion revenue backlog. SoundHound AI also presented at the Cantor Fitzgerald Global Technology Conference, highlighting its leadership in conversational and voice AI. The company's stock has surged following earnings, with some predicting even more growth ahead.", "keywords": ["artificial", "leadership", "revenue", "growth", "collaboration", "conference", "intelligence", "stock", "technology"], "sentiment": "positive", "upside": -109.4, "linked": [], "volume": 64984504.0, "introduction": "SoundHound AI's collaboration with CardFree and strong earnings projections have driven its stock price up 8.66% and led to a nearly $1.2 billion revenue backlog, with further growth predicted.", "update": "2025-03-12", "current": 15.84, "category": "stock"}, {"company": "D-Wave Quantum Inc", "symbol": "QBTS", "statement": "D-Wave, a leader in quantum computing, has achieved \"quantum supremacy\" using its Advantage2 computer, outperforming classical methods in solving complex materials simulation problems. The company, which is the world's first commercial supplier of quantum computers, claims to have achieved \"quantum computational supremacy\" by demonstrating real-world results with its annealing quantum computer. This breakthrough has significant implications for industries such as materials science, where D-Wave's technology can help accelerate the discovery of new materials and properties without the need for physical experimentation.", "keywords": ["simulation", "quantum", "discovery", "supremacy", "advantage2", "materials", "science", "computing", "annealing"], "sentiment": "positive", "upside": -120.8, "linked": [], "volume": 137765140.0, "introduction": "D-Wave, a leader in quantum computing, has achieved \"quantum supremacy\" with its Advantage2 computer, outperforming classical methods in solving complex materials simulation problems.", "update": "2025-03-12", "current": 6.09, "category": "stock"}, {"company": "Nu Holdings Ltd", "symbol": "NU", "statement": "Nu Holdings, a digital banking platform in Latin America, is experiencing a stock drawdown, but its revenue is still growing quickly. The company has a lot of room to expand into other Latin American markets. Analysts are optimistic about its growth prospects, with some predicting a strong future for the company. Nu Holdings has gained 20.4 million customers and seen a 22% increase in earnings in FY24. The company's digital platform simplifies banking and offers products like credit cards and loans. Despite the current stock price decline, Nu Holdings is considered a large-cap growth stock with a 66% rating based on its fundamentals and valuation.", "keywords": ["platform", "banking", "credit", "prospects", "revenue", "decline", "america", "drawdown", "optimistic", "markets", "loans", "customers", "digital", "latin", "growth", "earnings", "valuation", "stock", "fy24", "analysts", "expand", "fundamentals"], "sentiment": "positive", "upside": -84.9, "linked": [], "volume": 41150864.0, "introduction": "Nu Holdings, a digital banking platform in Latin America, is experiencing a stock drawdown but still growing revenue quickly, with analysts optimistic about its growth prospects and strong future.", "update": "2025-03-12", "current": 12.34, "category": "stock"}, {"company": "Riot Blockchain Inc", "symbol": "RIOT", "statement": "Riot Platforms, Inc. is a US-based blockchain technology company that aims to become North America's leading provider of Bitcoin mining services. The company recently launched a new subsidiary called RiotX Ventures, which will focus on developing new blockchain-based products and services. Riot Platforms also invests in research and development, focusing on developing new products and services. The company's stock price has been fluctuating, with a current price of $8.37 and a 12-month price forecast of $17.67, with an average target of 111.11% growth.", "keywords": ["blockchain", "research", "venture", "investment", "forecast", "stock", "mining", "bitcoin", "growth", "price", "development"], "sentiment": "positive", "upside": -94.4, "linked": [], "volume": 46591200.0, "introduction": "Riot Platforms, Inc. is a US-based blockchain company that provides Bitcoin mining services and develops new blockchain-based products, with a fluctuating stock price and a 12-month forecast of $17.67.", "update": "2025-03-12", "current": 13.54, "category": "stock"}, {"company": "iQIYI Inc", "symbol": "IQ", "statement": "iQIYI, a Chinese online entertainment service, announced its Q4 2024 earnings report, with details on its various products and services, including online video, games, literature, and animations. The company launched over 300 new titles at its 2024 World Conference, introducing two new drama series brands and forging partnerships to fuel growth. Analysts predict an average target price of $2.60 for iQIYI stock, with a low estimate of $1.80 and high estimate of $3.00, indicating a potential 10.64% increase from the current stock price.", "keywords": ["report", "animations", "price", "video", "stock", "estimate", "conference", "partnerships", "analysts", "products", "growth", "increase", "services", "earnings", "games", "literature", "drama", "target"], "sentiment": "positive", "upside": 155.4, "linked": ["WULF : TeraWulf Inc.'s stock has declined 11.95% due to regulatory concerns and operational challenges, but some investors are buying in, with analysts forecasting a 121.39% increase in the stock price to $7.97."], "volume": 54561920.0, "introduction": "iQIYI, a Chinese online entertainment service, released its Q4 2024 earnings report, announcing new titles and partnerships, with analysts predicting a potential 10.64% increase in stock price.", "update": "2025-03-12", "current": 2.23, "category": "stock"}, {"company": "Terawulf Inc", "symbol": "WULF", "statement": "TeraWulf Inc.'s (WULF) stock has seen a recent decline of 11.95% due to regulatory concerns and operational challenges in the crypto mining sector. Despite this, some investors are buying in, with CoreCap Advisors LLC increasing its holdings by 67.9% in the 4th quarter. Analysts forecast a 121.39% increase in the stock price to $7.97, with a low estimate of $3.50 and a high estimate of $11. The company operates digital asset technology and provides miner hosting services in the US, with institutional investors owning 62.49% of the stock.", "keywords": ["concerns", "decline", "services", "regulatory", "investors", "forecast", "mining", "operational", "price", "challenges", "crypto", "stock", "technology", "buying", "estimate", "institutional", "analysts", "increase", "company", "hosting"], "sentiment": "positive", "upside": -111.1, "linked": ["IQ : iQIYI, a Chinese online entertainment service, released its Q4 2024 earnings report, announcing new titles and partnerships, with analysts predicting a potential 10.64% increase in stock price."], "volume": 56193060.0, "introduction": "TeraWulf Inc.'s stock has declined 11.95% due to regulatory concerns and operational challenges, but some investors are buying in, with analysts forecasting a 121.39% increase in the stock price to $7.97.", "update": "2025-03-12", "current": 6.32, "category": "stock"}, {"company": "American Airlines Group Inc", "symbol": "AAL", "statement": "American Airlines is a major airline in the United States, headquartered in Fort Worth, Texas, and operates an extensive international and domestic network. The airline is exploring new technologies, such as AI-powered voice assistance through Amazon's Alexa+, and is working to improve safety through upgrades to air traffic control systems. The company's stock price has been fluctuating, with some analysts predicting a decline. American Airlines is also exploring new products and strategies, and is facing legal and regulatory challenges.", "keywords": ["states", "network", "domestic", "headquarters", "decline", "technologies", "ai", "products", "texas", "price", "challenges", "traffic", "stock", "alexa", "safety", "united", "major", "control", "strategies", "upgrades", "airline", "international"], "sentiment": "neutral", "upside": -39.0, "linked": [], "volume": 37547656.0, "introduction": "American Airlines, headquartered in Fort Worth, Texas, is a major US airline operating an international and domestic network, exploring new technologies and strategies while facing fluctuating stock prices and legal/regulatory challenges.", "update": "2025-03-12", "current": 16.96, "category": "stock"}, {"company": "SRIVARU Holding Ltd", "symbol": "SVMH", "statement": "SRIVARU Holding Limited (SVUHF) is an electric vehicle manufacturer in India, offering electric two-wheeled vehicles and related products and services under the Prana brand. The company has a net cash position of -116,652 and is listed on the OTC Markets. SRIVARU Holding Limited has announced the resignation of Lata Gullapalli, and there have been discussions of reorganization, mergers, and acquisitions. The company has a strong institutional ownership and has reported revenue and earnings.", "keywords": ["brand", "otc", "position", "vehicle", "resignation", "mergers", "manufacturer", "reorganization", "institutional", "cash", "ownership", "markets", "revenue", "india", "prana", "acquisitions", "earnings", "electric"], "sentiment": "negative", "upside": -447.4, "linked": [], "volume": 122944570.0, "introduction": "SRIVARU Holding Limited, an Indian electric vehicle manufacturer, has a net cash position of -116,652 and is listed on the OTC Markets, with discussions of reorganization, mergers, and acquisitions.", "update": "2025-03-12", "current": 0.03, "category": "stock"}, {"company": "Tonix Pharmaceuticals Holding Corp", "symbol": "TNXP", "statement": "Tonix Pharmaceuticals Holding Corp., a fully-integrated biopharmaceutical company, has been awarded a grant from the Medical CBRN Defense Consortium (MCDC) to support the development of TNX-801. The company is focused on transforming therapies for pain management and vaccines for public health challenges. Tonix has a pipeline of development candidates and marketed products, and is working to submit a New Drug Application (NDA) to the FDA for TNX-102 SL, a candidate for chronic pain management. The company has also announced positive Phase 3 trial results for its TNX-801 vaccine, which is being developed to combat infectious diseases.", "keywords": ["therapies", "nda", "biopharmaceutical", "pain", "health", "vaccine", "diseases", "pipeline", "products", "infectious", "grant", "management", "fda", "public", "development", "vaccines"], "sentiment": "positive", "upside": -1044.5, "linked": [], "volume": 179498200.0, "introduction": "Tonix Pharmaceuticals has received a grant from the Medical CBRN Defense Consortium to support the development of TNX-801, a vaccine candidate for infectious diseases, as part of its pipeline of development candidates and marketed products.", "update": "2025-03-12", "current": 0.38, "category": "stock"}, {"company": "Akoustis Technologies Inc", "symbol": "AKTS", "statement": "Akoustis Technologies Inc. is a company that develops and manufactures RF filter solutions for the wireless industry. The company filed for Chapter 11 bankruptcy in December 2024 and has seen a decline in its stock price. In its latest earnings report, the company missed analysts' estimates, reporting a loss of ($0.14) per share. Despite this, the company has completed the acquisition of assets from the Research Foundation for the State University of York, expanding its product offerings. Akoustis Technologies' revenue increased 0.97% in 2024 compared to the previous year, but losses increased 164.3% to $167.95 million.", "keywords": ["filter", "solutions", "industry", "loss", "bankruptcy", "revenue", "decline", "products", "acquisition", "earnings", "losses", "wireless", "stock", "technology"], "sentiment": "negative", "upside": -13510.6, "linked": [], "volume": 93547736.0, "introduction": "Akoustis Technologies Inc., a company that develops RF filter solutions for the wireless industry, filed for Chapter 11 bankruptcy and missed analysts' estimates, but has completed an acquisition and reported a 0.97% revenue increase in 2024.", "update": "2025-03-12", "current": 0.04, "category": "stock"}, {"company": "Canoo Inc", "symbol": "GOEV", "statement": "Canoo's CEO has formed a company called WHS Energy Solutions to acquire the assets of a bankrupt electric vehicle manufacturer for $4 million. This comes after Canoo filed for Chapter 7 liquidation and owes over $11 million to a financial firm controlled by its CEO. The company has also announced a 1-for-20 reverse stock split and furloughs and factory idles to focus on securing capital. The company's stock has been declining, with a return on equity of -128.71% and EPS of -0.09. Despite this, the company has made some positive announcements, including a partnership with The AA in the UK for premium roadside assistance services.", "keywords": ["roadside", "partnership", "stock", "bankruptcy", "liquidation", "decline", "financial", "capital", "manufacturing", "assistance", "acquisition", "vehicles", "electric", "energy"], "sentiment": "negative", "upside": -51254.7, "linked": [], "volume": 278908670.0, "introduction": "Canoo's CEO forms WHS Energy Solutions to acquire assets of a bankrupt electric vehicle manufacturer for $4 million, amidst company's financial struggles, including debt and declining stock performance.", "update": "2025-03-12", "current": 0.48, "category": "stock"}, {"company": "Nikola Corporation", "symbol": "NKLA", "statement": "Nikola Corporation, a technology innovator and integrator, has won permission to auction its 691,000-square-foot manufacturing facility in Coolidge, Arizona, which could appeal to buyers interested in moving production to the US. The company operates in two business units: Truck and Energy, commercializing battery electric and hydrogen fuel cell electric vehicles for the trucking sector. Nikola's stock price and financials are publicly available, showing a decrease in revenue and a pending Chapter 11 bankruptcy. The company is evaluating options and has won permission to auction its Arizona facility, which creditors believe could be valuable to automakers amid looming auto tariffs.", "keywords": ["innovation", "trucks", "energy", "bankruptcy", "finance", "manufacturing", "tariffs", "auction", "vehicles", "facility", "technology"], "sentiment": "negative", "upside": -4215.4, "linked": [], "volume": 41875224.0, "introduction": "Nikola Corporation, a technology company with a manufacturing facility in Arizona, has won permission to auction its 691,000-square-foot facility, which could appeal to buyers interested in moving production to the US amid looming auto tariffs.", "update": "2025-03-12", "current": 0.91, "category": "stock"}, {"company": "SES AI Corp", "symbol": "SES", "statement": "SES AI Corporation, a battery manufacturing company, reported strong Q3 2024 results, advancing its lithium battery technology and AI capabilities. The company is developing a new electrolyte every six months, enhancing its material discovery capabilities and improving battery cycle life by 20% through AI optimization. SES AI has signed contracts worth up to $10 million to develop AI-enhanced Li-Metal and Li-ion batteries for electric vehicles with two automotive OEM partners. The company's stock price has fluctuated, with a recent 8.73% drop in the last 24 hours and a 61.24% decline over the past month.", "keywords": ["results", "contracts", "enhancement", "vehicles", "ai", "finance", "partnerships", "report", "quarterly", "lithium", "materials", "optimization", "stock", "technology", "battery", "innovation", "discovery", "automotive", "oem", "electric"], "sentiment": "negative", "upside": -193.7, "linked": [], "volume": 66331300.0, "introduction": "SES AI Corporation reported strong Q3 2024 results, advancing its lithium battery technology and AI capabilities, with new contracts worth up to $10 million for electric vehicle batteries and a fluctuating stock price.", "update": "2025-03-12", "current": 1.13, "category": "stock"}, {"company": "Blue Hat Interactive Entertainment Technology", "symbol": "BHAT", "statement": "Blue Hat Interactive Entertainment Technology (BHAT) is a NASDAQ-listed company that engages in the commodity trading business, including chemicals and jewelry. The company has a market capitalization of $8.64M, down from $160.30M in 2019, with a current ratio of 5.88 and a debt-to-equity ratio of unknown. BHAT has announced new gaming products and plans for global launches in 2021. The company's stock price has decreased significantly over the past five years, with a return of -99.92% and an annualized return of -75.93%. The company's products include AR toys, mobile games, and animation design services, and it reports in segments such as interactive toys, mobile games, and information services.", "keywords": ["return", "gaming", "design", "trading", "chemicals", "information", "jewelry", "games", "services", "products", "commodities", "toys", "price", "launches", "nasdaq", "stock"], "sentiment": "negative", "upside": -591.8, "linked": [], "volume": 40276130.0, "introduction": "Blue Hat Interactive Entertainment Technology, a NASDAQ-listed company with a market capitalization of $8.64M, has struggled with a significant decline in stock price and financial performance over the past five years.", "update": "2025-03-12", "current": 0.06, "category": "stock"}, {"company": "Aclarion Inc", "symbol": "ACON", "statement": "Aclarion, a company that uses remote MRIs to assess back pain, has expanded its presence in the US with over a dozen locations, including partnerships with New Jersey Imaging and Lenox Hill Radiology. The company's Nociscan SaaS platform uses biomarkers and AI algorithms to help physicians identify chronic low back pain. Aclarion has announced plans to expand Nociscan access across key markets in New York and New Jersey, building on previously established sites with RadNet affiliates. The company's stock (ACON) has seen a decline of around 80% in recent days.", "keywords": ["physicians", "saas", "newyork", "chronic", "newjersey", "ai", "biomarkers", "mri", "decline", "us", "lowbackpain", "backpain", "partnerships", "stock", "expansion"], "sentiment": "negative", "upside": -792.2, "linked": [], "volume": 65850400.0, "introduction": "Aclarion, a company using remote MRIs and AI to assess back pain, has expanded its US presence with over a dozen locations, including partnerships with New Jersey Imaging and Lenox Hill Radiology.", "update": "2025-03-12", "current": 0.04, "category": "stock"}, {"company": "SPI Energy Co Ltd", "symbol": "SPI", "statement": "SPI Energy Co Ltd (SPIEF:OTC US) has seen its stock price pass above its 200-day moving average, with Group One Trading LLC increasing its position in the company by 1,722.4% in the fourth quarter. The company's earnings surprise summary shows a mix of beats and misses, with actual revenue and EPS varying from consensus estimates. The article also mentions the Trump administration's efforts to reduce barriers to private sector investment and streamline regulations to support domestic resource development in the clean energy sector. Additionally, National Grid Partners has committed $100 million to invest in AI startups, and SPI Energy's stock has seen increased trading volume and price movement.", "keywords": ["trump", "trading", "startups", "revenue", "eps", "position", "regulations", "average", "administration", "moving", "investment", "movement", "surprise", "earnings", "volume", "stock", "price", "estimates", "development", "energy"], "sentiment": "positive", "upside": -893.7, "linked": [], "volume": 135038940.0, "introduction": "SPI Energy Co Ltd's stock has broken above its 200-day moving average, with a significant increase in institutional investor Group One Trading LLC's stake, amid a mixed earnings report and supportive government policies and investments in the clean energy sector.", "update": "2025-03-12", "current": 0.68, "category": "stock"}, {"company": "Cellect Biotechnology Ltd", "symbol": "QNRX", "statement": "Emergent BioSolutions and Rocketvax have announced an investment agreement and partnership to develop next-generation vaccines. The collaboration combines Rocketvax's innovative vaccine technology with Emergent's production and regulatory expertise. This partnership aims to accelerate the development of vaccines and improve global public health. Additionally, Coeptis Therapeutics has secured worldwide development and commercialization rights to an allogeneic cellular immunotherapy platform and DVX201, a clinical-stage asset from Deverra Therapeutics.", "keywords": ["platform", "stage", "expertise", "health", "investment", "asset", "partnership", "vaccines", "therapeutics", "public", "clinical", "immunotherapy", "development", "technology"], "sentiment": "positive", "upside": -637.6, "linked": [], "volume": 60422240.0, "introduction": "Emergent BioSolutions and Rocketvax have partnered to develop next-generation vaccines, combining their expertise in production and regulatory affairs with Rocketvax's innovative technology to accelerate vaccine development and improve global public health.", "update": "2025-03-12", "current": 0.41, "category": "stock"}, {"company": "Save Foods Inc", "symbol": "NITO", "statement": "The food industry is undergoing significant changes, with companies like Inline Plastics developing innovative packaging solutions to ensure food safety and freshness. The future of food preservation is focused on sustainability, innovation, and consumer-centric approaches. Companies like N2OFF, Inc. and US Foods are working to improve food safety and supply chain efficiency. Meanwhile, small brands are gaining market share as consumers become more price-conscious. The charcuterie market is also evolving, with companies like Olli Salumeria offering unique products. Additionally, companies are embracing curiosity-driven innovation and institutionalizing it through programs like Atlassian's ShipIt Days.", "keywords": ["safety", "consciousness", "freshness", "innovation", "market", "uniqueness", "consumer", "preservation", "chain", "sustainability", "efficiency", "price", "institutionalization", "share", "curiosity", "supply"], "sentiment": "positive", "upside": -234.4, "linked": [], "volume": 122185940.0, "introduction": "The food industry is undergoing significant changes, driven by a focus on sustainability, innovation, and consumer-centric approaches, with companies developing innovative packaging solutions, improving food safety and supply chain efficiency, and small brands gaining market share.", "update": "2025-03-12", "current": 1.17, "category": "stock"}, {"company": "Evaxion Biotech A/S", "symbol": "EVAX", "statement": "Evaxion Biotech A/S (EVAX) is a clinical-stage biotech company developing AI-driven immunotherapies to treat cancer and infectious diseases. The company's stock has seen recent fluctuations, with a 7.32% fluctuation on the last trading day and a -25.69% loss over the past 10 days. Analysts have a buy consensus rating, and the company is developing several immunotherapies, including EVX-01 and EVX-02. Manufacturer Emergent has invested in the company's next-gen vaccine portfolio.", "keywords": ["immunotherapies", "consensus", "cancer", "diseases", "trading", "vaccine", "rating", "analysts", "portfolio", "infectious", "biotech", "stock"], "sentiment": "positive", "upside": -1554.8, "linked": [], "volume": 55592724.0, "introduction": "Evaxion Biotech A/S is a clinical-stage biotech company developing AI-driven immunotherapies for cancer and infectious diseases, with a buy consensus rating and recent stock fluctuations.", "update": "2025-03-12", "current": 6.03, "category": "stock"}, {"company": "Windtree Therapeutics Inc", "symbol": "WINT", "statement": "Windtree Therapeutics, Inc. (WINT) is a biotechnology company focused on developing therapeutics for cardiovascular and oncology diseases. The company has strengthened its intellectual property portfolio with a new Japanese patent for its oncology pipeline. WINT has announced a new corporate strategy to identify and acquire FDA-approved revenue assets while advancing its cardiovascular and oncology pipeline. The company's lead product candidate, istaroxime, is in Phase 2b clinical trial for the treatment of acute decompensated heart failure and cardiogenic shock. WINT's stock price is currently $1.90, with a 200-day simple moving average of $132.53. The company is expected to issue its next earnings report on 03/28/2025.", "keywords": ["report", "treatment", "trial", "oncology", "assets", "price", "stock", "pipeline", "biotechnology", "average", "portfolio", "patent", "therapeutics", "earnings", "candidate", "product", "strategy", "cardiovascular"], "sentiment": "positive", "upside": -2551.6, "linked": [], "volume": 52615884.0, "introduction": "Windtree Therapeutics, a biotech company, is developing therapeutics for cardiovascular and oncology diseases, with a focus on advancing its pipeline and acquiring FDA-approved revenue assets.", "update": "2025-03-12", "current": 0.18, "category": "stock"}, {"company": "Hepion Pharmaceuticals Inc", "symbol": "HEPA", "statement": "Hepion Pharmaceuticals, Inc. (HEPA) is a pharmaceutical company that was formerly known as ContraVir Pharmaceuticals, Inc. It was incorporated in 2013 and is involved in the development of therapies for various diseases. The company has received funding and has undergone a reverse merger with Pharma Two B Ltd. for a valuation of approximately $58.5 million. The company's stock has been declining, with a recent 7-day loss of 84.76%. Analysts have issued sell ratings and price targets for the stock, while the company has received FDA approval for its OMLYCLO product.", "keywords": ["ratings", "product", "targets", "diseases", "approval", "stock", "analysts", "merger", "pharmaceuticals", "company", "development", "funding", "loss", "valuation", "therapies"], "sentiment": "negative", "upside": -8255.4, "linked": [], "volume": 534644670.0, "introduction": "Hepion Pharmaceuticals, Inc. (HEPA) is a pharmaceutical company that has received FDA approval for its OMLYCLO product and has undergone a reverse merger, but its stock has been declining with a recent 7-day loss of 84.76%.", "update": "2025-03-12", "current": 0.2, "category": "stock"}, {"company": "Starbox Group Holdings Ltd", "symbol": "STBX", "statement": "Starbox Group Holdings Ltd. (STBX) is a company that provides cash rebates, digital advertising, and payment solutions to retail merchants in Malaysia. The company's market capitalization has decreased by 91.11% since its IPO in August 2022, with a current market cap of $61.59M. The company has received a staff determination notice from an unnamed organization and has announced financial results for fiscal year 2022, showing a 127.2% increase in revenue and a 148.8% increase in net income. The company's stock price has fluctuated in recent days, with a 6.85% gain on its last trading day, and has been trending upward over the past two weeks.", "keywords": ["results", "income", "trading", "revenue", "rebates", "advertising", "capitalization", "retail", "market", "payment", "capital", "financial", "malaysia", "stock", "solutions", "ipo", "notice", "merchants", "price"], "sentiment": "positive", "upside": -969.9, "linked": [], "volume": 43502772.0, "introduction": "Starbox Group Holdings Ltd., a Malaysian company providing cash rebates, digital advertising, and payment solutions, has seen its market capitalization drop 91.11% since its IPO, but has reported significant revenue and net income growth, with its stock price experiencing recent fluctuations.", "update": "2025-03-12", "current": 0.58, "category": "stock"}]