[{"company": "ELEVAI Labs Inc", "symbol": "ELAB", "statement": "PMGC Holdings Inc. (ELAB) is a US-based company operating in the personal care products industry. The company has filed patents with Yuva Biosciences for hair and scalp care technology utilizing YuvaBio Y100 and Elevai Exosomes. The stock price has fallen 0.429% in the last trading day, and is down 56.36% in the last 10 days. The company has 18 full-time employees and went IPO in 2023. Elevai Labs, Inc., the company's gene editing and R&D business, has collaborated with Amazon's genAI tools to design CRISPR therapeutics.", "keywords": ["ipo", "hair", "r&d", "company", "crispr", "exosomes", "patents", "scalp", "therapeutics", "industry", "amazon", "products", "biosciences", "editing", "employees", "technology", "gene", "genai", "care"], "sentiment": "negative", "upside": -440.6, "linked": [], "volume": 76778720.0, "introduction": "PMGC Holdings Inc., a US-based personal care products company, has developed hair and scalp care technology with Yuva Biosciences and has collaborated with Amazon's genAI tools for gene editing and R&D.", "update": "2025-03-12", "current": 3.1, "category": "stock"}, {"company": "NVIDIA Corp", "symbol": "NVDA", "statement": "NVIDIA Corporation (NVDA) has solidified its position as a leader in the artificial intelligence (AI) industry, driving transformative technologies across various industries. The company's cutting-edge GPU innovations and partnerships have captured the attention of investors and analysts, who predict a bright future for the company. With its dominance in AI, NVIDIA is poised to continue its growth trajectory, with its latest deals and partnerships positioning it ahead of the competition. The company's CEO, Jensen Huang, will deliver a keynote at COMPUTEX 2025, and its collaborations with other companies, such as Lenovo, are bringing AI capabilities to every business and industry.", "keywords": ["growth", "dominance", "investors", "intelligence", "computex", "industry", "artificial", "innovation", "ceo", "nvidia", "future", "leadership", "competition", "keynote", "computing", "technology", "analysts", "ai", "partnerships"], "sentiment": "positive", "upside": -54.9, "linked": ["RGTI : Rigetti Computing, a quantum computing company, reported a net loss in Q4 2024, but its stock surged 8.5% due to investor confidence in its future potential and growth in its cutting-edge technology and cloud-based solutions."], "volume": 232797900.0, "introduction": "NVIDIA has solidified its leadership in the AI industry with its cutting-edge GPU innovations and partnerships, driving growth and predicting a bright future for the company.", "update": "2025-03-12", "current": 142.62, "category": "stock"}, {"company": "Ocean Power Technologies Inc", "symbol": "OPTT", "statement": "Ocean Power Technologies (OPTT) has announced a binding letter of intent to deploy its technology, but disclaims any obligation to update forward-looking statements. The company provides ocean data collection and reporting, marine power, and offshore communications services. It has secured a follow-on order and delivered products to Latin America. The company's stock price and earnings history are publicly available, and it is listed on the NYSE American exchange. There is no specific news or updates provided about the company's financials, products, or services, except for a brief mention of its CEO and headquarters location.", "keywords": ["ocean", "earnings", "marine", "data", "latin", "communications", "stock", "america", "power", "products", "forward", "order", "update", "offshore", "history", "technology", "financials", "intent", "nyse"], "sentiment": "positive", "upside": -201.8, "linked": [], "volume": 17324848.0, "introduction": "Ocean Power Technologies has announced a binding letter of intent to deploy its technology, but does not provide any new information about its financials, products, or services.", "update": "2025-03-12", "current": 0.84, "category": "stock"}, {"company": "Marathon Digital Holdings Inc", "symbol": "MARA", "statement": "Marathon Digital Holdings, Inc. (MARA) is a digital asset technology company based in Las Vegas, Nevada. The company has been heavily searched by investors and has seen its shares return -10.2% over the past month. MARA has been expanding its mining operations, launching new digital asset products, and exploring partnerships with other blockchain technology companies. The company has also recently invested in mining equipment. Meanwhile, GameSquare Holdings, Inc. has entered into a multi-year partnership with efuse and Sideqik, a GameSquare Company, to shape the future of gaming experiences.", "keywords": ["experiences", "technology", "mining", "company", "digital", "gaming", "blockchain", "shares", "investors", "partnerships"], "sentiment": "negative", "upside": -57.7, "linked": [], "volume": 45912380.0, "introduction": "Marathon Digital Holdings, a digital asset technology company, has seen its shares decline 10.2% in a month, while expanding mining operations, launching new products, and investing in equipment, amidst a separate gaming partnership with GameSquare Holdings.", "update": "2025-03-12", "current": 19.99, "category": "stock"}, {"company": "Super Micro Computer Inc", "symbol": "SMCI", "statement": "Supermicro, a Total IT Solution Provider for AI, Cloud, Storage, and 5G/Edge, has introduced a range of new systems optimized for edge and embedded workloads, powered by the latest Intel Xeon 6 SoC processor family. The compact servers aim to enhance real-time AI performance and efficiency, catering to growing demand for edge AI solutions. The company's shares surged after the announcement, with analysts citing the potential for significant growth in the AI and edge computing markets.", "keywords": ["efficiency", "growth", "intel", "5g", "xeon", "server", "ai", "edge", "cloud", "storage", "performance"], "sentiment": "positive", "upside": 55.0, "linked": [], "volume": 31511748.0, "introduction": "Supermicro has introduced a range of compact servers optimized for edge and embedded workloads, powered by Intel Xeon 6 SoC processors, to enhance real-time AI performance and efficiency.", "update": "2025-03-12", "current": 33.27, "category": "stock"}, {"company": "Archer Aviation Inc", "symbol": "ACHR", "statement": "Archer Aviation is a company that designs, develops, and operates electric vertical takeoff and landing (eVTOL) aircraft for urban air mobility. The company plans to increase its annual production significantly over the next few years, with a goal of producing 650 aircraft in 2028. Archer Aviation's earnings report for Q4 2024 showed a mixed financial performance, but the company is investing heavily in research and development. The company has introduced a commercialization program for its flagship Midnight aircraft and has received a $55 million investment from Stellantis. Archer Aviation's stock has been climbing, and analysts are optimistic about its growth potential in the emerging urban air mobility market.", "keywords": ["electric", "growth", "commercialization", "aircraft", "urban", "earnings", "investment", "vertical", "goal", "research", "takeoff", "landing", "mobility", "development", "optimism", "production"], "sentiment": "positive", "upside": -152.8, "linked": [], "volume": 33892816.0, "introduction": "Archer Aviation, an eVTOL aircraft manufacturer, aims to increase production to 650 aircraft by 2028, with a mixed Q4 earnings report and significant investments in R&D, backed by a $55 million investment from Stellantis.", "update": "2025-03-12", "current": 9.97, "category": "stock"}, {"company": "Rigetti Computing Inc", "symbol": "RGTI", "statement": "Rigetti Computing, a quantum computing company, has made significant strides despite reporting a $153 million net loss in Q4 2024. Despite this, its stock surged by 8.5%, indicating investor confidence in its future potential. The company has been pushing boundaries with innovation and strategic partnerships, and its cutting-edge technology and cloud-based solutions have driven growth. With a 237% surge in its stock price over the past year, Rigetti Computing is well-positioned to capitalize on the growing quantum computing industry.", "keywords": ["industry", "growth", "stock", "computing", "innovation", "quantum", "technology", "partnerships", "cloud"], "sentiment": "positive", "upside": -109.5, "linked": ["NVDA : NVIDIA has solidified its leadership in the AI industry with its cutting-edge GPU innovations and partnerships, driving growth and predicting a bright future for the company."], "volume": 212161810.0, "introduction": "Rigetti Computing, a quantum computing company, reported a net loss in Q4 2024, but its stock surged 8.5% due to investor confidence in its future potential and growth in its cutting-edge technology and cloud-based solutions.", "update": "2025-03-12", "current": 13.2, "category": "stock"}, {"company": "Tesla Inc", "symbol": "TSLA", "statement": "Tesla has revolutionized the electric vehicle industry with its innovative products, setting new standards for performance, range, and innovation. Despite a recent downturn in its stock, Wedbush Securities remains optimistic about Tesla's potential, setting a price target of $550. The company plans to double its vehicle output in the US within two years, and its commitment to sustainability and innovation has earned it a spot on Wedbush's \"Best Ideas List\". However, Tesla's stock has hit a new low, sparking concerns about the company's growth and future prospects.", "keywords": ["standards", "electric", "industry", "securities", "best", "growth", "stocks", "innovation", "future", "target", "ideas", "range", "sustainability", "performance"], "sentiment": "positive", "upside": -75.6, "linked": [], "volume": 55806692.0, "introduction": "Tesla, despite a recent stock downturn, is expected to double its US vehicle output in two years and has been recognized for its commitment to sustainability and innovation, with a price target of $550, according to Wedbush Securities.", "update": "2025-03-12", "current": 406.58, "category": "stock"}, {"company": "Plug Power Inc", "symbol": "PLUG", "statement": "Plug Power Inc. (PLUG) is a company that develops hydrogen and fuel cell product solutions, offering GenDrive, a hydrogen-fueled proton exchange membrane (PEM) fuel cell system, and GenSure, a stationary fuel cell that supports backup and grid-support. The company has a joint venture with Olin Corporation to produce 1,000 tons per day of liquid hydrogen by 2028. Plug Power is a pioneer in hydrogen and fuel cell technologies, offering a wide range of products across North America, Europe, Asia, and beyond. The company has reported revenues of $191.47 million in the last quarter, with a year-over-year change of -13.8%, and EPS of -$1.65.", "keywords": ["revenues", "gendrive", "backup", "venture", "eps", "grid", "pem", "stationary", "plug", "cell", "hydrogen", "pioneer", "power", "fuel", "gensure", "olin", "corporation"], "sentiment": "negative", "upside": -472.4, "linked": [], "volume": 75948296.0, "introduction": "Plug Power Inc. is a company that develops and offers hydrogen and fuel cell solutions, including GenDrive and GenSure products, with a focus on producing liquid hydrogen through a joint venture with Olin Corporation and reporting quarterly revenues of $191.47 million.", "update": "2025-03-12", "current": 2.08, "category": "stock"}, {"company": "Intel Corp", "symbol": "INTC", "statement": "Intel Labs is working on intelligent edge infrastructure and services, employing over 700 engineers and scientists. QNX has launched a functional safety platform built on Intel Core i7 processors and QNX OS for Safety, aiming to meet growing demand for integrated and safety-certified solutions in industrial automation. Intel has also launched a cutting-edge AI development platform, and its 18A manufacturing process is being tested by industry heavyweights NVIDIA and Broadcom. Meanwhile, MSI IPC is showcasing edge AI computing solutions at Embedded World 2025, and Altera is operating independently as an Intel-owned FPGA provider.", "keywords": ["safety", "qnx", "services", "development", "msi", "labs", "processors", "engineers", "edge", "platform", "os", "fpga", "nvidia", "broadcom", "scientists", "infrastructure", "intel", "ipc", "manufacturing", "ai", "automation"], "sentiment": "positive", "upside": -188.8, "linked": [], "volume": 65888810.0, "introduction": "Intel is working on intelligent edge infrastructure and services, employing over 700 engineers and scientists, and has launched various products and platforms, including a functional safety platform, AI development platform, and edge AI computing solutions.", "update": "2025-03-12", "current": 20.83, "category": "stock"}, {"company": "Palantir Technologies Inc", "symbol": "PLTR", "statement": "Palantir Technologies Inc. (PLTR) has made significant advancements in deploying AI-powered systems, including delivering mobile battle stations to the US Army as part of a $178 million contract. The company has also announced the delivery of AI-enabled systems to the US Army, marking a milestone in the integration of AI into modern warfare. Additionally, Palantir has partnered with Shanghai Jiao Tong University to focus on cutting-edge technologies and emerging industries, such as AI, integrated circuits, and biomedicine. The company has also made headlines for its defense contracts, including a $178 million deal with the US Army, and has seen its stock surge over 204% in the last 12 months.", "keywords": ["army", "contract", "university", "artificial", "industry", "stock", "defense", "surge", "intelligence", "technology", "circuits", "partnership", "biomedicine"], "sentiment": "positive", "upside": -93.4, "linked": ["AILE : Several companies, including Avant Technologies, Atomiq Inc., IBM, AGCO Corporation, and others, have made acquisitions, partnerships, and investments in various industries, including AI, defense, agriculture, and more."], "volume": 55107276.0, "introduction": "Palantir Technologies has made significant advancements in deploying AI-powered systems, delivering mobile battle stations to the US Army and partnering with Shanghai Jiao Tong University to focus on emerging industries, while also securing defense contracts and experiencing a 204% stock surge in the past year.", "update": "2025-03-12", "current": 78.98, "category": "stock"}, {"company": "Thoughtworks Holding Inc", "symbol": "TWKS", "statement": "The articles and news stories cover a range of topics, including product development, earnings reports, AI governance, local news, and innovation. Thoughtworks, a global IT consultancy, is featured in several articles, including its earnings report and a profile of its Director, Software Architect, and Meme Wrangler, Neal Ford. The articles also discuss AI innovation, including Adobe Sensei's integration of AI and machine learning into its marketing and creative products. Additionally, there are mentions of product development, innovation, and entrepreneurship, including the importance of innovation for small companies to break into new markets and the use of cutting-edge technology to stay competitive.", "keywords": ["marketing", "news", "earnings", "innovation", "creative", "competitive", "ai", "technology", "company", "small", "governance", "development", "product", "entrepreneurship"], "sentiment": "positive", "upside": -139.97, "linked": [], "volume": 52182156.0, "introduction": "The articles and news stories cover a range of topics including product development, earnings reports, AI governance, local news, and innovation, featuring Thoughtworks and Adobe Sensei, among others.", "update": "2025-03-12", "current": 4.47, "category": "stock"}, {"company": "Rivian Automotive Inc", "symbol": "RIVN", "statement": "Rivian Automotive, a young start-up, is generating extra revenue through various means. The company has formed a joint venture with Volkswagen Group worth up to $5.8 billion, combining their strengths to create a new revenue stream. Rivian's software will power Volkswagen's ID.1 city car and future models. The company has also introduced its R2, R3, and R3X vehicles built on a new midsize platform. Rivian's strategic alliance with Amazon is a game-changer, with a landmark order for 100,000 electric delivery vans by 2030. The company's CEO, RJ Scaringe, has showcased the \"Maximus\" drive unit that will power the R2, representing an evolution of the Enduro drive unit used in the dual-motor R1 vehicles.", "keywords": ["automotive", "electric", "rivian", "venture", "delivery", "amazon", "maximus", "volkswagen", "vans", "ceo", "enduro", "software", "alliance"], "sentiment": "positive", "upside": -311.9, "linked": [], "volume": 31308816.0, "introduction": "Rivian Automotive, a young start-up, generates revenue through a joint venture with Volkswagen Group, strategic alliance with Amazon, and introduction of new vehicles, including R2, R3, and R3X, with a landmark order for 100,000 electric delivery vans.", "update": "2025-03-12", "current": 12.77, "category": "stock"}, {"company": "SoFi Technologies Inc", "symbol": "SOFI", "statement": "SoFi Technologies, Inc. (SOFI) has transformed from a fintech startup to a profitable financial institution, delivering its first full year of GAAP profitability with $2.61 billion in revenue and $666 million in adjusted EBITDA. The company has expanded its offerings beyond student loan refinancing to digital banking, investing, and insurance. With a strong track record of growth, SoFi has become a leader in the financial services industry, with a market capitalization of over $11 billion. The company's stock has risen as investors bet on its continued growth, with a consensus rating of \"Hold\" from analysts.", "keywords": ["growth", "profitability", "banking", "leader", "fintech", "stock", "insurance", "analysts", "investing", "capitalization", "revenue", "ebitda"], "sentiment": "positive", "upside": -94.5, "linked": [], "volume": 54306476.0, "introduction": "SoFi Technologies, Inc. has transitioned from a fintech startup to a profitable financial institution, achieving $2.61 billion in revenue and $666 million in adjusted EBITDA, and expanding its offerings beyond student loan refinancing to digital banking, investing, and insurance.", "update": "2025-03-12", "current": 17.92, "category": "stock"}, {"company": "Quantum Computing Inc", "symbol": "QUBT", "statement": "Quantum Computing Inc. (QCi) is leading the way in the quantum computing industry, unveiling the future at the 37th Annual ROTH Conference. IonQ, Inc. is another trailblazer, developing and commercializing quantum computing solutions. The company has expanded its quantum networking patent portfolio and boasts 36 algorithmic qubits. Other notable players in the industry include Quantinuum, IBM, and IonQ, which have made significant breakthroughs in quantum computing. The technology is being explored for its potential applications in various industries, including AI, security, optimization, and scientific discovery.", "keywords": ["breakthroughs", "industry", "applications", "computing", "networking", "innovation", "quantum", "portfolio", "discovery", "ai", "technology", "algorithmic", "future", "patent", "optimization", "breakthrough", "security"], "sentiment": "positive", "upside": -108.7, "linked": ["IONQ : IonQ, a quantum computing and networking company, has expanded its patent portfolio, announced new partnerships, and secured funding to develop its 36-qubit quantum computers for applications like secure networking and complex problem-solving."], "volume": 34888868.0, "introduction": "Quantum Computing Inc. and IonQ, Inc. are leading the way in the quantum computing industry, developing and commercializing quantum computing solutions with significant breakthroughs and patent portfolios, alongside other notable players like Quantinuum, IBM, and IonQ.", "update": "2025-03-12", "current": 10.93, "category": "stock"}, {"company": "Ford Motor Co", "symbol": "F", "statement": "Ford Motor Company is exploring the potential of Augmented Reality (AR) technology in its manufacturing process, having successfully implemented an AR application at its Dearborn, Michigan plant. The company is also committed to sustainability, with a growing lineup of electric vehicles (EVs) designed to meet modern drivers' demands. Ford has also partnered with Tesla to provide fast-charging adapters to its customers, allowing them to access the Tesla Supercharger network. The company's mission is to drive human progress through the freedom of movement, and it is working to reduce its environmental impact by reducing emissions and promoting sustainable practices in its supply chain.", "keywords": ["augmented", "electric", "partnership", "charging", "freedom", "ford", "manufacturing", "technology", "tesla", "vehicles", "practices", "reality", "sustainability", "movement", "emissions", "environment"], "sentiment": "positive", "upside": -56.1, "linked": [], "volume": 42802990.0, "introduction": "Ford Motor Company is exploring AR technology in its manufacturing process and prioritizing sustainability through its growing electric vehicle lineup and partnerships, such as providing Tesla Supercharger adapters to customers.", "update": "2025-03-12", "current": 10.12, "category": "stock"}, {"company": "NIO Inc", "symbol": "NIO", "statement": "BASF Coatings and NIO, a pioneer in the global smart electric vehicle market, have agreed to a strategic partnership to enhance cooperation in the automotive coatings sector. NIO's stock surged higher due to a partnership with BASF Coatings, and analysts predict it will continue to grow. NIO is a leading electric vehicle manufacturer that offers a range of products, including the ES8, ES6, EC6, and ET7, and has launched its new EC6 smart electric coupe SUV in China. The company is also expanding its power solutions, including home charging and battery swapping services.", "keywords": ["growth", "surge", "swapping", "solutions", "charging", "china", "prediction", "vehicle", "suv", "stock", "innovation", "coatings", "products", "range", "manufacturer", "electric", "coupe", "expansion", "technology", "analysis", "partnership"], "sentiment": "positive", "upside": -262.9, "linked": ["LCID : Lucid Group, Inc. is a luxury electric vehicle manufacturer that has delivered over 10,000 units and reported 35.71% sales growth, despite production hurdles and geopolitical challenges, and plans to launch lower-priced midsize vehicles by 2026."], "volume": 39487612.0, "introduction": "BASF Coatings and NIO, a leading electric vehicle manufacturer, have partnered to enhance cooperation in the automotive coatings sector, driving NIO's stock to surge higher and analysts predicting continued growth.", "update": "2025-03-12", "current": 4.29, "category": "stock"}, {"company": "Iris Energy Ltd", "symbol": "IREN", "statement": "Iris Energy (IREN) is planning to build a 75MW liquid-cooled data center in Texas, called Horizon 1, which will be designed to support 200kW per rack and host Nvidia Blackwell GPUs. The facility is expected to be completed in H2 2025. IREN is a company that owns and operates bitcoin mining data centers and provides high-performance computing solutions, including AI cloud services. The company's stock has seen some activity, with analysts providing a 4.1/5 rating and a forecast for 2025. There are also various news articles and stock quotes mentioned, including a lawsuit against the company and its financial results.", "keywords": ["horizon", "energy", "rating", "stock", "forecast", "results", "texas", "bitcoin", "center", "mining", "nvidia", "lawsuit", "ai", "data", "cloud"], "sentiment": "negative", "upside": -113.2, "linked": ["CIFR : Cipher Mining Inc, a technology company, develops and operates large-scale bitcoin mining data centers across the US, with a strong growth pipeline and bullish analyst ratings."], "volume": 22476084.0, "introduction": "Iris Energy plans to build a 75MW liquid-cooled data center in Texas, Horizon 1, designed to support 200kW per rack and host Nvidia Blackwell GPUs, with completion expected in H2 2025.", "update": "2025-03-12", "current": 13.32, "category": "stock"}, {"company": "Opendoor Technologies Inc", "symbol": "OPEN", "statement": "Opendoor Technologies Inc. (NASDAQ: OPEN) has seen its stock price decline by 7.49% due to increased competition in the real estate technology sector and concerns over higher interest rates affecting the housing market. The company has received several awards and recognitions for its innovative approach to the real estate industry. In its Q4 2024 earnings report, Opendoor beat analysts' estimates with earnings per share of ($0.09) and revenue of $2.27 billion. The company has received guidance for its first quarter 2025 earnings, with revenue expected to be $1.0 billion-$1.1 billion. Analysts have an average target of $1.70 for the stock, predicting a 41.67% increase from its current price of $1.20.", "keywords": ["open", "estate", "earnings", "revenue", "recognitions", "housing", "innovation", "predictions", "interest", "nasdaq", "target", "competition", "real", "awards", "guidance", "technology", "rates", "analysts", "market"], "sentiment": "positive", "upside": -284.8, "linked": [], "volume": 26005726.0, "introduction": "Opendoor Technologies Inc.'s stock has declined 7.49% due to increased competition and interest rate concerns, but the company has received awards and beat earnings estimates, with analysts predicting a 41.67% increase to $1.70.", "update": "2025-03-12", "current": 1.4, "category": "stock"}, {"company": "Lucid Group Inc", "symbol": "LCID", "statement": "Lucid Group, Inc. is a luxury electric vehicle manufacturer that has emerged as a trailblazer in the rapidly evolving EV landscape. Its flagship model, the Lucid Air, offers an opulent driving experience with cutting-edge technology and sustainable innovation. Despite being behind Rivian in production, Lucid has delivered over 10,000 units and reported a 35.71% sales growth in fiscal 2024. The company is investing $1.4 billion in capital expenditures for 2025 and plans to launch lower-priced midsize vehicles by 2026. However, it faces production hurdles and geopolitical challenges, but has shown operational excellence and market foothold.", "keywords": ["opulent", "electric", "expenditures", "growth", "rivian", "luxury", "innovation", "foothold", "sustainable", "trailblazer", "technology", "vehicle", "capital", "challenges", "manufacturer", "production"], "sentiment": "positive", "upside": -276.8, "linked": ["NIO : BASF Coatings and NIO, a leading electric vehicle manufacturer, have partnered to enhance cooperation in the automotive coatings sector, driving NIO's stock to surge higher and analysts predicting continued growth."], "volume": 80242350.0, "introduction": "Lucid Group, Inc. is a luxury electric vehicle manufacturer that has delivered over 10,000 units and reported 35.71% sales growth, despite production hurdles and geopolitical challenges, and plans to launch lower-priced midsize vehicles by 2026.", "update": "2025-03-12", "current": 2.79, "category": "stock"}, {"company": "Marathon Oil Corp", "symbol": "MRO", "statement": "Marathon Petroleum and its midstream segment, MPLX, have achieved a milestone by reducing energy intensity by 10% within a five-year period, earning an ENERGY STAR Industrial Showcase. ConocoPhillips, after acquiring Marathon Oil, has gained 2,000 new well locations and plans to integrate them into its operations, reducing costs and improving efficiencies. Marathon Petroleum Corp is a leading energy company with a focus on refining and marketing petroleum products, and its recent merger with Marathon Oil has boosted its asset lineup. Analysts predict significant returns and growth for ConocoPhillips, with plans for new processing facilities and a 25% compound growth in liquids over the next five years.", "keywords": ["cost", "milestone", "energy", "efficiency", "marketing", "merger", "growth", "reduction", "refining", "returns", "integration", "acquisition", "energy_star"], "sentiment": "positive", "upside": -58.36, "linked": [], "volume": 36021830.0, "introduction": "Marathon Petroleum and its midstream segment MPLX have achieved an ENERGY STAR Industrial Showcase by reducing energy intensity by 10% in five years, while ConocoPhillips, after acquiring Marathon Oil, plans to integrate new well locations and reduce costs.", "update": "2025-03-12", "current": 28.55, "category": "stock"}, {"company": "Grab Holdings Ltd", "symbol": "GRAB", "statement": "Grab Holdings Limited, a superapp company operating in Southeast Asia, reported a 17% increase in revenue to $764 million in its fourth-quarter fiscal 2024, beating consensus estimates. The company operates in the delivery, mobility, and digital financial services sectors across 700 cities in eight countries, with a focus on Southeast Asia. Grab has partnered with tech firms to assess the impact of autonomous vehicles and has raised $10.4 billion in funding from 106 investors. The company's main competitors are Foodpanda and Gojek, and it has a leading market share in its core businesses, ride-sharing and food delivery.", "keywords": ["financial", "share", "countries", "delivery", "grab", "southeast", "limited", "asia", "vehicles", "services", "mobility", "investors", "competitors", "cities", "increase", "focus", "estimates", "autonomous", "revenue", "superapp", "holdings", "funding", "digital", "businesses", "market"], "sentiment": "positive", "upside": -113.0, "linked": [], "volume": 20278470.0, "introduction": "Grab Holdings Limited, a Southeast Asia-based superapp company, reported a 17% revenue increase to $764 million in Q4 2024, beating estimates, and operates in delivery, mobility, and digital financial services across 8 countries.", "update": "2025-03-12", "current": 4.57, "category": "stock"}, {"company": "MicroStrategy Inc", "symbol": "MSTR", "statement": "MicroStrategy Incorporated (MSTR) is a company that provides advanced analytics software and services, leveraging artificial intelligence to offer insights for decision-making. Its flagship product is used by companies to make better decisions and transform their businesses. The company has seen significant growth, with its stock up 500% in 2024, and has recently completed a $2 billion offering of convertible senior notes. Despite a recent 27% price surge, the company's stock is still considered overvalued by some analysts, with a P/B ratio of 3.15 and a P/E ratio of -42.48.", "keywords": ["growth", "artificial", "stock", "offering", "business", "intelligence", "decision", "analytics", "notes", "overvalued", "ratio", "valuation", "insights"], "sentiment": "negative", "upside": -102.3, "linked": [], "volume": 22695180.0, "introduction": "MicroStrategy Incorporated, a company providing advanced analytics software and services, has seen significant growth, with its stock up 500% in 2024, but is considered overvalued by some analysts due to its high P/B and P/E ratios.", "update": "2025-03-12", "current": 353.67, "category": "stock"}, {"company": "Apple Inc", "symbol": "AAPL", "statement": "Apple unveiled several new products this week, including two new iPad models, two new Mac models, and an ultra-powerful Apple Silicon chip. The company also released an iPhone with 6GB of memory and the A16 chip, which some have criticized as not being as powerful as previous models. Apple's new Mac Studio and MacBook Air models promise high-performance capabilities for creative professionals and power users. The company's product development strategy has been analyzed and praised for its innovative approach, with a focus on creating new products that drive industry trends rather than simply copying competitors.", "keywords": ["innovative", "users", "air", "competitors", "creative", "trends", "macbook", "silicon", "mac", "professionals", "approach", "industry", "ipad", "a16", "apple", "power", "products", "memory", "strategy", "unveiled", "iphone", "chip", "studio"], "sentiment": "positive", "upside": -62.1, "linked": [], "volume": 52645956.0, "introduction": "Apple unveiled a range of new products, including two new iPads, two new Macs, an iPhone with 6GB of memory, and an ultra-powerful Apple Silicon chip, showcasing the company's innovative approach to product development.", "update": "2025-03-12", "current": 222.78, "category": "stock"}, {"company": "CleanSpark Inc", "symbol": "CLSK", "statement": "CleanSpark (CLSK) is a bitcoin mining company with a growing customer base and diverse solutions, making it a good investment opportunity. The company has increased its bitcoin holdings and is a prominent player in the cryptocurrency sector. With a market capitalization of $2.24 billion, CLSK operates data centers that primarily run on low-carbon power, supporting Bitcoin, a digital commodity and tool for financial independence and inclusion. The company has a strong workforce and multiple mining facilities across the US, using renewable energy sources. Analysts rate CLSK as a top pick, with a strong growth potential and innovative solutions.", "keywords": ["energy", "growth", "rating", "facilities", "investment", "opportunity", "bitcoin", "analysts", "mining", "capitalization", "renewable", "workforce", "solutions", "data", "centers", "pick"], "sentiment": "positive", "upside": -121.6, "linked": ["BE : Bloom Energy is a company that generates electricity using natural gas and other fuels, with strong growth predicted and a flagship product used in over 1,200 locations across seven countries."], "volume": 24849948.0, "introduction": "CleanSpark is a bitcoin mining company with a growing customer base, diverse solutions, and strong growth potential, making it a good investment opportunity with a market capitalization of $2.24 billion.", "update": "2025-03-12", "current": 11.53, "category": "stock"}, {"company": "AT&T Inc", "symbol": "T", "statement": "AT&T is an American multinational telecommunications company headquartered in Dallas, Texas, and is the world's third-largest telecommunications company by revenue. The company offers various services, including internet and mobile communications. The article also mentions AT&T's dividend yield, stock price, and news about its partnerships and events. Additionally, there are links to various Wikipedia articles and news stories about the company, as well as a section on how to type the '@' symbol on a Mac.", "keywords": ["news", "wikipedia", "stock", "mobile", "multinational", "price", "internet", "events", "company", "dividend", "telecommunications", "revenue", "partnerships", "yield", "communications"], "sentiment": "neutral", "upside": 38.9, "linked": ["PCG : Procter & Gamble is a multinational consumer goods company with a strong track record of delivering long-term investor returns, whose stock price and news are tracked by various financial websites."], "volume": 43626290.0, "introduction": "AT&T is a multinational telecommunications company headquartered in Texas, offering internet and mobile services and ranking as the world's third-largest telecommunications company by revenue.", "update": "2025-03-12", "current": 22.72, "category": "stock"}, {"company": "SoundHound AI Inc", "symbol": "SOUN", "statement": "SoundHound AI Inc. is gaining attention after announcing a major collaboration with CardFree to enhance its AI capabilities, driving an 8.66% increase in its stock price. The company expects revenue to double this year, with a nearly $1.2 billion revenue backlog. SoundHound AI also presented at the Cantor Fitzgerald Global Technology Conference, highlighting its leadership in conversational and voice AI. The company's stock has surged following earnings, with some predicting even more growth ahead.", "keywords": ["growth", "artificial", "stock", "intelligence", "technology", "collaboration", "revenue", "conference", "leadership"], "sentiment": "positive", "upside": -109.4, "linked": [], "volume": 64984504.0, "introduction": "SoundHound AI's collaboration with CardFree and strong earnings projections have driven its stock price up 8.66% and led to a nearly $1.2 billion revenue backlog, with further growth predicted.", "update": "2025-03-12", "current": 15.84, "category": "stock"}, {"company": "D-Wave Quantum Inc", "symbol": "QBTS", "statement": "D-Wave, a leader in quantum computing, has achieved \"quantum supremacy\" using its Advantage2 computer, outperforming classical methods in solving complex materials simulation problems. The company, which is the world's first commercial supplier of quantum computers, claims to have achieved \"quantum computational supremacy\" by demonstrating real-world results with its annealing quantum computer. This breakthrough has significant implications for industries such as materials science, where D-Wave's technology can help accelerate the discovery of new materials and properties without the need for physical experimentation.", "keywords": ["advantage2", "computing", "quantum", "materials", "annealing", "discovery", "supremacy", "science", "simulation"], "sentiment": "positive", "upside": -120.8, "linked": [], "volume": 137765140.0, "introduction": "D-Wave, a leader in quantum computing, has achieved \"quantum supremacy\" with its Advantage2 computer, outperforming classical methods in solving complex materials simulation problems.", "update": "2025-03-12", "current": 6.09, "category": "stock"}, {"company": "Nu Holdings Ltd", "symbol": "NU", "statement": "Nu Holdings, a digital banking platform in Latin America, is experiencing a stock drawdown, but its revenue is still growing quickly. The company has a lot of room to expand into other Latin American markets. Analysts are optimistic about its growth prospects, with some predicting a strong future for the company. Nu Holdings has gained 20.4 million customers and seen a 22% increase in earnings in FY24. The company's digital platform simplifies banking and offers products like credit cards and loans. Despite the current stock price decline, Nu Holdings is considered a large-cap growth stock with a 66% rating based on its fundamentals and valuation.", "keywords": ["expand", "growth", "banking", "drawdown", "optimistic", "customers", "fy24", "earnings", "credit", "markets", "revenue", "latin", "stock", "america", "platform", "fundamentals", "prospects", "decline", "loans", "analysts", "digital", "valuation"], "sentiment": "positive", "upside": -84.9, "linked": ["SMR : NuScale Power's stock has risen 11.55% after securing key investment agreements and despite canceling a project and layoffs, analysts predict significant improvement in business fundamentals."], "volume": 41150864.0, "introduction": "Nu Holdings, a digital banking platform in Latin America, is experiencing a stock drawdown but still growing revenue quickly, with analysts optimistic about its growth prospects and strong future.", "update": "2025-03-12", "current": 12.34, "category": "stock"}, {"company": "Advanced Micro Devices Inc", "symbol": "AMD", "statement": "Advanced Micro Devices (AMD) has launched its 5th generation EPYC Embedded chips, powered by the \"Zen 5\" architecture, designed to boost AI, storage, and edge computing performance and energy efficiency. The new chips have up to 192 cores and are targeted at partners like Advantech, which is using them in its edge computing and edge AI solutions. AMD has also expanded its product portfolio and launched a $1.5 billion fixed-income offering. The company has partnered with QNX to enhance performance in robotic systems and has collaborated with IBM to deliver high-performance and reliable solutions for AI workloads.", "keywords": ["energy", "offering", "workloads", "micro", "qnx", "solutions", "systems", "advanced", "edge", "storage", "devices", "edgeai", "ibm", "embedded", "epyc", "zen", "amd", "robotic", "efficiency", "computing", "advantech", "portfolio", "ai", "partners", "performance"], "sentiment": "positive", "upside": -77.1, "linked": [], "volume": 31002960.0, "introduction": "AMD has launched its 5th generation EPYC Embedded chips, featuring up to 192 cores and designed to boost AI, storage, and edge computing performance and energy efficiency, targeting partners like Advantech and collaborating with QNX and IBM for various applications.", "update": "2025-03-12", "current": 122.84, "category": "stock"}, {"company": "Riot Blockchain Inc", "symbol": "RIOT", "statement": "Riot Platforms, Inc. is a US-based blockchain technology company that aims to become North America's leading provider of Bitcoin mining services. The company recently launched a new subsidiary called RiotX Ventures, which will focus on developing new blockchain-based products and services. Riot Platforms also invests in research and development, focusing on developing new products and services. The company's stock price has been fluctuating, with a current price of $8.37 and a 12-month price forecast of $17.67, with an average target of 111.11% growth.", "keywords": ["forecast", "stock", "venture", "growth", "investment", "research", "bitcoin", "price", "mining", "blockchain", "development"], "sentiment": "positive", "upside": -94.4, "linked": [], "volume": 46591200.0, "introduction": "Riot Platforms, Inc. is a US-based blockchain company that provides Bitcoin mining services and develops new blockchain-based products, with a fluctuating stock price and a 12-month forecast of $17.67.", "update": "2025-03-12", "current": 13.54, "category": "stock"}, {"company": "Pfizer Inc", "symbol": "PFE", "statement": "Pfizer, a global biopharmaceutical company, has announced positive results from its Phase 3 clinical trial for vepdegestrant monotherapy in adults with advanced breast cancer. The company also has high hopes for new products, including PD-1/PD-L1 inhibitor sasanlimab and CD3xBCMA bispecific Elrexfio, and has joined the UN Global Compact to promote corporate citizenship. Additionally, Pfizer has appointed a chief digital officer, and its CEO has expressed optimism about the company's future growth, citing its strong portfolio of marketed products and pipeline. The company's oncology growth and new products are expected to offset declining sales of its COVID-19 vaccines.", "keywords": ["sasanlimab", "growth", "treatment", "biopharmaceutical", "citizenship", "pharmaceutical", "un", "bispecific", "corporate", "pipeline", "pd1", "clinical", "breast", "elrexfio", "oncology", "products", "bcma", "trial", "cancer", "vaccines", "digital", "pd-l1", "portfolio", "inhibitor", "cd3"], "sentiment": "positive", "upside": -47.3, "linked": [], "volume": 31175632.0, "introduction": "Pfizer has announced positive results from its Phase 3 clinical trial for vepdegestrant monotherapy in advanced breast cancer and has high hopes for new products, while also promoting corporate citizenship and appointing a chief digital officer.", "update": "2025-03-12", "current": 26.09, "category": "stock"}, {"company": "KULR Technology Group Inc", "symbol": "KULR", "statement": "KULR Technology Group, a leader in advanced energy management platforms, will hold a conference call on March 27th to discuss its financial results for the fourth quarter and full year ended December 31, 2024. The company has also partnered with Worksport to develop a new battery pack system and with Cirba Solutions to develop a safe and efficient recycling process for end-of-life EV batteries. Additionally, KULR has announced its quarterly earnings call transcript and has a company profile and overview.", "keywords": ["financial", "battery", "energy", "efficiency", "platforms", "earnings", "results", "profile", "management", "quarter", "technology", "recycling", "system", "conference", "year", "call"], "sentiment": "positive", "upside": -117.2, "linked": [], "volume": 17017950.0, "introduction": "KULR Technology Group will hold a conference call on March 27th to discuss its Q4 and full-year 2024 financial results, and has partnered with Worksport and Cirba Solutions on new projects.", "update": "2025-03-12", "current": 2.46, "category": "stock"}, {"company": "Amazon.com Inc", "symbol": "AMZN", "statement": "Amazon is investing in robotics and artificial intelligence (AI) to improve efficiency and lower costs, with the goal of delivering items within hours. The company's CTO, Dr. Werner Vogels, has emphasized the importance of innovation and scalability in developing cloud solutions. Amazon's stock has performed well, with a valuation of $228.68 as of February 2025. The company has also expanded into healthcare, offering its Amazon Care service to its employees and other organizations. Additionally, Amazon is racing to develop fault-tolerant quantum computers alongside Google, IBM, and Microsoft.", "keywords": ["cost", "efficiency", "artificial", "robotics", "investment", "innovation", "quantum", "goal", "scalability", "valuation", "cloud", "healthcare"], "sentiment": "positive", "upside": -49.5, "linked": [], "volume": 26234668.0, "introduction": "Amazon is investing in robotics and AI to improve efficiency and lower costs, with a goal of same-day delivery, and is also expanding into healthcare and developing quantum computers.", "update": "2025-03-12", "current": 234.85, "category": "stock"}, {"company": "iQIYI Inc", "symbol": "IQ", "statement": "iQIYI, a Chinese online entertainment service, announced its Q4 2024 earnings report, with details on its various products and services, including online video, games, literature, and animations. The company launched over 300 new titles at its 2024 World Conference, introducing two new drama series brands and forging partnerships to fuel growth. Analysts predict an average target price of $2.60 for iQIYI stock, with a low estimate of $1.80 and high estimate of $3.00, indicating a potential 10.64% increase from the current stock price.", "keywords": ["conference", "growth", "stock", "estimate", "video", "earnings", "increase", "drama", "games", "literature", "price", "analysts", "animations", "products", "services", "partnerships", "report", "target"], "sentiment": "positive", "upside": 155.4, "linked": ["BTBT : Bit Digital, Inc. has secured a new multi-year colocation agreement and has a strong financial position, with analysts predicting a 163.75% increase in its stock price."], "volume": 54561920.0, "introduction": "iQIYI, a Chinese online entertainment service, released its Q4 2024 earnings report, announcing new titles and partnerships, with analysts predicting a potential 10.64% increase in stock price.", "update": "2025-03-12", "current": 2.23, "category": "stock"}, {"company": "Bit Digital Inc", "symbol": "BTBT", "statement": "Bit Digital, Inc. (BTBT) has secured a new multi-year colocation agreement with a leader in AI hardware. The company has a cash position of $91.88 million, with a net cash position of $0.62 per share. Analysts have an average target price of $6.33, predicting a 163.75% increase from the current stock price of $2.40. The company has announced its earnings results, beating analysts' estimates, and will release its Fiscal Year 2024 financial results.", "keywords": ["financial", "leader", "stock", "increase", "earnings", "results", "price", "cash", "analysts", "agreement", "ai", "hardware", "shares", "position", "target"], "sentiment": "positive", "upside": -102.4, "linked": ["IQ : iQIYI, a Chinese online entertainment service, released its Q4 2024 earnings report, announcing new titles and partnerships, with analysts predicting a potential 10.64% increase in stock price."], "volume": 21168000.0, "introduction": "Bit Digital, Inc. has secured a new multi-year colocation agreement and has a strong financial position, with analysts predicting a 163.75% increase in its stock price.", "update": "2025-03-12", "current": 3.69, "category": "stock"}, {"company": "Rocket Lab USA Inc", "symbol": "RKLB", "statement": "Rocket Lab, an end-to-end space company, is expanding its presence in the space market with its affordable and reliable launch services, spacecraft design and manufacturing, and on-orbit management solutions. The company has announced plans to launch its reusable Neutron rocket in the second half of 2025 and will land them at sea, reducing costs and increasing efficiency. With a strong track record of mission success, Rocket Lab has achieved record revenue and is carving out a niche in the rapidly evolving space industry, offering a range of services and solutions to support the space economy.", "keywords": ["industry", "efficiency", "success", "plans", "space", "economy", "management", "reusable", "expansion", "manufacturing", "launch", "design", "company", "solutions", "rocket", "services", "revenue", "market"], "sentiment": "positive", "upside": -106.2, "linked": [], "volume": 23723176.0, "introduction": "Rocket Lab is expanding its presence in the space market with its affordable and reliable launch services, spacecraft design, and on-orbit management solutions, with plans to launch its reusable Neutron rocket in 2025 and land it at sea.", "update": "2025-03-12", "current": 30.36, "category": "stock"}, {"company": "Warner Bros Discovery Inc", "symbol": "WBD", "statement": "Warner Bros. Discovery, a global media and entertainment company, has migrated its technology infrastructure, enabling expanded feature capabilities across its streaming apps. The company's SVP of Global Transformation, Rebecca Kent, discussed the future of streaming and storytelling on a podcast, highlighting personalization, data-driven insights, and global content expansion. Meanwhile, Proficio Capital Partners LLC purchased a new stake in Warner Bros. Discovery, and the company reported a 2.5% year-over-year revenue decline and a $0.20 loss in Q4.", "keywords": ["apps", "personalization", "media", "decline", "content", "technology", "streaming", "capital", "revenue", "partners", "data", "infrastructure", "entertainment", "insights"], "sentiment": "negative", "upside": -323.0, "linked": [], "volume": 20082304.0, "introduction": "Warner Bros. Discovery has migrated its technology infrastructure to expand feature capabilities across its streaming apps, while also reporting a 2.5% year-over-year revenue decline and a $0.20 loss in Q4.", "update": "2025-03-12", "current": 10.25, "category": "stock"}, {"company": "Spirit Airlines Inc", "symbol": "SAVE", "statement": "Spirit Airlines has emerged from financial restructuring, clearing $795 million in debt and securing $350 million in new investment. The airline has expanded its fleet and route network, adding 28 new routes and cutting five others. Despite this, Spirit's financial results for 2024 were bleak, with revenue down 8.38% and a decrease of 11.49% in the fourth quarter. The airline has implemented cost-cutting measures and explored new revenue streams, but its stock price has fluctuated due to various factors, including a recent rejection of a merger offer from Frontier.", "keywords": ["merger", "debt", "investment", "restructuring", "expansion", "financials", "revenue", "routes"], "sentiment": "negative", "upside": -2961.0, "linked": [], "volume": 25024648.0, "introduction": "Spirit Airlines has emerged from financial restructuring, expanded its fleet and routes, but its financial results for 2024 showed a decline in revenue and profits due to various factors.", "update": "2025-03-12", "current": 1.08, "category": "stock"}, {"company": "Hims & Hers Health Inc", "symbol": "HIMS", "statement": "Hims & Hers Health, a telehealth platform, provides personalized care for individuals seeking to achieve happiness and health. The company's stock price has fluctuated in recent days, with some analysts maintaining a \"sell\" rating due to concerns over its weight loss business. Despite this, the company's revenue grew 69% year-over-year to $1.5 billion, driven by a 45% increase in prescriptions. Hims & Hers is shutting down its dermatology business, Apostrophe, to centralize its teledermatology offerings. The company's stock price has declined over 20% in the past month, but some analysts believe it is reasonably valued and could be a cautious buy due to its high-growth potential.", "keywords": ["rating", "growth", "telehealth", "prescriptions", "shutdown", "sell", "happiness", "concerns", "revenue", "health", "weight", "stock", "personalized", "loss", "teledermatology", "analysts", "valuation", "buy", "dermatology"], "sentiment": "negative", "upside": -92.5, "linked": [], "volume": 8918405.0, "introduction": "Hims & Hers Health, a telehealth platform, saw a 69% year-over-year revenue growth to $1.5 billion, despite concerns over its weight loss business and a 20% stock price decline in the past month.", "update": "2025-03-12", "current": 30.87, "category": "stock"}, {"company": "Bank of America Corp", "symbol": "BAC", "statement": "Bank of America was the official headphone partner of the 2024 Boston Marathon, and the event generated $509 million in economic activity. The bank was also mentioned in various articles, including one highlighting two tech stocks that could be prime candidates for a stock split in 2025. Additionally, Bank of America was analyzed as a potential stock with growth potential due to its ability to offer a full suite of financial services to corporate clients. The bank's stock was also evaluated by Danelfin AI, which gave it a sell rating, and was mentioned in various news articles and financial reports.", "keywords": ["activity", "financial", "clients", "bank", "split", "growth", "america", "stocks", "rating", "news", "reports", "potential", "marathon", "services", "economic", "tech", "corporate"], "sentiment": "positive", "upside": -56.4, "linked": [], "volume": 23546200.0, "introduction": "Bank of America was the official headphone partner of the 2024 Boston Marathon, generated $509 million in economic activity, and was analyzed as a potential stock with growth potential due to its corporate client services.", "update": "2025-03-12", "current": 46.52, "category": "stock"}, {"company": "IONQ Inc", "symbol": "IONQ", "statement": "IonQ, a quantum computing and networking company, has expanded its patent portfolio and announced new partnerships and funding. The company's current generation quantum computers, IonQ Forte and IonQ Forte Enterprise, boast 36 algorithmic qubits and are used for a variety of applications, including secure quantum networking and complex problem-solving. IonQ has received recognition for its innovation and growth, including being named to Newsweek's Excellence Index 1000 and Forbes' Most Successful Mid-Cap Companies list. The company has also raised over $372 million in funding and has a strong pipeline of projects, including a new partnership with the United States Air Force Research Lab.", "keywords": ["growth", "networking", "index", "patent", "forbes", "companies", "pipeline", "research", "qubits", "algorithmic", "excellence", "innovation", "mid-cap", "computing", "funding", "secure", "quantum", "projects", "portfolio", "partnerships", "partnership"], "sentiment": "positive", "upside": -109.7, "linked": ["QUBT : Quantum Computing Inc. and IonQ, Inc. are leading the way in the quantum computing industry, developing and commercializing quantum computing solutions with significant breakthroughs and patent portfolios, alongside other notable players like Quantinuum, IBM, and IonQ."], "volume": 19528488.0, "introduction": "IonQ, a quantum computing and networking company, has expanded its patent portfolio, announced new partnerships, and secured funding to develop its 36-qubit quantum computers for applications like secure networking and complex problem-solving.", "update": "2025-03-12", "current": 40.76, "category": "stock"}, {"company": "Energy Transfer LP", "symbol": "ET", "statement": "Energy Transfer LP is a diversified energy company with over 130,000 miles of pipeline and associated infrastructure in the US. The company has reported record-setting adjusted EBITDA of $15.5 billion for the full year 2024, and has announced plans to invest $5 billion in capital expenditures and $1.1 billion in growth initiatives. Energy Transfer has a diverse set of growth opportunities, including refined products, crude oil, liquefied natural gas, and midstream pipelines. The company has also entered into a 20-year LNG sale and purchase agreement with Chevron to supply 2.0 million tonnes of LNG per annum.", "keywords": ["expenditures", "transfer", "energy", "growth", "oil", "refined", "lng", "products", "chevron", "capital", "opportunities", "agreements", "midstream", "infrastructure", "crude", "ebitda", "pipeline"], "sentiment": "positive", "upside": 75.7, "linked": [], "volume": 20415448.0, "introduction": "Energy Transfer LP is a diversified energy company with a large pipeline network and infrastructure in the US, reporting record-breaking adjusted EBITDA and planning significant investments in growth initiatives and capital expenditures.", "update": "2025-03-12", "current": 21.05, "category": "stock"}, {"company": "Terawulf Inc", "symbol": "WULF", "statement": "TeraWulf Inc.'s (WULF) stock has seen a recent decline of 11.95% due to regulatory concerns and operational challenges in the crypto mining sector. Despite this, some investors are buying in, with CoreCap Advisors LLC increasing its holdings by 67.9% in the 4th quarter. Analysts forecast a 121.39% increase in the stock price to $7.97, with a low estimate of $3.50 and a high estimate of $11. The company operates digital asset technology and provides miner hosting services in the US, with institutional investors owning 62.49% of the stock.", "keywords": ["forecast", "company", "concerns", "services", "hosting", "challenges", "investors", "increase", "institutional", "regulatory", "price", "crypto", "stock", "operational", "estimate", "decline", "buying", "analysts", "mining", "technology"], "sentiment": "positive", "upside": -111.1, "linked": ["EYEN : Eyenovia, a specialty biopharmaceutical company, is developing topical eye treatments using its proprietary delivery and formulation platform, with a debt restructuring and strategic alternatives on the horizon to improve its cash runway and boost its stock price."], "volume": 56193060.0, "introduction": "TeraWulf Inc.'s stock has declined 11.95% due to regulatory concerns and operational challenges, but some investors are buying in, with analysts forecasting a 121.39% increase in the stock price to $7.97.", "update": "2025-03-12", "current": 6.32, "category": "stock"}, {"company": "Lyft Inc", "symbol": "LYFT", "statement": "Lyft is launching a feature dedicated to elderly passengers later this year to gain an edge over its main competitor Uber. The ride-sharing company reported earnings that missed analysts' estimates, but its net margin and return on equity are decent. Lyft's CEO discussed its progress and strategic vision at a recent conference. The company is investing in technology and innovation to recover from pandemic-related challenges. Lyft's stock price has been stable, with a price target increased to $14.89. The company operates a peer-to-peer marketplace for on-demand ridesharing and offers various transportation options, including concierge and subscription plans.", "keywords": ["stable", "progress", "earnings", "innovation", "marketplace", "target", "margin", "technology", "transportation", "pandemic", "challenges", "competitor", "equity", "vision"], "sentiment": "positive", "upside": -105.7, "linked": [], "volume": 9037381.0, "introduction": "Lyft is launching a feature for elderly passengers to gain an edge over Uber and is investing in technology and innovation to recover from pandemic-related challenges.", "update": "2025-03-12", "current": 13.8, "category": "stock"}, {"company": "American Airlines Group Inc", "symbol": "AAL", "statement": "American Airlines is a major airline in the United States, headquartered in Fort Worth, Texas, and operates an extensive international and domestic network. The airline is exploring new technologies, such as AI-powered voice assistance through Amazon's Alexa+, and is working to improve safety through upgrades to air traffic control systems. The company's stock price has been fluctuating, with some analysts predicting a decline. American Airlines is also exploring new products and strategies, and is facing legal and regulatory challenges.", "keywords": ["safety", "domestic", "challenges", "international", "texas", "price", "major", "airline", "united", "technologies", "stock", "states", "products", "strategies", "headquarters", "traffic", "control", "decline", "alexa", "network", "ai", "upgrades"], "sentiment": "neutral", "upside": -39.0, "linked": [], "volume": 37547656.0, "introduction": "American Airlines, headquartered in Fort Worth, Texas, is a major US airline operating an international and domestic network, exploring new technologies and strategies while facing fluctuating stock prices and legal/regulatory challenges.", "update": "2025-03-12", "current": 16.96, "category": "stock"}, {"company": "SRIVARU Holding Ltd", "symbol": "SVMH", "statement": "SRIVARU Holding Limited (SVUHF) is an electric vehicle manufacturer in India, offering electric two-wheeled vehicles and related products and services under the Prana brand. The company has a net cash position of -116,652 and is listed on the OTC Markets. SRIVARU Holding Limited has announced the resignation of Lata Gullapalli, and there have been discussions of reorganization, mergers, and acquisitions. The company has a strong institutional ownership and has reported revenue and earnings.", "keywords": ["electric", "otc", "institutional", "earnings", "mergers", "india", "prana", "cash", "markets", "acquisitions", "vehicle", "ownership", "resignation", "revenue", "manufacturer", "reorganization", "position", "brand"], "sentiment": "negative", "upside": -447.4, "linked": [], "volume": 122944570.0, "introduction": "SRIVARU Holding Limited, an Indian electric vehicle manufacturer, has a net cash position of -116,652 and is listed on the OTC Markets, with discussions of reorganization, mergers, and acquisitions.", "update": "2025-03-12", "current": 0.03, "category": "stock"}, {"company": "Tonix Pharmaceuticals Holding Corp", "symbol": "TNXP", "statement": "Tonix Pharmaceuticals Holding Corp., a fully-integrated biopharmaceutical company, has been awarded a grant from the Medical CBRN Defense Consortium (MCDC) to support the development of TNX-801. The company is focused on transforming therapies for pain management and vaccines for public health challenges. Tonix has a pipeline of development candidates and marketed products, and is working to submit a New Drug Application (NDA) to the FDA for TNX-102 SL, a candidate for chronic pain management. The company has also announced positive Phase 3 trial results for its TNX-801 vaccine, which is being developed to combat infectious diseases.", "keywords": ["public", "nda", "biopharmaceutical", "therapies", "management", "vaccines", "fda", "grant", "products", "pain", "vaccine", "diseases", "development", "health", "infectious", "pipeline"], "sentiment": "positive", "upside": -1044.5, "linked": [], "volume": 179498200.0, "introduction": "Tonix Pharmaceuticals has received a grant from the Medical CBRN Defense Consortium to support the development of TNX-801, a vaccine candidate for infectious diseases, as part of its pipeline of development candidates and marketed products.", "update": "2025-03-12", "current": 0.38, "category": "stock"}, {"company": "Akoustis Technologies Inc", "symbol": "AKTS", "statement": "Akoustis Technologies Inc. is a company that develops and manufactures RF filter solutions for the wireless industry. The company filed for Chapter 11 bankruptcy in December 2024 and has seen a decline in its stock price. In its latest earnings report, the company missed analysts' estimates, reporting a loss of ($0.14) per share. Despite this, the company has completed the acquisition of assets from the Research Foundation for the State University of York, expanding its product offerings. Akoustis Technologies' revenue increased 0.97% in 2024 compared to the previous year, but losses increased 164.3% to $167.95 million.", "keywords": ["losses", "industry", "stock", "loss", "earnings", "bankruptcy", "decline", "filter", "technology", "wireless", "solutions", "products", "acquisition", "revenue"], "sentiment": "negative", "upside": -13510.6, "linked": [], "volume": 93547736.0, "introduction": "Akoustis Technologies Inc., a company that develops RF filter solutions for the wireless industry, filed for Chapter 11 bankruptcy and missed analysts' estimates, but has completed an acquisition and reported a 0.97% revenue increase in 2024.", "update": "2025-03-12", "current": 0.04, "category": "stock"}, {"company": "Tilray Inc", "symbol": "TLRY", "statement": "Tilray, a global lifestyle and consumer packaged goods company, has launched Tilray Craft, a high-THC, terpene-rich cannabis product in Germany. The company has also expanded its non-alcoholic craft beer brand, Runner's High, to 4,500 new retail locations, including major chains. Tilray's mission is to be a leading premium lifestyle company with a house of brands and innovative products that inspire joy and create memorable experiences. The company operates in over 20 countries, including Canada, the United States, and Germany, and has a portfolio of adult-use brands and products.", "keywords": ["mission", "premium", "innovation", "experiences", "beer", "joy", "lifestyle", "company", "germany", "products", "cannabis", "brand"], "sentiment": "positive", "upside": -220.9, "linked": [], "volume": 36058948.0, "introduction": "Tilray, a global lifestyle and consumer packaged goods company, has launched a new cannabis product in Germany and expanded its craft beer brand to 4,500 new retail locations.", "update": "2025-03-12", "current": 1.14, "category": "stock"}, {"company": "Wells Fargo & Co", "symbol": "WFC", "statement": "Wells Fargo has sued JPMorgan Chase over a $481 million commercial real estate loan that was allegedly based on a fraudulently inflated financial metric. The loan was issued in 2019 for the Chetrit Group's purchase of 43 multifamily properties across 10 states. Wells Fargo is seeking to recover losses for investors in the loan. The lawsuit claims JPMorgan failed to conduct due diligence on the loan, which has resulted in significant losses for investors.", "keywords": ["financial", "losses", "real estate", "due diligence", "lawsuit", "metric", "loan", "fraud", "recovery", "investors"], "sentiment": "negative", "upside": 90.6, "linked": [], "volume": 9700210.0, "introduction": "Wells Fargo is suing JPMorgan Chase for $481 million over a commercial real estate loan that was allegedly based on fraudulent financial metrics, seeking to recover losses for investors.", "update": "2025-03-12", "current": 77.32, "category": "stock"}, {"company": "Broadcom Inc", "symbol": "AVGO", "statement": "Broadcom reported a record $14.9 billion in sales in Q1 2025, driven by strong demand for AI semiconductor solutions and infrastructure software, with revenue growing 25% year-over-year. The company's CEO highlighted its booming AI sales and hyperscale cloud customers, and the potential impact of tariffs. Broadcom's AI advancements are challenging Nvidia's dominance in the market, and its innovations promise to push the boundaries of computational power and energy efficiency. The company's stock rallied after the earnings report, and its strong guidance and ongoing AI demand signaled a bright future.", "keywords": ["growth", "demand", "tariffs", "record", "dominance", "semiconductor", "innovations", "revenue", "note:i'veextractedthemostsignificantandrelevantwordsthatcapturetheessenceofthesentence.letmeknowifyou'dlikemetohelpwithanythingelse", "sales", "ceo", "power", "software", "future", "infrastructure", "efficiency", "guidance", "ai", "cloud"], "sentiment": "positive", "upside": -87.2, "linked": ["HPE : Hewlett Packard Enterprise (HPE) has experienced mixed results, with its stock fluctuating due to innovation enhancements and cost-cutting measures, including layoffs, but also driving 17% revenue growth in AI and hybrid cloud demand."], "volume": 24935682.0, "introduction": "Broadcom reported a record $14.9 billion in sales in Q1 2025, driven by strong demand for AI semiconductor solutions and infrastructure software, challenging Nvidia's dominance in the market.", "update": "2025-03-12", "current": 244.7, "category": "stock"}, {"company": "Amcor PLC", "symbol": "AMCR", "statement": "Amcor, a global leader in developing and producing responsible packaging solutions, has been honored with two Silver Flexible Packaging Achievement Awards for sustainability. The company's Moda Vacuum Packaging solution, a streamlined tubular rollstock and on-demand bag-making system for fresh meat processors, was recognized. Amcor has also received US antitrust clearance for its combination with Berry Global. The company operates in two segments, Flexibles and Rigid Packaging, and offers solutions for food, beverage, pharmaceutical, medical, home and personal-care products.", "keywords": ["rigid", "personal", "medical", "clearance", "packaging", "processors", "awards", "pharmaceutical", "flexible", "beverage", "solutions", "vacuum", "meat", "sustainability", "food", "antitrust"], "sentiment": "positive", "upside": -11.3, "linked": [], "volume": 13238311.0, "introduction": "Amcor, a global packaging solutions provider, received two Silver Flexible Packaging Achievement Awards for sustainability and received US antitrust clearance for its combination with Berry Global.", "update": "2025-03-12", "current": 9.76, "category": "stock"}, {"company": "Alphabet Inc", "symbol": "GOOGL", "statement": "Larry Page, co-founder of Alphabet Inc. and Google, is reportedly working on a new AI-powered startup called Dynatomics, which aims to generate optimized designs and manufacture them in factories. The startup is part of Page's efforts to explore new areas of innovation and growth for Alphabet. Meanwhile, Alphabet's parent company, Google, is investing in artificial intelligence and cloud computing, with its AI-powered search engine and cloud services driving growth and revenue. The company's stock has the potential to surge by 100% or more, driven by its growing cloud and AI businesses.", "keywords": ["growth", "stock", "computing", "surge", "innovation", "investment", "search", "google", "alphabet", "manufacturing", "design", "factory", "engine", "optimization", "ai", "revenue", "cloud", "startup"], "sentiment": "positive", "upside": -7.9, "linked": [], "volume": 23753208.0, "introduction": "Larry Page, co-founder of Alphabet Inc. and Google, is working on a new AI-powered startup called Dynatomics, which aims to generate optimized designs and manufacture them in factories, as part of his efforts to explore new areas of innovation and growth for Alphabet.", "update": "2025-03-12", "current": 200.21, "category": "stock"}, {"company": "Reinvent Technology Partners", "symbol": "JOBY", "statement": "Reinvent Technology Partners (RTP) is a blank check company focused on effecting a merger or acquisition with a technology company. The company has institutional ownership of 44.4% and insider ownership of 0.2%. The text also mentions several other technology-related news and trends, including a potential IBM acquisition, emerging technology consulting services, and the impact of AI on businesses. Additionally, there are mentions of edge computing companies, AI-powered business transformation, and smart city solutions.", "keywords": ["merger", "institutional", "computing", "business", "transformation", "consulting", "city", "edge", "ownership", "technology", "solutions", "acquisition", "ai", "partnership", "ibm", "insider"], "sentiment": "positive", "upside": -135.6, "linked": ["DJT : Digital World Acquisition Corp. was acquired by Trump Media & Technology Group Corp. in a reverse merger in March 2024, with no significant operations."], "volume": 12457808.0, "introduction": "Reinvent Technology Partners is a blank check company focused on merging or acquiring a technology company, with institutional and insider ownership, amidst a backdrop of technology trends and news.", "update": "2025-03-12", "current": 8.76, "category": "stock"}, {"company": "Canaan Inc", "symbol": "CAN", "statement": "Canaan Inc. (CAN) is a company that specializes in creating advanced technology for bitcoin mining. The company has introduced Modular Solutions (MS), a system that propels its mission of creating clean energy. Analysts have a positive outlook on the company, with a consensus rating score of 2.75 and a price target of $4.33, predicting a 240.94% increase from the current stock price of $1.27. Canaan has a net cash position of $0.14 per share and is expected to meet with Rosenblatt for a group luncheon.", "keywords": ["energy", "rating", "luncheon", "increase", "bitcoin", "technology", "mining", "analysts", "outlook", "cash", "clean", "position", "target"], "sentiment": "positive", "upside": -146.8, "linked": [], "volume": 16907152.0, "introduction": "Canaan Inc., a company specializing in bitcoin mining technology, has a positive outlook with a 240.94% predicted increase in stock price and a net cash position of $0.14 per share.", "update": "2025-03-12", "current": 2.09, "category": "stock"}, {"company": "CNH Industrial NV", "symbol": "CNH", "statement": "CNH Industrial N.V. has seen a recent surge in its stock price, driven by its advancements in agricultural technology and commitment to innovation, sustainability, and customer satisfaction. The company's Case and New Holland brands are showcasing their sustainable solutions at the Expodireto 2025 event, and its financial services segment offers retail note and lease financing for agricultural and construction equipment. Analysts are divided on the company's prospects, with some seeing a balanced risk-reward scenario and others noting a recent profit miss and forecast cut. Despite this, CNH Industrial is a leading dividend payer and has a strong brand presence in the agriculture sector, with a significant presence in North America.", "keywords": ["forecast", "miss", "agriculture", "scenario", "construction", "equipment", "leader", "america", "innovation", "financing", "agricultural", "north", "profit", "risk", "sustainability", "customer", "satisfaction", "presence", "reward", "technology", "analysts", "dividend", "brand"], "sentiment": "positive", "upside": 160.9, "linked": [], "volume": 17033364.0, "introduction": "CNH Industrial's stock price has surged due to its advancements in agricultural technology, sustainability, and customer satisfaction, with its brands showcasing eco-friendly solutions and offering financing options, despite analysts' mixed views on its prospects.", "update": "2025-03-12", "current": 12.96, "category": "stock"}, {"company": "Microsoft Corp", "symbol": "MSFT", "statement": "Microsoft is transforming businesses with AI, launching a Copilot business transformation practice with Accenture and Avanade, and investing in new capabilities and training to help organizations reinvent their business functions with generative and agentic AI. Microsoft's in-house AI models are rivaling those of OpenAI, and the company is expanding its cloud and AI infrastructure in South Africa with a $297 million investment. Additionally, 85% of Fortune 500 companies use Microsoft AI solutions, and the company is recognized as a leader in Forrester's public cloud platforms report.", "keywords": ["industry", "cloud", "artificial", "business", "transformation", "innovation", "intelligence", "investment", "training", "organization", "agentic", "leadership", "generative", "technology", "reinvention", "report", "practice", "infrastructure"], "sentiment": "positive", "upside": -50.0, "linked": ["BURU : NUBURU, a leader in high-power industrial blue laser technology, has acquired a 20% stake in a defense-tech company for $24.5 million to expand into the defense sector and drive growth."], "volume": 14658498.0, "introduction": "Microsoft is transforming businesses with AI, investing in new capabilities and training to help organizations reinvent their functions with generative and agentic AI, and expanding its cloud and AI infrastructure in South Africa with a $297 million investment.", "update": "2025-03-12", "current": 444.06, "category": "stock"}, {"company": "Micron Technology Inc", "symbol": "MU", "statement": "Micron Technology Inc.'s stock is experiencing a surge in positivity after a successful lawsuit outcome and advancements in memory chip technology. The company's stock has risen 6.76% on Wednesday, driven by a rebound in technology stocks following softer-than-expected Consumer Price Index data. Analysts are optimistic about Micron's future growth and profitability, with 32 analysts submitting estimates for revenue or earnings. The company's recent launch of its Ultra-Fast Clock Driver Ddr5 memory portfolio and strategic collaborations are expected to propel its growth in the AI and compute-intensive applications market.", "keywords": ["growth", "stock", "surge", "profitability", "applications", "positivity", "advancements", "lawsuit", "technology", "launch", "collaborations", "data", "optimistic", "rebound"], "sentiment": "positive", "upside": -62.8, "linked": [], "volume": 19387106.0, "introduction": "Micron Technology Inc.'s stock surged 6.76% after a successful lawsuit outcome and advancements in memory chip technology, with analysts optimistic about its future growth and profitability.", "update": "2025-03-12", "current": 103.19, "category": "stock"}, {"company": "AES Corp", "symbol": "AES", "statement": "AES Corporation is a company that owns and/or operates a generation portfolio of approximately 34,596 megawatts and distributes power to 2.6 million customers. The company has a cash equivalent of $2.04 billion and a long-term and current debt levels. AES has a presence in the LNG space and is expanding its renewable energy capabilities. The company has a strong financial position and is committed to sustainability.", "keywords": ["customers", "financial", "energy", "debt", "megawatts", "cash", "power", "lng", "company", "renewable", "portfolio", "sustainability", "position"], "sentiment": "positive", "upside": -37.9, "linked": [], "volume": 12133432.0, "introduction": "AES Corporation is a power generation and distribution company with a portfolio of 34,596 megawatts, serving 2.6 million customers, and has a strong financial position with $2.04 billion in cash and a commitment to sustainability.", "update": "2025-03-12", "current": 11.6, "category": "stock"}, {"company": "Hewlett Packard Enterprise Co", "symbol": "HPE", "statement": "Hewlett Packard Enterprise (HPE) has been experiencing mixed results, with its stock shares fluctuating due to its innovation engine delivering enhancements to its portfolio, including HPE Alletra Storage, HPE ProLiant Compute Gen12 servers, and standalone HPE VM Essentials Software. However, the company is also implementing cost-cutting measures, including laying off 2,500 employees, and its revenue growth is being impacted by tariff issues and margin challenges. Despite this, HPE's AI and hybrid cloud demand is driving a 17% revenue increase, and the company is expected to achieve $350 million in savings by 2027.", "keywords": ["cost", "growth", "tariff", "demand", "margin", "cutting", "hewlett", "server", "revenue", "storage", "enterprise", "innovation", "packard", "software", "savings", "layoff", "challenge", "enhancement", "compute", "ai", "cloud"], "sentiment": "negative", "upside": 101.1, "linked": ["AVGO : Broadcom reported a record $14.9 billion in sales in Q1 2025, driven by strong demand for AI semiconductor solutions and infrastructure software, challenging Nvidia's dominance in the market."], "volume": 9457922.0, "introduction": "Hewlett Packard Enterprise (HPE) has experienced mixed results, with its stock fluctuating due to innovation enhancements and cost-cutting measures, including layoffs, but also driving 17% revenue growth in AI and hybrid cloud demand.", "update": "2025-03-12", "current": 24.37, "category": "stock"}, {"company": "Crown Electrokinetics Corp.", "symbol": "CRKN", "statement": "Crown Electrokinetics Corp. (CRKN) has received a delisting determination from the NASDAQ and plans to request reconsideration. The company's CEO and Chairman, Doug Croxall, sent a letter to shareholders explaining the situation. The company provides innovative technology infrastructure solutions that benefit communities and the environment. The stock has been fluctuating and is currently down 37.36% over the past 10 days, with a wide and falling short-term trend.", "keywords": ["delisting", "reconsideration", "crown", "stock", "trend", "corp", "ceo", "technology", "solutions", "nasdaq", "communities", "environment", "infrastructure", "chairman", "electrokinetics"], "sentiment": "negative", "upside": -721.2, "linked": [], "volume": 36875400.0, "introduction": "Crown Electrokinetics Corp. (CRKN) has received a delisting notice from NASDAQ and plans to request reconsideration, with its CEO sending a letter to shareholders and the stock experiencing a 37.36% decline over the past 10 days.", "update": "2025-03-12", "current": 0.1, "category": "stock"}, {"company": "Nuscale Power Corp", "symbol": "SMR", "statement": "NuScale Power, a company specializing in small modular reactor technology, has seen its stock rise 11.55% after securing key investment agreements with international partners. Despite canceling its plan to build six nuclear reactors in Idaho in 2023 due to cost overruns and laying off 40% of its employees, analysts have upgraded their revenue estimates, predicting a significant improvement in business fundamentals. The company's stock has been trading down 9.2% in recent days, but analysts remain bullish on its growth prospects, with a consensus rating score of 2.50 and a FY2025 EPS estimate of ($0.41) per share.", "keywords": ["cost", "rating", "growth", "reactors", "bullish", "modular", "small", "trading", "estimates", "revenue", "stock", "investment", "reactor", "business", "fundamentals", "nuclear", "eps", "prospects", "idaho", "score", "estimate", "consensus", "employees", "technology", "analysts", "overruns", "partners"], "sentiment": "positive", "upside": -105.6, "linked": ["NU : Nu Holdings, a digital banking platform in Latin America, is experiencing a stock drawdown but still growing revenue quickly, with analysts optimistic about its growth prospects and strong future."], "volume": 14332117.0, "introduction": "NuScale Power's stock has risen 11.55% after securing key investment agreements and despite canceling a project and layoffs, analysts predict significant improvement in business fundamentals.", "update": "2025-03-12", "current": 27.97, "category": "stock"}, {"company": "Comcast Corp", "symbol": "CMCSA", "statement": "Comcast Business is a technology solutions provider that powers modern businesses, serving 17 of the top 20 quick-service restaurant chains, six of the top ten largest US banks, and hundreds of Fortune 500 companies. The company has launched a new multichannel brand campaign, \"Powering the Engine of Modern Business,\" highlighting its comprehensive portfolio of advanced technology solutions. Comcast Business is a subsidiary of Comcast Corporation, a global media and technology company, and is seeking talented professionals to join its award-winning team. With a strong focus on innovation and customer satisfaction, Comcast Business is committed to helping businesses succeed and grow.", "keywords": ["satisfaction", "quick-service", "modern", "business", "campaign", "provider", "innovation", "fortune", "banks", "brand", "technology", "solutions", "restaurant", "customer", "engine", "multichannel", "500", "companies"], "sentiment": "positive", "upside": 154.8, "linked": [], "volume": 17791812.0, "introduction": "Comcast Business is a technology solutions provider that powers modern businesses, serving major companies and launching a new brand campaign to highlight its advanced technology solutions.", "update": "2025-03-12", "current": 37.62, "category": "stock"}, {"company": "Conduit Pharmaceuticals Inc", "symbol": "CDT", "statement": "Conduit Pharmaceuticals Inc. (CDT) is a clinical-stage specialty biopharmaceutical company that develops products for autoimmune diseases and idiopathic male infertility. Its pipeline includes AZD1656, which has completed Phase I trials for treating type 2 diabetes and renal transplant rejection. The company has a flat revenue and reduced net loss year-over-year. The company's management team is considered stellar, and it has a new business model. Conduit Pharmaceuticals is listed on the Nasdaq stock market and has received updates on its stock market hearing panel.", "keywords": ["nasdaq", "stock", "biopharmaceutical", "loss", "diabetes", "management", "idiopathic", "autoimmune", "infertility", "revenue", "transplant", "renal", "pipeline"], "sentiment": "positive", "upside": -1079.2, "linked": [], "volume": 24817972.0, "introduction": "Conduit Pharmaceuticals Inc. is a clinical-stage biopharmaceutical company developing products for autoimmune diseases and male infertility, with a pipeline including AZD1656, which has completed Phase I trials for type 2 diabetes and renal transplant rejection.", "update": "2025-03-12", "current": 0.05, "category": "stock"}, {"company": "Robinhood Markets Inc", "symbol": "HOOD", "statement": "Robinhood Markets, Inc. (HOOD) is a publicly traded company that operates a popular online trading platform. Jim Cramer, a well-known stock analyst, has discussed the company's growth and maturity. Analysts' opinions are mixed, with a 12-month price target of $61.94, a high estimate of $90.00, and a low estimate of $38.00. The company has paid $29.75 million to resolve regulatory probes and has reported strong earnings growth, with a trailing EPS of $1.57 and a P/E Ratio of 28.29. The stock has outperformed the market in the last year, but has underperformed in the most recent two weeks.", "keywords": ["growth", "estimate", "eps", "stock", "maturity", "platform", "probe", "earnings", "trading", "ratio", "analyst", "market", "target"], "sentiment": "positive", "upside": -94.2, "linked": [], "volume": 19477248.0, "introduction": "Robinhood Markets, Inc. (HOOD) is a publicly traded online trading platform with mixed analyst opinions and a stock price that has outperformed the market in the long term but underperformed in recent weeks.", "update": "2025-03-12", "current": 51.12, "category": "stock"}, {"company": "Walmart Inc", "symbol": "WMT", "statement": "Walmart, with over 10,500 stores in 19 countries, uses a strategic blend of innovation and adaptability to stay ahead of the competition. The company has adopted cutting-edge technologies such as automated checkout systems and real-time inventory management to streamline operations and reduce costs. Walmart's use of AI in its warehouses improves operational efficiency, reduces costs, and speeds up order fulfillment. The company has also partnered with Fiserv for instant bank payments, enhancing customer satisfaction and reducing transaction costs. Additionally, Walmart uses digital twin technology to optimize operations and energy consumption. These innovations have helped Walmart maintain its competitive edge, despite being a dinosaur in the online-shopping era just a decade ago.", "keywords": ["cost", "satisfaction", "efficiency", "energy", "consumption", "operations", "innovation", "reduction", "technology", "adaptability", "digital", "optimization", "ai", "partnership", "transaction", "twin", "automation"], "sentiment": "positive", "upside": -35.4, "linked": [], "volume": 14855248.0, "introduction": "Walmart uses a combination of innovative technologies, such as automated checkout systems, AI-powered warehouse management, and digital twin technology, to stay competitive and reduce costs while maintaining customer satisfaction.", "update": "2025-03-12", "current": 94.76, "category": "stock"}, {"company": "Walgreens Boots Alliance Inc", "symbol": "WBA", "statement": "Walgreens Boots Alliance, the parent company of the Boots pharmacy chain, has agreed to be acquired by private equity firm Sycamore Partners in a deal worth $10 billion. The deal, which includes $18 billion in debt, will take the company private and is one of the largest healthcare buyouts since the global financial crisis. The acquisition is expected to address the company's struggles and improve its financial performance. The deal values Walgreens Boots Alliance at $23.7 billion, with shareholders receiving $11.45 per share in cash and one non-transferable right. The acquisition is expected to be completed in the coming months.", "keywords": ["financial", "shareholders", "months", "cash", "pharmacy", "private", "deal", "acquisition", "crisis", "equity", "healthcare", "performance"], "sentiment": "positive", "upside": -1597.2, "linked": [], "volume": 12702696.0, "introduction": "Walgreens Boots Alliance, the parent company of Boots pharmacy chain, is being acquired by private equity firm Sycamore Partners in a $10 billion deal, valuing the company at $23.7 billion and taking it private.", "update": "2025-03-12", "current": 11.87, "category": "stock"}, {"company": "Microvast Holdings Inc", "symbol": "MVST", "statement": "Microvast Holdings Inc (MVST) is a technology innovator that designs, develops, and manufactures lithium-ion battery solutions for electric vehicles and energy storage. The company has reported a revenue increase in Q3 2024, reaching $101.4 million, driven by a 212% growth in the EMEA region. MVST provides a range of cell chemistries, including lithium titanate oxide, lithium iron phosphate, and nickel manganese cobalt version 1 and 2. The company has been expanding its operations in China, the rest of the Asia Pacific, Europe, and the United States.", "keywords": ["electric", "lithium", "energy", "growth", "china", "europe", "united", "chemistries", "innovator", "cell", "states", "technology", "asia", "vehicles", "pacific", "revenue", "battery", "storage"], "sentiment": "positive", "upside": -181.1, "linked": [], "volume": 14145979.0, "introduction": "Microvast Holdings Inc, a lithium-ion battery solutions provider for electric vehicles and energy storage, reported a 212% revenue growth in Q3 2024, driven by growth in the EMEA region, and expanded its operations globally.", "update": "2025-03-12", "current": 2.18, "category": "stock"}, {"company": "Snap Inc", "symbol": "SNAP", "statement": "Snapchat has introduced new AI-powered video lenses, exclusively available to its premium subscription tier, Snapchat Platinum. The lenses are powered by Snap's in-house generative video model and bring cutting-edge AI tools to users. The new lenses are part of Snapchat's continued focus on augmented reality (AR) technology and immersive experiences. The company's CEO, Evan Spiegel, has been driving the expansion of AR capabilities. SnapLogic, a company acquired by Snap, is also highlighting its leadership in AI-led integration and new products.", "keywords": ["ar", "model", "integration", "platinum", "video", "experiences", "immersive", "spiegel", "tier", "ceo", "products", "lenses", "premium", "generative", "technology", "expansion", "subscription", "ai", "snapchat"], "sentiment": "positive", "upside": -126.1, "linked": [], "volume": 18671880.0, "introduction": "Snapchat has introduced new AI-powered video lenses, exclusively available to its premium subscription tier, Snapchat Platinum, as part of its focus on augmented reality technology and immersive experiences.", "update": "2025-03-12", "current": 10.89, "category": "stock"}, {"company": "Alibaba Group Holding Ltd", "symbol": "BABA", "statement": "Alibaba has launched a new AI chip, XuanTie C930, which is expected to boost China's semiconductor industry and promote open-source chips. The chip is designed for AI acceleration and has the potential to compete with rival DeepSeek's R1. Alibaba's move comes amid US sanctions and tariffs, and the company's stock has shown strong bullish momentum in the year to date. The company has also launched new AI features and partnered with Manus AI to expand its user base. Meanwhile, Chinese tech giants have gained $439 billion in market value, outperforming their American counterparts.", "keywords": ["base", "alibaba", "giants", "manus", "tariffs", "features", "sanctions", "acceleration", "rival", "bullish", "ai", "momentum", "semiconductor", "xuantie", "c930", "industry", "stock", "deepseek", "user", "open-source", "r1", "chip", "market"], "sentiment": "positive", "upside": -54.0, "linked": [], "volume": 18520500.0, "introduction": "Alibaba has launched an AI chip, XuanTie C930, designed for AI acceleration, which aims to boost China's semiconductor industry and compete with rival DeepSeek's R1.", "update": "2025-03-12", "current": 89.14, "category": "stock"}, {"company": "Coca-Cola Co", "symbol": "KO", "statement": "Coca-Cola has been exploring the potential of generative AI and has seen success in its applications. The company has been focusing on its strongest brands, having reduced its portfolio from over 400 to 200 brands. Coca-Cola is investing $100 million in a new sales and distribution center in Pennsylvania and has filed an appeal with the Eleventh Circuit in a transfer pricing case. The company is also targeting the Chinese market, with its CEO expressing optimism about the upcoming Chinese Lunar New Year. Additionally, Coca-Cola is doubling down on its core strengths of soft drinks, sparkling beverages, and juice to fuel long-term growth.", "keywords": ["appeal", "transfer", "softdrinks", "growth", "success", "juice", "investment", "pricing", "chinese", "beverages", "brands", "portfolio", "ai", "optimism", "distribution"], "sentiment": "positive", "upside": -52.0, "linked": [], "volume": 19226488.0, "introduction": "Coca-Cola is investing in generative AI, reducing its brand portfolio, and targeting the Chinese market, while doubling down on its core strengths to fuel long-term growth.", "update": "2025-03-12", "current": 61.92, "category": "stock"}, {"company": "Coinbase Global Inc", "symbol": "COIN", "statement": "Coinbase is experiencing increased government interest in crypto, following a recent executive order calling for the establishment of a strategic bitcoin reserve. The company is prepared to support governments with regulated, secure, and comprehensive solutions. Meanwhile, Coinbase has escaped a lawsuit over its 2021 direct listing and has acquired the Iron Fish team to enhance its blockchain privacy solutions. The company has also registered in India to offer trading services, and its CEO, Brian Armstrong, plans to hire 1,000 more employees in the US in 2025.", "keywords": ["reserve", "executive", "government", "privacy", "employment", "order", "trading", "expansion", "interest", "solutions", "services", "blockchain", "crypto"], "sentiment": "positive", "upside": -47.7, "linked": [], "volume": 9693380.0, "introduction": "Coinbase is preparing to support governments with regulated solutions and expanding its operations, including hiring 1,000 more employees in the US and acquiring the Iron Fish team to enhance blockchain privacy solutions.", "update": "2025-03-12", "current": 298.0, "category": "stock"}, {"company": "Globalstar Inc", "symbol": "GSAT", "statement": "Globalstar Inc. is a company that provides IoT hardware and software products for tracking and monitoring assets, processing smart data, and managing analytics with cloud-based telematics solutions. The company has a market capitalization of $250.35 million and employs 389 people. Globalstar has made a $2 billion pledge to expand its LEO satellite network for direct-to-device and IoT solutions in remote regions. The company is also partnering with XCOM Labs to commercialize capacity-multiplying technology for 5G deployments. Globalstar is planning to move its stock to the Nasdaq and has a stock forecast of 2.67, with analysts rating the company less than other \"computer and technology\" companies.", "keywords": ["iot", "stock", "leo", "telematics", "5g", "satellite", "analytics", "monitoring", "technology", "software", "nasdaq", "hardware", "tracking", "cloud"], "sentiment": "positive", "upside": -103.7, "linked": [], "volume": 9545924.0, "introduction": "Globalstar Inc. is a company that provides IoT solutions for tracking and monitoring assets, with a market capitalization of $250.35 million, and is expanding its LEO satellite network and partnering with XCOM Labs to commercialize 5G technology.", "update": "2025-03-12", "current": 1.98, "category": "stock"}, {"company": "R1 RCM Inc", "symbol": "RCM", "statement": "RCM Technologies, Inc. (RCMT) is a business and technology solutions provider that provides services in various industries, including aerospace, defense, energy, healthcare, and technology. The company reported a GAAP net income of $2.9 million in the fourth quarter and fiscal year 2024. RCM Technologies has a strong institutional ownership and insider ownership, indicating company health. The company provides various solutions, including engineering, specialty healthcare, and information technology services, and operates through three segments: Specialty Health Care, Engineering, and Life Sciences and Information Technology services (LS&IT).", "keywords": ["energy", "life", "defense", "provider", "income", "engineering", "aerospace", "ownership", "technology", "solutions", "services", "information", "healthcare", "sciences"], "sentiment": "positive", "upside": -125.31, "linked": [], "volume": 12802169.0, "introduction": "RCM Technologies, Inc. (RCMT) is a business and technology solutions provider with a strong institutional and insider ownership, reporting a net income of $2.9 million in Q4 and FY 2024, offering services in aerospace, defense, energy, healthcare, and tech.", "update": "2025-03-12", "current": 14.31, "category": "stock"}, {"company": "Uber Technologies Inc", "symbol": "UBER", "statement": "Uber Technologies Inc. (UBER) has made a deal with Toast, a little-known restaurant technology company, which could have implications for its sales and earnings. Uber has several key products and services, including ride-hailing and delivery services, which contributed to its revenue growth. The company has also expanded into new areas, such as freight and other services. Despite facing challenges, Uber has a strong market presence, with a 76% share of the U.S. ride-hailing market and a revenue increase of 20% in Q4 2024. The company is valued at $3.3B and has raised $13.2B in funding from 188 investors.", "keywords": ["inc", "uber", "technologies", "presence", "delivery", "sales", "earnings", "funding", "freight", "toast", "ride", "technology", "hailing", "restaurant", "services", "revenue", "deal", "market"], "sentiment": "positive", "upside": -84.8, "linked": [], "volume": 14244347.0, "introduction": "Uber has partnered with Toast, a restaurant tech company, which could impact its sales and earnings, as it continues to expand its services beyond ride-hailing and delivery.", "update": "2025-03-12", "current": 68.56, "category": "stock"}, {"company": "Transocean Ltd", "symbol": "RIG", "statement": "Transocean Ltd. (RIG) is an international offshore contract drilling services provider, with a fleet of mobile offshore drilling units and a contract drilling business. The company recently announced a $232 million contract with bp in the U.S. Gulf of Mexico, and its stock price has been increasing due to positive outlooks on the energy industry. Transocean's stock has been recognized as a top pick and a value penny stock, with a strong customer base and cutting-edge solutions. The company has a long history, founded in 1926, and operates in the U.S. Gulf of Mexico and other regions, providing drilling services to integrated energy companies, government-owned or government-controlled energy companies, and independent energy companies.", "keywords": ["foundation", "energy", "company", "solutions", "services", "price", "outlook", "contract", "industry", "mexico", "stock", "business", "provider", "fleet", "gulf", "drilling", "offshore", "history", "units"], "sentiment": "positive", "upside": -207.2, "linked": [], "volume": 20076724.0, "introduction": "Transocean Ltd. is an offshore contract drilling services provider with a strong track record, recognized as a top pick and value penny stock, with a recent $232 million contract with bp in the U.S. Gulf of Mexico boosting its stock price.", "update": "2025-03-12", "current": 3.85, "category": "stock"}, {"company": "AGNC Investment Corp", "symbol": "AGNC", "statement": "AGNC Investment Corp, a real estate investment trust, has seen its stock price fluctuate over the past 45 months, reaching an all-time high of $11.74 per share in June 2021. The company recently reported earnings that missed estimates, but its stock has since touched a 52-week high of $26.1. With a net margin of 29.26% and a trailing twelve-month return on equity of 21.92%, AGNC Investment Corp provides private capital to the US housing market through residential mortgage pass-through securities and collateralized mortgage obligations. The company has a dividend yield of 13.2% and has extended its equity buyback plan until December 2026.", "keywords": ["securities", "stock", "return", "investment", "earnings", "real", "price", "margin", "mortgage", "estimates", "equity", "fluctuate", "dividend", "buyback", "collateralized", "yield", "high", "estate"], "sentiment": "positive", "upside": 236.2, "linked": ["HST : Host Hotels & Resorts, Inc. is a luxury hotel REIT with 77 hotels and a dividend yield of 5.06%, listed on Nasdaq and part of the S&P 500, with a projected 30% stock price increase within the next 12 months."], "volume": 15968187.0, "introduction": "AGNC Investment Corp, a real estate investment trust, has seen its stock price fluctuate, but has recently reached a 52-week high of $26.1, with a strong dividend yield and extended equity buyback plan.", "update": "2025-03-12", "current": 9.68, "category": "stock"}, {"company": "Eyenovia Inc", "symbol": "EYEN", "statement": "Eyenovia, Inc. (NASDAQ:EYEN) is a specialty biopharmaceutical company developing topical eye treatments using its proprietary delivery and formulation platform. The company recently announced debt restructuring, which is expected to improve its cash runway and allow for evaluation of strategic alternatives. Eyenovia's pipeline is focused on next-generation topical eye treatments. The company's stock price has been fluctuating, with a current price of $1.60 and a 12-month price forecast of $2.00, predicting a 25.79% increase. Despite regulatory hurdles and challenges, Eyenovia is working to bring new products to market, including its proprietary delivery and formulation platform.", "keywords": ["forecast", "biopharmaceutical", "delivery", "company", "pipeline", "increase", "regulatory", "runway", "price", "cash", "formulation", "alternatives", "stock", "hurdles", "restructuring", "platform", "specialty", "products", "debt", "treatments", "eye"], "sentiment": "positive", "upside": -3072.9, "linked": ["WULF : TeraWulf Inc.'s stock has declined 11.95% due to regulatory concerns and operational challenges, but some investors are buying in, with analysts forecasting a 121.39% increase in the stock price to $7.97."], "volume": 29827856.0, "introduction": "Eyenovia, a specialty biopharmaceutical company, is developing topical eye treatments using its proprietary delivery and formulation platform, with a debt restructuring and strategic alternatives on the horizon to improve its cash runway and boost its stock price.", "update": "2025-03-12", "current": 0.06, "category": "stock"}, {"company": "Cisco Systems Inc", "symbol": "CSCO", "statement": "Cisco is a leader in AI innovation, driving innovation through products, partnerships, and investments. The company showcases employee experience innovations by leveraging its advanced collaboration tools to drive efficiency across its operations. Cisco Capital was recognized as a Best Company in Monitor Daily 2025, and its IT department deployed an AI-ready data center in weeks. Cisco also joined forces with Safe Security to redefine cyber risk management, and unveiled its Hypershield platform for AI-native security. The company is also focusing on compute innovation with its UCS X-series platform and emphasizing its platform approach to simplify IT operations and drive digital transformation.", "keywords": ["digitaltransformation", "efficiency", "cybersecurity", "innovation", "platform", "riskmanagement", "datacenter", "collaboration", "compute", "ai", "partnership", "leadership"], "sentiment": "positive", "upside": -81.1, "linked": [], "volume": 14244901.0, "introduction": "Cisco is a leader in AI innovation, driving innovation through products, partnerships, and investments, and showcasing employee experience innovations through advanced collaboration tools, AI-native security, and simplified IT operations.", "update": "2025-03-12", "current": 62.23, "category": "stock"}, {"company": "Kenvue Inc", "symbol": "KVUE", "statement": "Kenvue Inc. will present new clinical data at the 2025 American Academy of Dermatology (AAD) Annual Meeting, showcasing its iconic brands' latest science-driven innovations in skin health and beauty. The data from 14 clinical studies will highlight the benefits of Neutrogena and Aveeno products, including reduced collagen loss and improved skin qualities. The findings demonstrate Kenvue's expertise and commitment to shaping the future of skin health and beauty.", "keywords": ["aveeno", "collagen", "innovation", "beauty", "science", "neutrogena", "skin", "clinical", "data", "health", "dermatology"], "sentiment": "positive", "upside": -33.2, "linked": [], "volume": 12022862.0, "introduction": "Kenvue Inc. will present 14 clinical studies at the 2025 AAD Annual Meeting, showcasing the benefits of its Neutrogena and Aveeno products, including reduced collagen loss and improved skin qualities.", "update": "2025-03-12", "current": 20.78, "category": "stock"}, {"company": "Intuitive Machines Inc", "symbol": "LUNR", "statement": "Intuitive Machines, a Houston-based space exploration company, has made significant strides in recent days. The company has launched a $100 million investment fund to foster innovative solutions in minimally invasive care, and its IM-2 mission to the Moon has been deemed a success, with its lunar lander Athena landing just 250 meters from its intended target. The mission was part of NASA's Commercial Lunar Payload Services initiative, and Intuitive Machines has partnered with other companies, including Nokia, to advance lunar exploration. The company has also announced the redemption of its redeemable senior notes and has marked a historic leap in space exploration with its successful lunar landing.", "keywords": ["lunar", "moon", "nasa", "success", "investment", "innovation", "space", "exploration", "fund", "technology", "lander", "company", "partnership", "care", "mission"], "sentiment": "positive", "upside": -258.8, "linked": [], "volume": 23845542.0, "introduction": "Intuitive Machines, a Houston-based space exploration company, has achieved success with its IM-2 mission to the Moon, landing its lunar lander Athena just 250 meters from its target, and has also launched a $100 million investment fund for innovative solutions in minimally invasive care.", "update": "2025-03-12", "current": 23.07, "category": "stock"}, {"company": "Paramount Global", "symbol": "PARA", "statement": "Paramount Global, a media and entertainment company, has seen its stock rise 3.23% after a new deal with Netflix to boost streaming collaborations. The company's SWOT analysis suggests it faces strategic uncertainty, but recent developments, such as the expected closure of the Skydance transaction in the first half of 2025, may help. Paramount Global has a diverse portfolio, including CBS Television Network, and has announced new hires, including industry veterans Steve Mosko and David Spingarn. The company's financial results and earnings reports are also being monitored closely.", "keywords": ["financial", "veterans", "results", "uncertainty", "earnings", "streaming", "swot", "media", "collaboration", "hires", "cbs", "entertainment", "skydance", "television", "paramount", "analysis", "network", "portfolio", "transaction", "netflix"], "sentiment": "positive", "upside": -469.2, "linked": [], "volume": 22042392.0, "introduction": "Paramount Global's stock has risen 3.23% after a deal with Netflix to boost streaming collaborations, despite facing strategic uncertainty, with recent developments and new hires potentially boosting its prospects.", "update": "2025-03-12", "current": 11.07, "category": "stock"}, {"company": "Exxon Mobil Corp", "symbol": "XOM", "statement": "ExxonMobil is participating in PLASTIMAGEN MEXICO 2025, showcasing innovative solutions that can offer recycling benefits, including Exxtend technology and Vistamaxx performance polymers. The company's advanced and mechanical recycling solutions will be highlighted at the event. ExxonMobil also announced a $10 billion project in South China's Guangdong province to produce performance polymers used in various industries. Additionally, ExxonMobil's stock price and company profile are discussed, as well as news articles covering various topics such as its production levels and business developments.", "keywords": ["mexico", "stock", "project", "business", "profile", "exxonmobil", "plastimagen", "technology", "polymers", "recycling", "advanced", "solutions", "vistamaxx", "production", "mechanical"], "sentiment": "positive", "upside": -64.7, "linked": [], "volume": 13925682.0, "introduction": "ExxonMobil will participate in PLASTIMAGEN MEXICO 2025, showcasing innovations like Exxtend technology and Vistamaxx polymers, and announcing a $10 billion project in South China.", "update": "2025-03-12", "current": 108.66, "category": "stock"}, {"company": "Triton International Ltd", "symbol": "TRTN", "statement": "Triton International Limited has acquired Global Container International LLC (GCI), a marine intermodal container lessor, in a deal valued at over $1 billion. The acquisition is expected to expand Triton's market presence in container leasing and will close in the first half of 2025 pending regulatory approval. The deal will allow Triton to lock in meaningful container fleet growth, according to CEO Brian Sondey. The acquisition is seen as a strategic fit for Triton, which is a leading lessor of intermodal containers and chassis, and will help the company continue to achieve excellent operating performance in the container leasing market.", "keywords": ["valued", "growth", "container", "triton", "regulatory", "international", "leasing", "intermodal", "billion", "global", "fleet", "ceo", "acquisition", "deal", "presence", "chassis", "approval", "market", "performance"], "sentiment": "positive", "upside": 187.8, "linked": [], "volume": 10882200.0, "introduction": "Triton International Limited has acquired Global Container International LLC (GCI) for over $1 billion, expanding its container leasing market presence and allowing for meaningful fleet growth.", "update": "2025-03-12", "current": 79.55, "category": "stock"}, {"company": "Recursion Pharmaceuticals Inc", "symbol": "RXRX", "statement": "Recursion Pharmaceuticals is a biotech company using artificial intelligence (AI) to accelerate drug discovery and development. The company's proprietary platform, Recursion OS, uses machine learning algorithms to predict the success of potential treatments, reducing the need for costly and time-consuming clinical trials. With partnerships with leading pharmaceutical companies like Roche, Bayer, and Merck, Recursion is poised to revolutionize the drug discovery process, promising new drug discoveries and potentially lucrative returns for investors. As a pure play in AI-powered biotech, Recursion stands out as a leader in this growing field, with its custom-built BioHive-2 supercomputer and advanced data-driven platform driving innovation and growth.", "keywords": ["growth", "machinelearning", "pharmaceuticals", "algorithm", "pharmaceutical", "discovery", "returns", "leader", "revolutionize", "investor", "innovation", "platform", "clinicaltrials", "pureplay", "biotech", "predict", "recursion", "ai", "partnerships"], "sentiment": "positive", "upside": -165.9, "linked": [], "volume": 24966518.0, "introduction": "Recursion Pharmaceuticals uses artificial intelligence to accelerate drug discovery and development through its proprietary platform, predicting treatment success and reducing clinical trial costs, partnering with leading pharmaceutical companies and promising lucrative returns.", "update": "2025-03-12", "current": 7.33, "category": "stock"}, {"company": "Applied Science Products Inc", "symbol": "APLD", "statement": "Applied Aerospace acquired NeXolve, a company that specializes in deployable space technology. Applied Digital's stock price has seen a decline over the past 22 years, with an annualized return of -3.09%. Applied Industrial Technologies acquired an automation company, expanding its specialized automation offering. Alltech creates sustainable solutions for food production and has current job openings. The company Applied Aerospace announced improved organic sales, while bit.bio launched a new range of cutting-edge genetic engineering and cellular model solutions. Additionally, a director of applied science job opening was posted, and a company acquired another in Mexico.", "keywords": ["andfocusedonthegeneraltopicsandconceptsmentionedinthetext", "mexico", "genetic", "notethati'veexcludedcompanynamesandotherpropernouns", "space", "engineering", "aerospace", "technology", "cellular", "digital", "solutions", "applied", "food", "automation"], "sentiment": "positive", "upside": -171.4, "linked": [], "volume": 14938410.0, "introduction": "Applied Aerospace, Applied Industrial Technologies, and Alltech made various acquisitions and announcements, including the acquisition of NeXolve, an automation company, and the launch of new genetic engineering solutions, while also posting job openings and experiencing improved sales.", "update": "2025-03-12", "current": 8.96, "category": "stock"}, {"company": "Lumen Technologies Inc", "symbol": "LUMN", "statement": "Lumen Technologies, Inc. is a technology and communications company that provides integrated products and services to businesses and mass market customers. The company's shares have surged 175.8% in the past year, outpacing the S&P 500 and Technology Services industry. Lumen Technologies offers a range of services, including advanced products, network edge data protection, and managed services. The company operates in two segments, Business and Mass Markets, and has a negative trailing twelve-month return on equity of 46.17%.", "keywords": ["customers", "industry", "managed", "surge", "operations", "technology", "protection", "businesses", "products", "network", "services", "equity", "shares", "communications"], "sentiment": "positive", "upside": -277.7, "linked": [], "volume": 12041460.0, "introduction": "Lumen Technologies, Inc. is a technology company that provides integrated products and services to businesses and mass market customers, with its shares surging 175.8% in the past year.", "update": "2025-03-12", "current": 5.92, "category": "stock"}, {"company": "Peloton Interactive Inc", "symbol": "PTON", "statement": "Peloton Interactive is a technology company that specializes in interactive fitness products and services. The company's products include the Peloton Bike, Tread, Tread+, Guide, and Row, which are marketed and sold through e-commerce, retail showrooms, and third-party retailers. The company's revenue has been declining year-over-year, with a decrease of -9.36% in the latest quarter and -4.00% in the fiscal year ending June 30, 2024. Analysts have issued a median target of 8.95 for the company's stock, with a high estimate of 55.00 and a low estimate of 2.53.", "keywords": ["stock", "decline", "fitness", "technology", "analysts", "products", "retail", "services", "revenue", "e-commerce", "target"], "sentiment": "negative", "upside": -161.4, "linked": [], "volume": 9125277.0, "introduction": "Peloton Interactive is a technology company that sells interactive fitness products and services, including the Peloton Bike, Tread, and Row, but its revenue has been declining year-over-year.", "update": "2025-03-12", "current": 8.4, "category": "stock"}, {"company": "Fubotv Inc", "symbol": "FUBO", "statement": "fuboTV (FUBO) surged 76% in value after reporting a 75% increase in Q3 revenue to $1.623 billion, despite broader market downturns. The company offers a streaming platform that provides premium sports, news, and entertainment content in the US and internationally. Analysts cut their price target to $3.08, citing concerns about the company's growth prospects. Despite this, FuboTV aims to transcend the traditional TV model with its global mission to aggregate the best content through a single app. The company has reported strong revenue growth, with annual revenue of $1.62 billion in 2024 and quarterly revenue of $443.28 million, representing an 8.07% increase.", "keywords": ["app", "growth", "surge", "model", "traditional", "downturns", "streaming", "revenue", "news", "sports", "platform", "fubotv", "entertainment", "mission", "target", "prospects", "analysts", "tv", "market"], "sentiment": "positive", "upside": -175.5, "linked": [], "volume": 25155248.0, "introduction": "FuboTV's stock surged 76% after reporting a 75% increase in Q3 revenue to $1.623 billion, despite analysts cutting their price target to $3.08 due to concerns about growth prospects.", "update": "2025-03-12", "current": 4.04, "category": "stock"}, {"company": "JetBlue Airways Corp", "symbol": "JBLU", "statement": "JetBlue has appointed Josh Weiss as its new Vice President of Technology Products, effective March 11. Weiss will oversee the airline's digital product portfolio and explore innovative ways to leverage technology to enhance the customer and crewmember experience. The appointment comes as JetBlue continues to invest in its technology and amenities, including a $100 million upgrade to its Terminal 5 at JFK, which will feature cutting-edge designs and sustainability-focused solutions.", "keywords": ["experience", "crewmember", "upgrade", "innovation", "investment", "technology", "products", "jetblue", "sustainability", "customer"], "sentiment": "positive", "upside": -252.5, "linked": [], "volume": 14025745.0, "introduction": "JetBlue has appointed Josh Weiss as its new Vice President of Technology Products, responsible for overseeing the airline's digital product portfolio and exploring innovative ways to enhance the customer and crewmember experience.", "update": "2025-03-12", "current": 8.07, "category": "stock"}, {"company": "Merck & Co Inc", "symbol": "MRK", "statement": "Merck, a multinational pharmaceutical company, has opened a new $1 billion vaccine manufacturing facility in Durham, North Carolina, as part of its $12 billion investment in US capital expenditures. The new facility will increase vaccine production capacity and support the company's domestic manufacturing and R&D capabilities.", "keywords": ["expenditures", "investment", "research", "pharmaceutical", "multinational", "manufacturing", "capacity", "capital", "production", "facility", "development", "vaccine"], "sentiment": "positive", "upside": -71.4, "linked": [], "volume": 12236716.0, "introduction": "Merck has opened a $1 billion vaccine manufacturing facility in Durham, North Carolina, as part of its $12 billion investment in US capital expenditures, increasing vaccine production capacity and supporting domestic manufacturing and R&D capabilities.", "update": "2025-03-12", "current": 95.55, "category": "stock"}, {"company": "Wolfspeed Inc", "symbol": "WOLF", "statement": "Wolfspeed, a semiconductor company, is cutting approximately 180 jobs, primarily in its materials operations in Durham and Siler City, North Carolina, as part of its cost-cutting measures to achieve positive cash flow. The company is also scaling back its capital expenditures, targeting a reduction of $150 million. The job cuts come as Wolfspeed's stock price has plummeted from $73 in March 2023 to below $6 today, amid struggles in its transition from LED lighting to producing silicon carbide semiconductors.", "keywords": ["expenditures", "stock", "durham", "lighting", "reduction", "jobs", "siler", "north", "cost-cutting", "flow", "price", "cash", "capital", "carbide", "layoffs", "silicon", "carolina", "semiconductors"], "sentiment": "negative", "upside": -461.9, "linked": [], "volume": 13710478.0, "introduction": "Wolfspeed, a semiconductor company, is cutting 180 jobs and reducing capital expenditures by $150 million to achieve positive cash flow, following a significant decline in its stock price amid its transition from LED lighting to silicon carbide semiconductors.", "update": "2025-03-12", "current": 6.67, "category": "stock"}, {"company": "Hecla Mining Co", "symbol": "HL", "statement": "Hecla Mining Co. (HL) is a major American silver mining firm that has reported significant growth in recent quarters, with 55% year-over-year sales growth and a 32% increase in silver production. Despite this growth, the company's return on capital employed (ROCE) is low at 4.5%, underperforming the metals and mining industry average. The company's stock price has fluctuated, with some analysts recommending it as a stock to avoid due to its high price-to-sales ratio. However, others have noted that the company has a strong track record of growth and has been a good performer in the past.", "keywords": ["growth", "return", "stock", "avoid", "sales", "performer", "track", "record", "price", "analysts", "mining", "capital", "employed", "silver", "production", "roce"], "sentiment": "negative", "upside": -102.7, "linked": [], "volume": 13762123.0, "introduction": "Hecla Mining Co. has reported significant growth in sales and silver production, but its return on capital employed is low, leading to mixed opinions on its stock performance.", "update": "2025-03-12", "current": 5.49, "category": "stock"}, {"company": "Cipher Mining Inc", "symbol": "CIFR", "statement": "Cipher Mining Inc (CIFR) is a technology company that develops and operates large-scale bitcoin mining data centers across the US. The company has expanded its operations in West Texas with a new data center and has a strong growth pipeline with 2.6 GW across 11 sites. Analysts are bullish on the company, with Rosenblatt initiating coverage with a Buy rating and a price target of $6.50. The company's stock has been moving up, with a recent 1.39% increase, and is considered a top US growth company with high insider ownership.", "keywords": ["rating", "growth", "stock", "coverage", "texas", "target", "bitcoin", "ownership", "technology", "mining", "analysts", "data", "centers", "pipeline"], "sentiment": "positive", "upside": -162.0, "linked": ["IREN : Iris Energy plans to build a 75MW liquid-cooled data center in Texas, Horizon 1, designed to support 200kW per rack and host Nvidia Blackwell GPUs, with completion expected in H2 2025."], "volume": 17340020.0, "introduction": "Cipher Mining Inc, a technology company, develops and operates large-scale bitcoin mining data centers across the US, with a strong growth pipeline and bullish analyst ratings.", "update": "2025-03-12", "current": 5.9, "category": "stock"}, {"company": "Sunnova Energy International Inc", "symbol": "NOVA", "statement": "Sunnova Energy International, a residential solar and energy storage services company, has named Paul Mathews as its new President and CEO, succeeding John Berger. The change comes after the company announced a 15% reduction in force, cutting nearly 300 jobs, and a $70 million cost reduction initiative. Mathews, former COO, will focus on disciplined growth, stronger cash generation, cost efficiency, and enhancing the customer experience. The company's shares surged after Berger stepped down, citing substantial doubt about the company's ability to remain in business.", "keywords": ["cost", "energy", "growth", "efficiency", "reduction", "jobs", "solar", "ceo", "customer", "services", "shares", "president", "storage"], "sentiment": "negative", "upside": -610.4, "linked": [], "volume": 10045774.0, "introduction": "Sunnova Energy International has appointed Paul Mathews as its new President and CEO, succeeding John Berger, with a focus on disciplined growth, cost efficiency, and enhancing customer experience, following a 15% reduction in force and $70 million cost reduction initiative.", "update": "2025-03-12", "current": 3.24, "category": "stock"}, {"company": "Xp Inc", "symbol": "XP", "statement": "Exein, an embedded IoT cybersecurity company, has partnered with Supermicro, a global leader in application-optimized total IT solutions, to redefine embedded security. Meanwhile, MSI IPC is showcasing its Edge AI Computing innovations at Embedded World 2025, featuring cutting-edge technologies for automation, digital signage management, and AI-driven customer interactions. XP Inc., a Cayman Islands-based holding company, has made headlines with its financial services and education platforms, as well as its founder Guilherme Benchimol being featured in Forbes. The company's stock has seen a significant decrease, with XP Inc. announcing a new CFO. Other notable mentions include Vemanti Group's acquisition of ONUS Pro and XP Inc.'s financial services and education platforms.", "keywords": ["iot", "cybersecurity", "stock", "innovation", "edge", "technology", "signage", "acquisition", "interactions", "education", "ai", "partnership", "customer", "finance", "automation"], "sentiment": "positive", "upside": 168.8, "linked": [], "volume": 8138390.0, "introduction": "Exein, Supermicro, MSI IPC, XP Inc., and other companies made news in the tech industry, with partnerships, product showcases, and executive appointments.", "update": "2025-03-12", "current": 12.79, "category": "stock"}, {"company": "Carnival Corp", "symbol": "CCL", "statement": "Carnival Corporation, a top pick in the financial industry, is poised for big gains with its growing customer base and cutting-edge solutions. The company has announced a $1 billion debt refinancing to reduce annual interest expenses and has ordered three new LNG-powered ships for its Carnival Cruise Line brand. The company's financial moves aim to optimize its capital structure, and its order for new ships is a response to high demand for cruise vacations. With over 50 million customers, Carnival Corporation is a leading player in the cruise industry, with a market capitalization of $20.9 billion and a diverse set of innovative solutions.", "keywords": ["financial", "base", "demand", "lng", "solutions", "capital", "gains", "ships", "capitalization", "industry", "innovation", "carnival", "interest", "vacations", "customer", "corporation", "structure", "debt", "expenses", "market", "refinancing"], "sentiment": "positive", "upside": -76.3, "linked": [], "volume": 15688947.0, "introduction": "Carnival Corporation, a leading cruise company with a growing customer base and innovative solutions, is poised for growth with a $1 billion debt refinancing and new ship orders to optimize its capital structure and meet high demand for cruise vacations.", "update": "2025-03-12", "current": 25.42, "category": "stock"}, {"company": "Medical Properties Trust Inc", "symbol": "MPW", "statement": "Medical Properties Trust (MPW) has had its price target raised to $5 from $4 by RBC Capital, which maintains a Sector Perform rating on the shares. The company is making progress in stabilizing its troubled assets and has grown to become one of the world's largest owners of hospital real estate with 441 facilities and approximately 44,000 licensed beds. Seven Wall Street analysts have issued ratings for MPW, with a consensus to \"hold\" the stock. The company's strategy is centered on long-term leases with high-quality tenants, providing stable cash flow.", "keywords": ["hospital", "rating", "progress", "beds", "trust", "estate", "leases", "assets", "flow", "cash", "facilities", "shares", "properties", "target", "medical", "hold", "consensus", "real", "analysts"], "sentiment": "positive", "upside": -572.6, "linked": [], "volume": 17636662.0, "introduction": "Medical Properties Trust's price target has been raised to $5 by RBC Capital, with the company's strategy of long-term leases with high-quality tenants providing stable cash flow.", "update": "2025-03-12", "current": 4.69, "category": "stock"}, {"company": "Pinduoduo Inc", "symbol": "PDD", "statement": "Pinduoduo, a Chinese e-commerce platform, has seen significant growth, with sales revenue increasing 94% year-on-year to $9.66 billion in the first three quarters of the year. The company, rebranding as Easy Environmental Solutions, Inc., has introduced Modular Solutions to create a sustainable future. Pinduoduo offers products at extremely low prices and has expanded its business to the US market. The company aims to bring more businesses and people into the digital economy, increasing productivity and opportunities for local communities and small businesses.", "keywords": ["small", "market", "growth", "prices", "sales", "business", "productivity", "products", "solutions", "opportunities", "future", "revenue", "digital", "sustainability", "communities", "environment", "e-commerce"], "sentiment": "positive", "upside": 158.8, "linked": [], "volume": 12641314.0, "introduction": "Pinduoduo, a Chinese e-commerce platform, saw a 94% year-on-year sales revenue growth to $9.66 billion in Q3, rebranded as Easy Environmental Solutions, and expanded to the US market with a focus on sustainability and community development.", "update": "2025-03-12", "current": 111.34, "category": "stock"}, {"company": "BigBear.ai Holdings Inc", "symbol": "BBAI", "statement": "BigBear.ai Holdings, Inc. (BBAI) has faced setbacks, including a price target cut and a Q4 miss, which has led to a 20.48% decline in its stock price. The company's Q4 2024 earnings underperformed expectations, with revenue missing estimates. Despite this, BigBear.ai's gross margin increased to 37.4%, and its ending backlog surged 2.5 times year-over-year to $418 million. Analysts remain bullish on the company, with one analyst retaining a Buy rating and lowering its price forecast to $6. However, the company's 2025 outlook is uncertain, with potential government shutdowns or changes in national security priorities affecting its revenue.", "keywords": ["setbacks", "uncertain", "earnings", "decline", "bullish", "margin", "analysts", "estimates", "outlook", "backlog", "revenue", "target"], "sentiment": "negative", "upside": -511.4, "linked": [], "volume": 29238060.0, "introduction": "BigBear.ai Holdings, Inc. (BBAI) has faced setbacks, including a Q4 miss and price target cut, causing a 20.48% stock price decline, but analysts remain bullish despite uncertainty around 2025 outlook.", "update": "2025-03-12", "current": 4.13, "category": "stock"}, {"company": "Citigroup Inc", "symbol": "C", "statement": "Citigroup, a major financial institution, is shifting its focus to digital solutions for wealth management and institutional banking, enhancing the customer experience. The company has achieved a total return of 67.11% over the past five years, driven by key developments such as enhancing customer experience and investing in technological advancements. Citigroup's recent earnings report showed a 2% dip, but the company is expected to report an EPS of $1.85 in its next report. The company has faced scrutiny after a $81 trillion mistake, prompting an overhaul under CEO Jane Fraser's \"Transformation\" plan.", "keywords": ["financial", "experience", "return", "institutional", "banking", "earnings", "transformation", "management", "developments", "advancements", "technological", "wealth", "digital", "solutions", "eps", "report", "customer"], "sentiment": "positive", "upside": -58.9, "linked": [], "volume": 15021470.0, "introduction": "Citigroup is shifting its focus to digital solutions for wealth management and institutional banking to enhance the customer experience, despite a recent earnings dip and a $81 trillion mistake, and is expected to report an EPS of $1.85 in its next report.", "update": "2025-03-12", "current": 81.48, "category": "stock"}, {"company": "Marvell Technology Group Ltd", "symbol": "MRVL", "statement": "Marvell Technology, a leading semiconductor company, reported strong Q4 FY 2025 earnings, driven by 78% year-over-year growth in data center revenue, which now accounts for 75% of total sales. The company's custom AI silicon and interconnect solutions entered high-volume production, driving record quarterly revenue of $1.82 billion. Despite the strong earnings, Marvell's shares tumbled 24% over the past week, but some analysts still recommend buying the stock due to its strong growth prospects in the AI chip market.", "keywords": ["growth", "stock", "earnings", "record", "ai", "semiconductor", "center", "analysts", "solutions", "revenue", "production", "data", "silicon"], "sentiment": "positive", "upside": -134.4, "linked": ["VRT : Vertiv has introduced a new heat rejection system, the CoolLoop Trim Cooler, for hybrid liquid and air cooling in AI applications, while reporting positive Q4 earnings and expanding its thermal management offerings."], "volume": 9542648.0, "introduction": "Marvell Technology reported strong Q4 FY 2025 earnings, driven by 78% year-over-year growth in data center revenue, but its shares fell 24% over the past week.", "update": "2025-03-12", "current": 124.02, "category": "stock"}, {"company": "PG&E Corp", "symbol": "PCG", "statement": "Procter & Gamble (PG) is a multinational consumer goods company with various financial information and news sources available. The company's stock price and news are tracked by various financial websites, including Google Finance, Morningstar, MarketBeat, Reuters, and Seeking Alpha. The company has released its earnings results, beating analysts' estimates, and has a history of delivering long-term investor returns. The stock has a current rating of 4.2/5 and has seen its revenue grow 2.1% year-over-year. Investors can access historical stock prices, stock analysis, and news to inform their trading and investment decisions.", "keywords": ["financial", "rating", "growth", "websites", "google", "returns", "company", "information", "investors", "seeking", "earnings", "price", "trading", "estimates", "revenue", "alpha", "morningstar", "news", "stock", "investment", "reuters", "multinational", "marketbeat", "goods", "consumer"], "sentiment": "positive", "upside": 56.2, "linked": ["T : AT&T is a multinational telecommunications company headquartered in Texas, offering internet and mobile services and ranking as the world's third-largest telecommunications company by revenue."], "volume": 20685864.0, "introduction": "Procter & Gamble is a multinational consumer goods company with a strong track record of delivering long-term investor returns, whose stock price and news are tracked by various financial websites.", "update": "2025-03-12", "current": 16.54, "category": "stock"}, {"company": "Bloom Energy Corp", "symbol": "BE", "statement": "Bloom Energy is a company that leverages natural gas and other fuels to create electricity through chemical reactions. The company's technology helps data centers and other organizations generate power on-site. Analysts predict strong growth for Bloom Energy, with earnings per share expected to increase by 35.71% in 2025 and 89.21% in 2026. The company's flagship product is the Bloom Energy Server, which is used to generate electricity in over 1,200 locations and seven countries. With a strong track record and growing demand for alternative energy solutions, Bloom Energy is an attractive investment opportunity.", "keywords": ["energy", "growth", "countries", "product", "earnings", "server", "gas", "locations", "data", "investment", "chemical", "fuels", "shares", "centers", "predict", "analysts", "natural", "electricity", "reactions"], "sentiment": "positive", "upside": -109.5, "linked": ["CLSK : CleanSpark is a bitcoin mining company with a growing customer base, diverse solutions, and strong growth potential, making it a good investment opportunity with a market capitalization of $2.24 billion."], "volume": 11694563.0, "introduction": "Bloom Energy is a company that generates electricity using natural gas and other fuels, with strong growth predicted and a flagship product used in over 1,200 locations across seven countries.", "update": "2025-03-12", "current": 29.81, "category": "stock"}, {"company": "Cleveland-Cliffs Inc", "symbol": "CLF", "statement": "Cleveland-Cliffs, a steel company, has announced a \"Buy American\" incentive program for its 30,000 employees. As part of the program, employees who purchase or lease a new American-built vehicle with substantial steel content from the company will receive a $1,000 cash bonus in 2025. The goal of the program is to promote American-made vehicles, support domestic production, and strengthen US supply chains.", "keywords": ["american", "steel", "incentive", "employees", "supply", "program", "chains", "vehicle", "production", "bonus"], "sentiment": "positive", "upside": -333.6, "linked": [], "volume": 7913713.0, "introduction": "Cleveland-Cliffs, a steel company, is offering a \"Buy American\" incentive program, giving its 30,000 employees a $1,000 cash bonus in 2025 for buying or leasing a new American-made vehicle with substantial steel content.", "update": "2025-03-12", "current": 10.01, "category": "stock"}, {"company": "Nextera Energy Inc", "symbol": "NEE", "statement": "NextEra Energy, a major US power company, is considering doubling its $20 billion investment in Texas over the next few years. The company's CEO, John Ketchum, expects a 55% increase in power demand over the next 20 years, with 17% of that growth coming from the surge in AI-driven data centers. Ketchum also warned against relying solely on natural gas to meet this demand, stating that power plants fueled by gas can only meet a small fraction of the growth. The company is also considering the development of new nuclear reactors and small modular designs, with the first new reactor expected to come online in 2031 or 2032.", "keywords": ["energy", "growth", "demand", "investment", "texas", "reactors", "gas", "power", "natural", "nuclear", "modular", "design", "ai", "data", "centers"], "sentiment": "positive", "upside": -54.5, "linked": [], "volume": 23938956.0, "introduction": "NextEra Energy plans to double its $20 billion investment in Texas over the next few years to meet a projected 55% increase in power demand, with a focus on developing new nuclear reactors and small modular designs, rather than relying solely on natural gas.", "update": "2025-03-12", "current": 72.83, "category": "stock"}, {"company": "Keurig Dr Pepper Inc", "symbol": "KDP", "statement": "Keurig Dr Pepper Inc. (KDP) was a key player at the Future Smarts '24 conference, where executives from Coca-Cola, PepsiCo, and KDP discussed their strategies for 2025. KDP's stock performance has been strong, with a market cap of $44.1 billion. The company has recently launched new flavors and products, and is expected to report its Q1 2024 results on April 25. Analysts have provided mixed opinions on the company's stock, with some citing its strong brand portfolio and others expressing concerns about competition and valuation.", "keywords": ["keurig", "inc", "smarts", "q1", "results", "opinions", "flavors", "coca-cola", "pepper", "conference", "pepsico", "stock", "billion", "kdp", "products", "future", "competition", "cap", "analysts", "portfolio", "strategies", "valuation", "market", "dr", "brand"], "sentiment": "positive", "upside": 34.8, "linked": [], "volume": 8763313.0, "introduction": "Keurig Dr Pepper Inc., a key player at the Future Smarts '24 conference, is expected to report Q1 2024 results on April 25, with analysts providing mixed opinions on its stock performance.", "update": "2025-03-12", "current": 31.15, "category": "stock"}, {"company": "Oracle Corp", "symbol": "ORCL", "statement": "Oracle is making a compelling value proposition in the cloud landscape, driving innovation through cutting-edge cloud offerings and enabling businesses to accelerate digital transformation. The company is also partnering with OpenAI and Nvidia to build a massive data center in Texas, which will house 64,000 powerful AI chips. Oracle's Stargate project is expected to be a major focus of its upcoming earnings report, with the company aiming to fill the data center with Nvidia chips in the coming months. Additionally, Oracle's AI boom is facing skepticism from some analysts, who are concerned about the company's $89 billion debt and valuation risks.", "keywords": ["chips", "stargate", "debt", "innovation", "transformation", "data", "earnings", "ai", "center", "oracle", "valuation", "partnership", "cloud"], "sentiment": "positive", "upside": -88.4, "linked": [], "volume": 12050373.0, "introduction": "Oracle is driving innovation in the cloud landscape through its cutting-edge offerings and partnerships, including a massive data center in Texas with Nvidia chips, but faces skepticism over its debt and valuation risks.", "update": "2025-03-12", "current": 183.6, "category": "stock"}, {"company": "Digital World Acquisition Corp", "symbol": "DJT", "statement": "Digital World Acquisition Corp. (DWACW) was acquired by Trump Media & Technology Group Corp. in a reverse merger transaction in March 2024. The company has no significant operations. Other market news includes IBM's acquisition of HashiCorp, PDF Solutions' acquisition of secureWISE, LLC, and ServiceNow's acquisition of Moveworks for $2.9 billion. Additionally, there are various articles on M&A deals, AI companies, user acquisition agencies, and technology innovation.", "keywords": ["world", "trump", "solutions", "reverse", "hashicorp", "pdf", "m&a", "ibm", "innovation", "media", "servicenow", "moveworks", "deals", "acquisition", "merger", "secure", "technology", "digital", "ai"], "sentiment": "negative", "upside": -129.7, "linked": ["JOBY : Reinvent Technology Partners is a blank check company focused on merging or acquiring a technology company, with institutional and insider ownership, amidst a backdrop of technology trends and news."], "volume": 8378045.0, "introduction": "Digital World Acquisition Corp. was acquired by Trump Media & Technology Group Corp. in a reverse merger in March 2024, with no significant operations.", "update": "2025-03-12", "current": 32.71, "category": "stock"}, {"company": "Nike Inc", "symbol": "NKE", "statement": "Nike has been innovating and improving its products, including its most responsive foam, Nike ZoomX, which now provides even more energy return and a bouncy feel. The company has also been investing in hyper-localized innovations for the Chinese market, which has seen a 6% year-on-year sales growth. Meanwhile, Nike's product development process involves extensive research and development, as seen in the creation of the Nike Free shoe, which was designed to strengthen athletes' feet and legs naturally. The company is also expanding its product lines, with new designs and innovations in the works for 2025.", "keywords": ["hyper", "energy", "research", "innovating", "expansion", "bouncy", "responsive", "natural", "localized", "development"], "sentiment": "positive", "upside": -19.3, "linked": [], "volume": 8099729.0, "introduction": "Nike has innovated its products, including its ZoomX foam, and is investing in hyper-localized innovations for the Chinese market, while expanding its product lines and developing new designs and innovations for 2025.", "update": "2025-03-12", "current": 73.57, "category": "stock"}, {"company": "Walt Disney Co", "symbol": "DIS", "statement": "Disney has showcased its future plans for theme parks and entertainment at SXSW, highlighting its commitment to innovative world-building. The company has invested $1.5 billion in Epic Games, a move aimed at amplifying its franchise flywheel with new tech. New robots and attractions are being unveiled, including a Cars-themed land at the Magic Kingdom, a Stark Flight Lab attraction at Avengers Campus, and a suspended ride experience. The company is also exploring new ways to bring its stories to life, leveraging its strong intellectual properties and ambitious investments to drive growth and returns.", "keywords": ["innovative", "world-building", "growth", "epic", "attractions", "ride", "returns", "flywheel", "stories", "cars", "franchise", "avengers", "disney", "experiences", "games", "kingdom", "magic", "parks", "theme", "tech", "entertainment", "properties", "robots", "campus", "suspended", "intellectual"], "sentiment": "positive", "upside": -38.8, "linked": [], "volume": 8199379.0, "introduction": "Disney is investing $1.5 billion in Epic Games and unveiling new attractions and robots at its theme parks, including a Cars-themed land and suspended ride experience, to amplify its franchise flywheel and drive growth and returns.", "update": "2025-03-12", "current": 112.16, "category": "stock"}, {"company": "Canoo Inc", "symbol": "GOEV", "statement": "Canoo's CEO has formed a company called WHS Energy Solutions to acquire the assets of a bankrupt electric vehicle manufacturer for $4 million. This comes after Canoo filed for Chapter 7 liquidation and owes over $11 million to a financial firm controlled by its CEO. The company has also announced a 1-for-20 reverse stock split and furloughs and factory idles to focus on securing capital. The company's stock has been declining, with a return on equity of -128.71% and EPS of -0.09. Despite this, the company has made some positive announcements, including a partnership with The AA in the UK for premium roadside assistance services.", "keywords": ["financial", "electric", "energy", "stock", "bankruptcy", "decline", "manufacturing", "assistance", "vehicles", "capital", "acquisition", "partnership", "liquidation", "roadside"], "sentiment": "negative", "upside": -51254.7, "linked": [], "volume": 278908670.0, "introduction": "Canoo's CEO forms WHS Energy Solutions to acquire assets of a bankrupt electric vehicle manufacturer for $4 million, amidst company's financial struggles, including debt and declining stock performance.", "update": "2025-03-12", "current": 0.48, "category": "stock"}, {"company": "noco-noco Inc", "symbol": "NCNC", "statement": "Noco-Noco Inc. (NCNCF) is a company that has announced its 2025 business restart plan to drive strategic growth. The company has also secured significant new financing and has filed quarterly reports with the SEC. Pulvinar Neuro, a neurotechnology company, has received a breakthrough device designation for non-invasive brain stimulation research tools. Noco-Noco Inc. has also released new products, including the Genius GEN5X2 battery charger and the Boost Max GB500 jump starter. Additionally, the company has filed quarterly reports with the SEC and has announced new financing.", "keywords": ["reports", "growth", "stimulation", "financing", "business", "brain", "neurotechnology", "starter", "sec", "products", "quarterly", "restart", "devices", "charger"], "sentiment": "positive", "upside": -29435.4, "linked": [], "volume": 7881816.0, "introduction": "Noco-Noco Inc. has announced its 2025 business restart plan, secured new financing, filed quarterly SEC reports, and released new products, including the Genius GEN5X2 battery charger and Boost Max GB500 jump starter.", "update": "2025-03-12", "current": 0.1, "category": "stock"}, {"company": "Lam Research Corp", "symbol": "LRCX", "statement": "Lam Research, a company that provides equipment and services to the semiconductor industry, has introduced its third-generation cryogenic etch technology, Lam Cryo 3.0, which further solidifies its leadership in 3D NAND flash etching. The company has also been recognized as one of the World's Most Ethical Companies by Ethisphere for the third consecutive year. Additionally, Lam Research has expanded its supply chain in India, pledged to upskill 2,800 students, and has been recognized for its innovative solutions in the semiconductor industry. The company is also a strong performer in the stock market, with its stock price showing steady growth.", "keywords": ["industry", "market", "growth", "innovation", "chain", "supply", "nand", "semiconductor", "technology", "flash", "ethics", "services", "equipment", "cryogenic", "leadership", "etch"], "sentiment": "positive", "upside": -39.1, "linked": [], "volume": 8978737.0, "introduction": "Lam Research, a leading provider of semiconductor equipment and services, has introduced its third-generation cryogenic etch technology, solidified its ethical leadership, expanded its Indian supply chain, and demonstrated strong stock market performance.", "update": "2025-03-12", "current": 79.68, "category": "stock"}, {"company": "Pacific Biosciences of California Inc", "symbol": "PACB", "statement": "Pacific Biosciences of California (PACB) is a biotechnology company that designs, develops, and manufactures sequencing solutions to resolve genetically complex problems. The company provides sequencing systems, consumable products, and reagent kits for various applications, including human genetics, plant and animal sciences, infectious disease, and oncology. In recent news, PACB released its earnings results, meeting the consensus estimate of ($0.20) EPS, with a negative return on equity of 42.71% and a negative net margin of 227.69%. Insider trades show that several institutional investors and insiders have sold PACB shares in the last 24 months, while Atom Investors LP and Atria Investments Inc. have acquired new stakes in the company.", "keywords": ["sequencing", "stocks", "earnings", "disease", "oncology", "biotechnology", "genetics", "investors", "finance"], "sentiment": "negative", "upside": -536.2, "linked": [], "volume": 20040912.0, "introduction": "Pacific Biosciences of California, a biotech company that designs and manufactures sequencing solutions, released earnings results that met expectations, with institutional investors and insiders selling shares, while Atom Investors and Atria Investments acquired new stakes.", "update": "2025-03-12", "current": 1.65, "category": "stock"}, {"company": "Kinder Morgan Inc", "symbol": "KMI", "statement": "Kinder Morgan, a natural gas and petroleum products pipeline operator, has invested $3 billion in its South System Expansion 4 (SSE4) project by 2029, which will improve efficiency and minimize environmental impact. The company has also acquired a midstream system in the Williston Basin of North Dakota from Outrigger Energy II LLC for $640 million. Kinder Morgan's President sold $478,980 worth of stock, and the company's SWOT analysis highlights its challenges in navigating commodity price volatility. The company's financials show a decrease in revenue and earnings in 2024, but its President remains optimistic about its growth prospects.", "keywords": ["efficiency", "energy", "growth", "petroleum", "earnings", "volatility", "gas", "expansion", "system", "commodities", "acquisition", "revenue", "midstream", "environment", "pipeline"], "sentiment": "negative", "upside": -5.6, "linked": [], "volume": 12764777.0, "introduction": "Kinder Morgan has invested $3 billion in its South System Expansion 4 project and acquired a midstream system in North Dakota, while its President sold $478,980 worth of stock and remains optimistic about growth prospects despite recent revenue and earnings decreases.", "update": "2025-03-12", "current": 30.27, "category": "stock"}, {"company": "Sunrun Inc", "symbol": "RUN", "statement": "Sunrun Inc., a leading provider of residential solar energy solutions, faces challenges and opportunities as it navigates a complex landscape of market opportunities and regulatory challenges. Despite a WEAK financial health score, the company has a strong track record of innovation and has consistently introduced new products. With a market capitalization of $1.49 billion, Sunrun has a significant growth opportunity with the rising demand for clean energy solutions, and its acquisition of Vivint Solar in 2020 represents a significant growth opportunity. The company has positioned itself as a leader in storage-first solutions and high-value markets, with storage attachment rates increasing to 62%.", "keywords": ["financial", "energy", "growth", "leader", "innovation", "demand", "regulatory", "solar", "acquisition", "products", "solutions", "opportunities", "clean", "challenges", "market", "storage", "health"], "sentiment": "positive", "upside": -183.4, "linked": ["ENVX : Enovix Corporation (ENVX) is a pioneer in the battery industry with a strong financial track record and innovative energy storage solutions, founded in 2009 and listed on the NASDAQ since 2020."], "volume": 17331664.0, "introduction": "Sunrun Inc., a leading provider of residential solar energy solutions, faces challenges and opportunities as it navigates the complex landscape of market opportunities and regulatory challenges, despite having a weak financial health score.", "update": "2025-03-12", "current": 10.23, "category": "stock"}, {"company": "CVS Health Corp", "symbol": "CVS", "statement": "CVS is opening a new format of smaller stores that focus only on pharmacy services, with limited retail options. The company is planning to open 12 such stores, which will offer full-service pharmacies but fewer retail products. This move is part of CVS's efforts to adapt to changing consumer behavior and industry trends. The company has been closing larger stores and focusing on its pharmacy business, which accounted for 78.9% of its revenue in 2023. The new mini-stores are designed to provide a more streamlined experience for customers, with a focus on prescription services and health solutions.", "keywords": ["experience", "business", "behavior", "trends", "stores", "retail", "pharmacy", "services", "products", "mini-stores", "revenue", "consumer", "format", "solutions", "adaptation"], "sentiment": "positive", "upside": 82.7, "linked": [], "volume": 13082734.0, "introduction": "CVS is opening 12 smaller stores that focus solely on pharmacy services, offering full-service pharmacies with limited retail options, as part of its efforts to adapt to changing consumer behavior and industry trends.", "update": "2025-03-12", "current": 54.55, "category": "stock"}, {"company": "Red Cat Holdings Inc", "symbol": "RCAT", "statement": "Red Cat Holdings, Inc. is a Puerto Rico-based company that operates in the United States drone industry, offering products, services, and solutions to the enterprise, military, and consumer markets. The company provides integrated robotic hardware and software to provide critical situational awareness and actionable intelligence to on-the-ground warfighters, battle commanders, and firefighters. With a market capitalization of $385.97 million, Red Cat Holdings has received new orders worth $518,000 for its Edge 130 drones and has been initiated with an Outperform rating by Northland analyst Michael Latimore. The company has named a new CFO to drive strategic growth and has reported a wider-than-expected loss for its fourth-quarter 2024 earnings.", "keywords": ["rating", "growth", "situational", "earnings", "intelligence", "cfo", "drone", "capitalization", "enterprise", "orders", "firefighters", "industry", "military", "robotics", "puerto rico", "warfighters", "software", "analyst", "united states", "awareness", "hardware", "market", "consumer"], "sentiment": "negative", "upside": -127.7, "linked": ["ZI : ZoomInfo Technologies Inc. (NASDAQ: ZI) is a leading provider of market intelligence solutions for sales and marketing teams with strong financial performance and strategic initiatives, including AI integration, drawing analyst attention and interest."], "volume": 12865448.0, "introduction": "Red Cat Holdings, a Puerto Rico-based drone company, provides robotic hardware and software for situational awareness and actionable intelligence, with a market cap of $385.97 million and recent new orders and a new CFO appointment.", "update": "2025-03-12", "current": 8.63, "category": "stock"}, {"company": "Faraday Future Intelligent Electric Inc", "symbol": "FFIE", "statement": "Faraday Future Intelligent Electric Inc. (FFAI) is a California-based company that designs, develops, manufactures, engineers, sells, and distributes electric vehicles and related products in the US. The company's technology includes variable platform architecture, propulsion systems, and internet, autonomous driving, and intelligence systems. FFAI has announced that its ticker symbol will change from FFIE to FFAI on March 10, 2025, reflecting its strategic focus on AI-driven innovation and aligning with its FX brand strategy. The company is making progress in developing its All-AI Mobility Ecosystem, including Personalized AI and Bespoke AI initiatives.", "keywords": ["propulsion", "electric", "innovation", "platform", "mobility", "california", "bespoke", "ecosystem", "internet", "technology", "vehicles", "autonomous", "personalized", "ai", "intelligent", "us"], "sentiment": "positive", "upside": -2522.0, "linked": [], "volume": 9802119.0, "introduction": "Faraday Future Intelligent Electric Inc. (FFAI) is a California-based company that designs, develops, and sells electric vehicles and related products, with a focus on AI-driven innovation and a planned ticker symbol change to FFAI in 2025.", "update": "2025-03-12", "current": 1.45, "category": "stock"}, {"company": "Unity Software Inc", "symbol": "U", "statement": "Unity Software Inc. is a company that operates a platform for creating and growing interactive, real-time 3D content and experiences. Its software, including artificial intelligence (AI) solutions, supports creators through the entire development lifecycle as they build, run, and grow immersive, real-time 2D and 3D content for various devices. The company has a strong presence in the virtual reality (VR) ecosystem, with over 60% of the top-grossing VR experiences on Steam in 2023 developed using Unity's tools. Analysts consider Unity a leading VR stock for growth in 2023, and its AI and machine learning capabilities are driving innovation in game development.", "keywords": ["steam", "growth", "innovation", "platform", "experiences", "unity", "content", "ecosystem", "analysts", "solutions", "software", "vr", "ai", "development", "devices", "lifecycle"], "sentiment": "positive", "upside": -144.2, "linked": ["TGL : Treasure Global Inc. is a software company that provides an online-to-offline e-commerce platform and AI solutions, with a volatile stock price that has seen a 99.99% decline over the past two years."], "volume": 9501645.0, "introduction": "Unity Software Inc. is a leading platform for creating and growing interactive, real-time 3D content and experiences, with a strong presence in the virtual reality (VR) ecosystem and driving innovation in game development through its AI and machine learning capabilities.", "update": "2025-03-12", "current": 22.32, "category": "stock"}, {"company": "Coeur Mining Inc", "symbol": "CDE", "statement": "Coeur Mining, Inc. (CDE) is a diversified precious metals producer with five wholly-owned operations in North America. The company has transformed itself into a leading global silver and gold producer through strategic acquisitions and operational improvements. Analysts have given Coeur Mining a \"buy\" rating, and institutional investors and hedge funds own 63.01% of the company's stock. The company is expected to deliver record results in 2025, with production levels reaching over 400,000 ounces of gold.", "keywords": ["rating", "operations", "results", "funds", "acquisitions", "improvements", "mining", "analysts", "precious", "investors", "production", "metals"], "sentiment": "positive", "upside": -100.9, "linked": [], "volume": 7915112.0, "introduction": "Coeur Mining, Inc. is a leading global silver and gold producer with five North American operations, expected to deliver record results in 2025 with production exceeding 400,000 ounces of gold.", "update": "2025-03-12", "current": 6.33, "category": "stock"}, {"company": "Vertiv Holdings Co", "symbol": "VRT", "statement": "Vertiv, a company that provides data center and thermal management solutions, has introduced a new heat rejection system, the CoolLoop Trim Cooler, designed for hybrid liquid and air cooling for AI applications. The company has also reported its Q4 2024 earnings, with adjusted earnings and revenue increases, and has expanded its thermal management offerings. Additionally, Vertiv's stock price has experienced a 8.65% decrease in the last week, despite the launch of the new product. The company offers a range of products and services, including power management systems, thermal management products, and integrated rack systems, and operates globally.", "keywords": ["revenue", "cooling", "thermal", "rack", "stock", "earnings", "global", "management", "price", "center", "power", "products", "solutions", "systems", "services", "ai", "data"], "sentiment": "negative", "upside": -94.7, "linked": ["MRVL : Marvell Technology reported strong Q4 FY 2025 earnings, driven by 78% year-over-year growth in data center revenue, but its shares fell 24% over the past week."], "volume": 8507476.0, "introduction": "Vertiv has introduced a new heat rejection system, the CoolLoop Trim Cooler, for hybrid liquid and air cooling in AI applications, while reporting positive Q4 earnings and expanding its thermal management offerings.", "update": "2025-03-12", "current": 146.32, "category": "stock"}, {"company": "Ast Spacemobile Inc", "symbol": "ASTS", "statement": "AT&T, in partnership with AST SpaceMobile, successfully completed a video call from space without modifying the phone. AST SpaceMobile, a company that provides satellite-based broadband communication solutions, has been making headlines with its stock price and analyst ratings. The company's stock has been trading at $32.18 as of March 6th, with analysts predicting a strong 2025 forecast. AST SpaceMobile provides cellular broadband services to areas with limited terrestrial coverage, and its partnership with Vodafone and the University of Málaga has launched a new research and validation hub. The company's recent earnings call and business update highlighted its growth and progress.", "keywords": ["forecast", "stock", "growth", "video", "earnings", "coverage", "validation", "research", "broadband", "satellite", "communication", "spacemobile", "partnership", "call"], "sentiment": "positive", "upside": -125.1, "linked": [], "volume": 12003951.0, "introduction": "AT&T and AST SpaceMobile successfully completed a video call from space without modifying the phone, with AST SpaceMobile's stock trading at $32.18 and analysts predicting a strong 2025 forecast.", "update": "2025-03-12", "current": 20.35, "category": "stock"}, {"company": "Meta Platforms Inc", "symbol": "META", "statement": "Meta, the parent company of Facebook and Instagram, has unveiled its first in-house AI training chip, which is expected to revolutionize AI capabilities and position the company as a major player in the AI hardware industry. The chip is designed to increase efficiency and performance, and Meta plans to integrate it into its platforms to improve voice capabilities and introduce paid subscriptions and ads. The company is also testing its own AI chips, which could potentially disrupt the market and reduce its reliance on external suppliers like Nvidia.", "keywords": ["chip", "facebook", "efficiency", "voice", "training", "revolutionize", "subscriptions", "nvidia", "ads", "meta", "ai", "instagram", "capabilities", "performance"], "sentiment": "positive", "upside": -29.5, "linked": [], "volume": 19003096.0, "introduction": "Meta, the parent company of Facebook and Instagram, has developed its first in-house AI training chip, designed to increase efficiency and performance, and plans to integrate it into its platforms to improve voice capabilities and introduce paid subscriptions and ads.", "update": "2025-03-12", "current": 647.49, "category": "stock"}, {"company": "Boeing Co", "symbol": "BA", "statement": "Boeing is a leading aerospace company that designs and manufactures commercial and military aircraft, as well as space exploration systems. The company's materials, process, and physics engineers are at the forefront of innovation, improving production systems and creating high-performing materials. Boeing has a significant presence in Singapore, with a training facility that offers simulator training for various aircraft models. The company also provides defense and military rotorcraft solutions, and its CEO, Kelly Ortberg, received $18 million in compensation for his first five months on the job.", "keywords": ["military", "compensation", "aircraft", "innovation", "materials", "space", "physics", "defense", "training", "aerospace", "exploration", "ceo", "rotorcraft", "commercial", "simulation", "production"], "sentiment": "positive", "upside": -130.3, "linked": [], "volume": 9003419.0, "introduction": "Boeing is a leading aerospace company that designs and manufactures aircraft, space exploration systems, and defense solutions, with a significant presence in Singapore and a focus on innovation and high-performing materials.", "update": "2025-03-12", "current": 176.06, "category": "stock"}, {"company": "Host Hotels & Resorts Inc", "symbol": "HST", "statement": "Host Hotels & Resorts, Inc. is a real estate investment trust that owns and operates luxury and upper-upscale hotels in the US, Brazil, and Canada. As of December 2023, the company owned 77 hotels with approximately 42,000 rooms. The company is listed on Nasdaq and is a component of the S&P 500 index. The company has a dividend yield of 5.06% and has a history of paying dividends. The stock price has a 12-month target of $20.54, with an average estimate of a 30% increase from the current stock price.", "keywords": ["estimate", "upscale", "stock", "trust", "investment", "luxury", "hotels", "real", "target", "resorts", "price", "dividend", "nasdaq", "yield", "estate", "s&p"], "sentiment": "positive", "upside": 52.2, "linked": ["AGNC : AGNC Investment Corp, a real estate investment trust, has seen its stock price fluctuate, but has recently reached a 52-week high of $26.1, with a strong dividend yield and extended equity buyback plan."], "volume": 10220377.0, "introduction": "Host Hotels & Resorts, Inc. is a luxury hotel REIT with 77 hotels and a dividend yield of 5.06%, listed on Nasdaq and part of the S&P 500, with a projected 30% stock price increase within the next 12 months.", "update": "2025-03-12", "current": 16.94, "category": "stock"}, {"company": "Quantum-Si Inc", "symbol": "QSI", "statement": "Quantum-Si, a life science and diagnostic company, faces competition from established companies like Agilent, Bio-Rad, and Danaher. The company is set to showcase its Next-Generation Protein Sequencing technology at the US HUPO 2025 conference. Insiders have sold more company stock than they've bought in the past three months, with 30.04% of the stock held by insiders. The company's stock price has seen significant movement over the past year, and its trading range reflects this. Quantum-Si is advancing its technology, which is expected to have applications in medicine and other industries.", "keywords": ["insiders", "medicine", "danaher", "science", "life", "letmeknowifyou'dlikemetohelpwithanythingelse", "hupo", "biorad", "conference", "nextgeneration", "industry", "sequencing", "stock", "si", "diagnostic", "agilent", "competition", "quantum", "technology"], "sentiment": "positive", "upside": -207.6, "linked": [], "volume": 15093409.0, "introduction": "Quantum-Si, a life science and diagnostic company, is showcasing its Next-Generation Protein Sequencing technology at the US HUPO 2025 conference, but faces competition from established companies and has seen insider selling and volatile stock price movements.", "update": "2025-03-12", "current": 2.3, "category": "stock"}, {"company": "Bristol-Myers Squibb Co", "symbol": "BMY", "statement": "Bristol Myers Squibb (BMS) has secured several significant developments in recent days. The company received FDA approval for its Opdivo (nivolumab) in non-small cell lung cancer, becoming the only FDA-approved PD-1 inhibitor for the treatment. Additionally, BMS received FDA approval for its cardiomyopathy drug mavacamten, which can help treat a condition affecting 1 in 500 people in the US. The company also implemented a $1.5 billion cost-cutting plan and acquired cell therapy maker 2seventy bio for $286 million. Furthermore, BMS received European approval for its Opdivo-Yervoy combo therapy and secured an option on a tau protein-targeting antibody for Alzheimer's disease.", "keywords": ["nivolumab", "lung", "treatment", "opdivo", "alzheimer's", "bristol", "pd-1", "therapy", "cell", "fda", "myers", "squibb", "plan", "cardiomyopathy", "acquisition", "combo", "drug", "cancer", "cost-cutting", "approval", "inhibitor"], "sentiment": "positive", "upside": -130.0, "linked": [], "volume": 12325724.0, "introduction": "Bristol Myers Squibb (BMS) has secured several significant developments, including FDA approvals for Opdivo in non-small cell lung cancer and cardiomyopathy drug mavacamten, as well as a cost-cutting plan, acquisition, and European approval for Opdivo-Yervoy combo therapy.", "update": "2025-03-12", "current": 59.67, "category": "stock"}, {"company": "Freeport-McMoRan Inc", "symbol": "FCX", "statement": "Freeport-McMoRan Inc., a copper miner, may benefit from Trump declaring copper a critical mineral, according to CERAWEEK. The company's stock (FCX) has shown positive chart developments, according to J.P. Morgan's technical team. However, investors should be cautious as the company recently missed earnings expectations and its stock has declined 1.3%. Freeport-McMoRan operates mines in the US, Peru, Chile, Indonesia, and Congo, and its dividend yield is 0.84%. The company has a market cap of $58.84 billion and has been experiencing a decline in its stock price.", "keywords": ["technical", "stock", "earnings", "trump", "miner", "cap", "dividend", "critical", "chart", "market", "yield", "copper"], "sentiment": "negative", "upside": -7.8, "linked": [], "volume": 18222910.0, "introduction": "Freeport-McMoRan Inc., a copper miner, may benefit from Trump's declaration of copper as a critical mineral, but its stock has declined 1.3% after missing earnings expectations.", "update": "2025-03-12", "current": 37.81, "category": "stock"}, {"company": "ChargePoint Holdings Inc", "symbol": "CHPT", "statement": "ChargePoint Holdings (CHPT) recently released its quarterly earnings, missing analysts' estimates by $0.01 per share. Despite this, the company's robust partnerships, innovative anti-vandalism solutions, and broad market reach position it for long-term growth. Analysts have lowered their price target to $1 from $2, citing concerns about the company's profitability. However, with its growth prospects and premium valuation, some believe the company is still a good pick. The company's recent quarterly revenue was $101.89 million, beating estimates of $100.99 million.", "keywords": ["growth", "earnings", "innovation", "valuation", "analysts", "estimates", "solutions", "revenue", "quarterly", "partnerships"], "sentiment": "positive", "upside": -453.8, "linked": [], "volume": 23508516.0, "introduction": "ChargePoint Holdings' quarterly earnings missed estimates by $0.01 per share, but its strong partnerships, innovative solutions, and market reach position it for long-term growth, despite analysts lowering their price target to $1.", "update": "2025-03-12", "current": 1.0, "category": "stock"}, {"company": "3D Systems Corp", "symbol": "DDD", "statement": "3D Systems, a leading player in additive manufacturing, has launched its new EXT 800 Titan Pellet printer, which features pellet extrusion technology and large-format 3D printing capabilities. The company has a rich history of pioneering innovations and has been at the forefront of the printing revolution. 3D Systems provides comprehensive 3D printing and digital manufacturing solutions, including 3D printers, materials, software, and services. The company has reported a negative net margin and trailing twelve-month return on equity, but continues to push the boundaries of what is possible with 3D printing.", "keywords": ["revolution", "additive", "printing", "innovation", "printer", "manufacturing", "technology", "margin", "solutions", "equity"], "sentiment": "positive", "upside": -592.7, "linked": [], "volume": 10724781.0, "introduction": "3D Systems, a leading additive manufacturing company, has launched the EXT 800 Titan Pellet printer, a large-format 3D printer featuring pellet extrusion technology, as part of its comprehensive 3D printing and digital manufacturing solutions.", "update": "2025-03-12", "current": 3.85, "category": "stock"}, {"company": "Pinterest Inc", "symbol": "PINS", "statement": "Pinterest is exploring Generative AI (GenAI) technology to drive innovation and creativity, using it to create engaging ads and improve campaign performance. The company is also building a text-to-image AI model, Pinterest Canvas, to enhance existing images and products on the platform. Additionally, Pinterest is labeling generative AI content and using the IPTC Photo Metadata Standard to provide more information about image editing processes and tools used in image creation. The company's user demographics and popular niches are diverse, with over half a billion monthly active users worldwide.", "keywords": ["diversity", "standard", "users", "creativity", "innovation", "canvas", "metadata", "products", "ads", "images", "performance"], "sentiment": "positive", "upside": -95.1, "linked": [], "volume": 12530499.0, "introduction": "Pinterest is exploring Generative AI technology to drive innovation and creativity, creating engaging ads and enhancing images with its text-to-image AI model Pinterest Canvas, while also labeling and providing metadata for AI-generated content.", "update": "2025-03-12", "current": 32.9, "category": "stock"}, {"company": "Ke Holdings Inc", "symbol": "BEKE", "statement": "KE Holdings Inc. (NYSE:BEKE) is a Chinese company operating an integrated online and offline platform for housing transactions and services. Analysts and investors are bullish on the company, citing its well-positioned business model to benefit from China's real estate market. KE Holdings has seen increased investor interest, with large purchases of its shares and options. The company is set to report its third-quarter financial results on November 21, 2024. Analysts predict an average target price of $25.97, with a high estimate of $33, representing a 7.05% increase from the current stock price.", "keywords": ["estimate", "platform", "results", "options", "transactions", "real estate", "price", "analysts", "company", "services", "market", "investors", "shares", "target"], "sentiment": "positive", "upside": -98.7, "linked": ["TAL : TAL Education Group, a Chinese company providing K-12 after-school tutoring services, has seen stock price growth, strong earnings, and increased institutional investor interest, with analysts predicting a 13.50% price increase over the next 12 months."], "volume": 8045934.0, "introduction": "KE Holdings Inc., a Chinese company operating an online and offline platform for housing transactions and services, is expected to report strong quarterly results and sees its stock price increasing by 7.05% to $25.97, according to analysts.", "update": "2025-03-12", "current": 17.11, "category": "stock"}, {"company": "Quantumscape Corp", "symbol": "QS", "statement": "QuantumScape, a company at the forefront of solid-state battery technology, has sufficient liquidity until the second half of 2028. The company has received attention from investors, including Bill Gates and Volkswagen, since its founding in 2010. QuantumScape's technology aims to provide greater energy density, faster charging, and enhanced safety for electric vehicles and other applications. The company has reported financial results and will host a live webcast to discuss its quarterly results and business update. With a strong team and sufficient liquidity, QuantumScape is well-positioned to drive innovation in the electric vehicle industry.", "keywords": ["financial", "energy", "safety", "webcast", "results", "bill", "quantumscape", "vehicles", "investors", "density", "charging", "applications", "gates", "innovation", "liquidity", "battery", "update", "volkswagen", "technology"], "sentiment": "positive", "upside": -190.1, "linked": [], "volume": 10445177.0, "introduction": "QuantumScape, a solid-state battery technology company, has sufficient liquidity until mid-2028 and is poised to drive innovation in the electric vehicle industry with its technology providing greater energy density, faster charging, and enhanced safety.", "update": "2025-03-12", "current": 5.16, "category": "stock"}, {"company": "Altus Midstream Co", "symbol": "ALTM", "statement": "Midstream companies are investing in export capacity expansion at Gulf Coast terminals to meet growing global demand for US hydrocarbons, particularly LNG and NGLs. Altus Midstream has received a consensus rating of Hold, while Plains All American Pipeline and Phillips 66 have announced major deals worth $725 million and $2.2 billion, respectively. The Permian Basin is seeing significant investment in midstream infrastructure, and Altus Midstream has completed several solar projects. The Williams Companies, Inc. is a midstream company with operations in the Marcellus and Utica Shale regions.", "keywords": ["terminals", "utica", "demand", "williams", "lng", "marcellus", "permian", "solar", "investing", "midstream", "basin", "deals", "hydrocarbons", "infrastructure", "ngls", "shale", "hold", "export", "altus", "expansion", "capacity"], "sentiment": "positive", "upside": -37.3, "linked": [], "volume": 19341980.0, "introduction": "Midstream companies are investing in export capacity expansions at Gulf Coast terminals to meet growing global demand for US hydrocarbons, particularly LNG and NGLs.", "update": "2025-03-12", "current": 5.75, "category": "stock"}, {"company": "Patterson-UTI Energy Inc", "symbol": "PTEN", "statement": "Patterson-UTI Energy (PTEN) reported a disappointing Q4 2024, with revenue down 24.1% YoY to $1.2 billion and EPS of -$0.13, missing estimates. The company's stock price has been impacted, down 14.7% since the earnings report. Despite this, analysts expect earnings to grow in the coming year, from ($0.10) to $0.17 per share. The company provides land-based drilling services to oil and gas companies in the US and internationally, and its stock price is currently trading at a P/E ratio of -3.04, indicating negative earnings.", "keywords": ["energy", "growth", "stock", "earnings", "price", "analysts", "estimates", "services", "revenue", "ratio", "report", "companies"], "sentiment": "negative", "upside": -501.5, "linked": ["KOS : Kosmos Energy Ltd, an oil and gas exploration and production company with a diversified portfolio, missed earnings estimates but has a strong cash position and potential for future growth, making it a recommended buy."], "volume": 8393117.0, "introduction": "Patterson-UTI Energy reported a disappointing Q4 2024 with revenue down 24.1% YoY and EPS of -$0.13, sending its stock price down 14.7%, but analysts expect earnings to grow to $0.17 per share in the coming year.", "update": "2025-03-12", "current": 8.75, "category": "stock"}, {"company": "Chipotle Mexican Grill Inc", "symbol": "CMG", "statement": "Chipotle Mexican Grill has introduced a new limited-time menu item, Honey Chicken, available in North America and the UK starting March 7. The protein option combines the smoky heat of chipotle peppers with the sweetness of pure wildflower honey, and customers can customize it in tacos, burritos, salads, and quesadillas. The company has hired 20,000 additional workers to meet increased demand during \"burrito season\" and is available in over 3,500 restaurants worldwide.", "keywords": ["sweetness", "demand", "honey", "limited", "quesadillas", "company", "time", "mexican", "workers", "uk", "wildflower", "grill", "america", "tacos", "chipotle", "north", "restaurants", "protein", "menu", "salads", "march", "chicken", "pure", "heat", "burritos"], "sentiment": "positive", "upside": -52.0, "linked": [], "volume": 11113387.0, "introduction": "Chipotle Mexican Grill has introduced a limited-time Honey Chicken menu item, combining smoky chipotle peppers with pure wildflower honey, available in North America and the UK starting March 7.", "update": "2025-03-12", "current": 56.7, "category": "stock"}, {"company": "Johnson & Johnson", "symbol": "JNJ", "statement": "The article discusses various individuals and entities named Johnson. Lyndon B. Johnson, the 36th President of the United States, initially sought to run for re-election in 1968 but withdrew after disappointing primary results. He later retired to his Texas ranch and kept a low profile until his death in 1973. In contrast, Mike Johnson, the current Speaker of the US House of Representatives, has been actively involved in politics, defending Tesla owners against attacks and introducing bills to fund the government. Johnson & Johnson, a multinational pharmaceutical and medical technology company, has a history dating back over 125 years and is currently ranked 40th on the Fortune 500 list.", "keywords": ["united", "fortune", "texas", "pharmaceutical", "president", "states", "technology", "johnson", "politics"], "sentiment": "positive", "upside": -51.4, "linked": [], "volume": 9885562.0, "introduction": "The article discusses various individuals and entities named Johnson, including politicians Lyndon B. Johnson and Mike Johnson, as well as the multinational company Johnson & Johnson.", "update": "2025-03-12", "current": 146.82, "category": "stock"}, {"company": "KeyCorp", "symbol": "KEY", "statement": "KeyCorp is a financial services company with assets over $180 billion, operating in 16 states, primarily in Ohio and New York. The company provides a range of banking and financial solutions to individuals, small and medium-sized businesses, and large corporations. KeyCorp has a 1-year low of $13.11 and a 1-year high of $20.04, with a debt-to-equity ratio of 0.77 and a current ratio of 0.85. The company has announced a quarterly dividend and has a strong presence in its two largest markets, Ohio and New York.", "keywords": ["financial", "presence", "banking", "individuals", "assets", "corporations", "company", "solutions", "businesses", "services", "dividend"], "sentiment": "positive", "upside": -104.6, "linked": ["JPM : JPMorgan Chase & Co. is a multinational financial services firm providing investment banking, consumer and commercial banking services, with a market capitalization of over $400 billion and a strong presence in the financial industry."], "volume": 11064423.0, "introduction": "KeyCorp is a financial services company with $180 billion in assets, operating in 16 states, primarily Ohio and New York, providing banking and financial solutions to individuals, businesses, and corporations.", "update": "2025-03-12", "current": 17.68, "category": "stock"}, {"company": "JPMorgan Chase & Co", "symbol": "JPM", "statement": "JPMorgan Chase & Co. is a multinational financial services firm headquartered in New York City, founded in 2000 by the merger of J.P. Morgan & Co. and Chase Manhattan Company. The company provides financial and investment banking services, with a focus on investment banking, financial services for consumers and small businesses, and commercial banking. The company has a market capitalization of over $400 billion and is considered systemically important by the Financial Stability Board. The CEO, Jamie Dimon, has defended his stance against remote work, stating that it \"doesn't work in our business.\" The company has appointed new co-heads of its commercial banking division and has a strong presence in the financial industry, with over 4,966 banking agencies and $4.0 trillion in assets.", "keywords": ["financial", "banking", "company", "services", "assets", "capitalization", "commercial", "agencies", "investment", "business", "consumers", "multinational", "stability", "ceo", "important", "remote", "board", "firm", "merger", "work", "stance", "businesses", "market"], "sentiment": "positive", "upside": 15.0, "linked": ["KEY : KeyCorp is a financial services company with $180 billion in assets, operating in 16 states, primarily Ohio and New York, providing banking and financial solutions to individuals, businesses, and corporations."], "volume": 7630012.0, "introduction": "JPMorgan Chase & Co. is a multinational financial services firm providing investment banking, consumer and commercial banking services, with a market capitalization of over $400 billion and a strong presence in the financial industry.", "update": "2025-03-12", "current": 264.84, "category": "stock"}, {"company": "Core Scientific Inc", "symbol": "CORZ", "statement": "Jordan Levy, a director at Core Scientific, Inc. (NASDAQ:CORZ), purchased 62,500 shares of the company's stock at an average price of $8.01 per share, worth $500,625. The company provides digital asset mining services and operates data center space facilities. Core Scientific's revenue increased 1.65% in 2024 to $510.67 million, but losses widened to -$1.12 billion. The company's stock price has been boosted by its shift towards artificial intelligence and bitcoin mining. Insiders have sold more shares than they've bought in the past three months, with 32% of the stock held by insiders.", "keywords": ["revenue", "losses", "insiders", "stock", "artificial", "facilities", "intelligence", "price", "bitcoin", "mining", "company", "services", "nasdaq", "shares", "director"], "sentiment": "positive", "upside": -236.4, "linked": [], "volume": 11035888.0, "introduction": "Jordan Levy, a director at Core Scientific, purchased 62,500 shares of the company's stock at $8.01 per share, worth $500,625, amid the company's growth in revenue and shift towards artificial intelligence and bitcoin mining.", "update": "2025-03-12", "current": 16.34, "category": "stock"}, {"company": "Under Armour Inc", "symbol": "UAA", "statement": "Under Armour has grown from a small T-shirt company to a global leader in performance apparel, footwear, and accessories. The company has developed a new testing methodology to measure fiber shedding and aims to make 75% of its fabrics low-shed materials by 2030. Under Armour offers a range of products, including athletic wear, footwear, and accessories, and sells them through various channels, including wholesale and direct-to-consumer sales. The company has announced a new methodology to measure fiber shedding and has a sustainability goal to reduce shedding in its products.", "keywords": ["footwear", "accessories", "sales", "direct-to-consumer", "shedding", "fiber", "wholesale", "2030", "athletic", "apparel", "sustainability", "methodology", "low-shed", "performance"], "sentiment": "positive", "upside": -102.9, "linked": [], "volume": 8181621.0, "introduction": "Under Armour has grown from a small company to a global leader in performance apparel, footwear, and accessories, with a goal to reduce fiber shedding in its products by 75% by 2030.", "update": "2025-03-12", "current": 8.42, "category": "stock"}, {"company": "Microchip Technology Inc", "symbol": "MCHP", "statement": "Microchip Technology has unveiled a new 32-bit MCU family with integrated high-speed analog peripherals and a 200 MHz CPU, designed for cost-effective system-level solutions. The PIC32A MCU family is suitable for applications such as AI, automotive, and medical technology, with high-speed analog and 64-bit FPU for math-heavy tasks. The company has also launched new PIC32A MCUs for AI, auto, and medical tech with high-speed analog and 64-bit FPU for math-heavy tasks, offering cost-efficient performance.", "keywords": ["automotive", "medical", "analog", "performance", "technology", "cpu", "fpu", "ai", "mcu", "microchip", "peripherals"], "sentiment": "positive", "upside": -35.5, "linked": [], "volume": 10295832.0, "introduction": "Microchip Technology has introduced a new 32-bit MCU family, the PIC32A, featuring high-speed analog peripherals and a 200 MHz CPU, designed for cost-effective solutions in AI, automotive, and medical technology applications.", "update": "2025-03-12", "current": 56.39, "category": "stock"}, {"company": "Nikola Corporation", "symbol": "NKLA", "statement": "Nikola Corporation, a technology innovator and integrator, has won permission to auction its 691,000-square-foot manufacturing facility in Coolidge, Arizona, which could appeal to buyers interested in moving production to the US. The company operates in two business units: Truck and Energy, commercializing battery electric and hydrogen fuel cell electric vehicles for the trucking sector. Nikola's stock price and financials are publicly available, showing a decrease in revenue and a pending Chapter 11 bankruptcy. The company is evaluating options and has won permission to auction its Arizona facility, which creditors believe could be valuable to automakers amid looming auto tariffs.", "keywords": ["energy", "finance", "trucks", "innovation", "auction", "bankruptcy", "tariffs", "manufacturing", "technology", "vehicles", "facility"], "sentiment": "negative", "upside": -4215.4, "linked": [], "volume": 41875224.0, "introduction": "Nikola Corporation, a technology company with a manufacturing facility in Arizona, has won permission to auction its 691,000-square-foot facility, which could appeal to buyers interested in moving production to the US amid looming auto tariffs.", "update": "2025-03-12", "current": 0.91, "category": "stock"}, {"company": "Treasure Global Inc", "symbol": "TGL", "statement": "Treasure Global Inc. (TGL) is a company that provides software solutions, including an online-to-offline e-commerce platform for cashless shopping. The company has seen its stock price fluctuate, with a 52-week high of $8.69 and a 52-week low of $0.11, and has reported negative earnings and revenue growth. Despite this, the company has received attention for its innovative AI solutions and has been included in lists of top AI companies. Treasure Global's stock is listed on the NASDAQ and has seen significant volatility, with a return of -99.99% over the past two years.", "keywords": ["cashless", "growth", "stock", "earnings", "platform", "innovation", "volatility", "price", "ai", "technology", "solutions", "software", "fluctuate", "revenue", "shopping", "e-commerce"], "sentiment": "negative", "upside": -532.4, "linked": ["U : Unity Software Inc. is a leading platform for creating and growing interactive, real-time 3D content and experiences, with a strong presence in the virtual reality (VR) ecosystem and driving innovation in game development through its AI and machine learning capabilities."], "volume": 7637105.0, "introduction": "Treasure Global Inc. is a software company that provides an online-to-offline e-commerce platform and AI solutions, with a volatile stock price that has seen a 99.99% decline over the past two years.", "update": "2025-03-12", "current": 0.21, "category": "stock"}, {"company": "CSX Corp", "symbol": "CSX", "statement": "CSX Corporation, a leading rail-based freight transportation company with a market capitalization of $56 billion, is navigating a complex landscape. The company has launched a new online site selection tool to help growing companies find rail-served properties and communities competing for economic development projects. CSX also provides rail, intermodal, and rail-to-truck transload services and solutions to customers across various markets. The company has a strong institutional backing with 79% ownership and has made recent changes to its leadership, including the appointment of a new CIO.", "keywords": ["selection", "market", "institutional", "freight", "leadership", "capitalization", "transportation", "projects", "online", "services", "solutions", "landscape", "rail", "markets", "communities", "properties", "development", "cio"], "sentiment": "positive", "upside": -71.3, "linked": [], "volume": 24741722.0, "introduction": "CSX Corporation, a $56 billion rail-based freight transportation company, has launched an online site selection tool to help growing companies find rail-served properties and communities compete for economic development projects.", "update": "2025-03-12", "current": 32.69, "category": "stock"}, {"company": "Chevron Corp", "symbol": "CVX", "statement": "Chevron Corporation is a multinational energy company that has been in operation since 1879. The company has a significant presence in the United States, with operations in the Permian Basin and refineries and service stations across the country. Chevron is a leader in enhanced oil recovery (EOR) technology, using carbon dioxide as a working fluid to extract more oil from existing wells. The company has a diverse range of businesses, including refining, marketing, and distributing crude oil and refined products, as well as exploring and drilling for oil and gas. With a history dating back over 140 years, Chevron has evolved to become a global energy giant with operations in over 180 countries and a workforce of over 42,500 people.", "keywords": ["energy", "exploring", "operation", "marketing", "leader", "refining", "workforce", "extract", "crude", "united", "global", "fluid", "multinational", "states", "products", "corporation", "presence", "distributing", "carbon", "drilling", "technology", "history", "eor", "giant"], "sentiment": "positive", "upside": 18.4, "linked": [], "volume": 7910689.0, "introduction": "Chevron Corporation is a multinational energy company with a 140-year history, operating in over 180 countries, and engaged in a diverse range of businesses including refining, marketing, and drilling for oil and gas, with a focus on enhanced oil recovery technology.", "update": "2025-03-12", "current": 155.65, "category": "stock"}, {"company": "Permian Resources Corp", "symbol": "PR", "statement": "Oil companies in the Permian Basin are investing in water management and recycling to sustain operations and explore new technologies. Permian Resources Corporation (PR) is one such company, which has been prioritizing water management strategies. The company's stock price has been performing well, with a consensus rating of \"Buy\" from 17 Wall Street analysts. The Permian Basin is experiencing a resurgence in oil and gas production, with operators preparing for the future through mergers, acquisitions, and partnerships. Phillips 66 is doubling down on the Permian Basin, investing in midstream infrastructure and expanding its presence in the region.", "keywords": ["rating", "recycling", "permian", "price", "acquisitions", "resources", "midstream", "oil", "water", "stock", "basin", "operators", "production", "sustainability", "resurgence", "infrastructure", "corporation", "consensus", "management", "exploration", "mergers", "technology", "analysts", "expansion", "partnerships", "buy"], "sentiment": "positive", "upside": -58.2, "linked": [], "volume": 8529477.0, "introduction": "Oil companies in the Permian Basin are investing in water management and recycling to sustain operations and explore new technologies, with Permian Resources Corporation's stock performing well and Phillips 66 expanding its presence in the region.", "update": "2025-03-12", "current": 15.22, "category": "stock"}, {"company": "Kosmos Energy Ltd", "symbol": "KOS", "statement": "Kosmos Energy Ltd (KOS) is an independent oil and gas exploration and production company founded in 2003. The company has a diversified portfolio of production projects offshore Ghana, Equatorial Guinea, and the Gulf of Mexico, as well as gas projects in Mauritania and Senegal. In its latest earnings report, Kosmos missed analyst estimates with a loss of $0.01 per share, but has a net margin of 12.21% and a return on equity of 31.08%. Despite this, analysts recommend buying the company's stock, citing its strong cash position and potential for future growth.", "keywords": ["energy", "growth", "margin", "ghana", "company", "report", "return", "earnings", "gas", "cash", "estimates", "equity", "oil", "mexico", "stock", "guinea", "equatorial", "gulf", "recommend", "loss", "buying", "mauritania", "exploration", "senegal", "analysts", "projects", "portfolio", "production"], "sentiment": "positive", "upside": -32.6, "linked": ["PTEN : Patterson-UTI Energy reported a disappointing Q4 2024 with revenue down 24.1% YoY and EPS of -$0.13, sending its stock price down 14.7%, but analysts expect earnings to grow to $0.17 per share in the coming year."], "volume": 15448627.0, "introduction": "Kosmos Energy Ltd, an oil and gas exploration and production company with a diversified portfolio, missed earnings estimates but has a strong cash position and potential for future growth, making it a recommended buy.", "update": "2025-03-12", "current": 3.43, "category": "stock"}, {"company": "Uranium Energy Corp", "symbol": "UEC", "statement": "Uranium Energy Corp (UEC) has filed its quarterly report for the second quarter, highlighting progress in production, acquisitions, and project development. The company has produced its first batch of Wyoming yellowcake uranium and is ramping up production capacity in the Cowboy State. UEC has also advanced uranium concentrate drying and drumming in Wyoming and accelerated construction at its Burke Hollow ISR project in Texas. The company has also acquired Rio Tinto's Sweetwater Plant and is exploring for uranium and titanium concentrates in the US, Canada, and Paraguay.", "keywords": ["energy", "plant", "construction", "development", "report", "project", "texas", "corp", "acquisitions", "wyoming", "ramping", "yellowcake", "paraguay", "quarterly", "titanium", "isr", "exploration", "uranium", "capacity", "production"], "sentiment": "positive", "upside": -104.3, "linked": ["LITM : Snow Lake Energy has entered into a 50/50 joint venture with Global Uranium and Enrichment Limited to acquire the Pine Ridge Uranium Project in Wyoming's Powder River Basin for $22.5 million."], "volume": 9015665.0, "introduction": "Uranium Energy Corp (UEC) has reported progress in production, acquisitions, and project development, including producing its first batch of Wyoming yellowcake uranium and advancing projects in Wyoming and Texas.", "update": "2025-03-12", "current": 8.01, "category": "stock"}, {"company": "Stem Inc", "symbol": "STEM", "statement": "Stem, Inc. is a company that offers energy storage solutions and software and edge hardware devices. The company's stock (STEM) has been fluctuating, with a recent earnings report beating analysts' estimates. Stem has made management changes, including appointing a new President of Managed Services. The company's stock price forecast is bearish, with a recent analyst downgrade and a predicted 11% improvement in sales in 2025. The average price target is $1.11, representing a 150.82% increase from the current price of $0.44.", "keywords": ["downgrade", "energy", "forecast", "stock", "earnings", "sales", "management", "price", "estimates", "solutions", "software", "services", "hardware", "report", "president", "storage", "devices", "target"], "sentiment": "negative", "upside": -3403.1, "linked": [], "volume": 15912758.0, "introduction": "Stem, Inc. is an energy storage solutions company with fluctuating stock and recent management changes, with a bearish forecast and a predicted 11% sales improvement in 2025.", "update": "2025-03-12", "current": 0.78, "category": "stock"}, {"company": "Carrier Global Corp", "symbol": "CARR", "statement": "Carrier Global Corporation has launched its first Environmental Product Declaration (EPD) for residential HVAC solutions in North America, marking a commitment to sustainability and transparency. The company's Chairman & CEO and CFO will also present at the Bank of America Global Industrials Conference in London, where they may reveal a new growth strategy. Additionally, Carrier has opened a new Middle East Experience Center in Dammam, featuring its latest HVAC products and solutions. The company is a global leader in intelligent climate and energy solutions, providing innovative heating, ventilating, and air conditioning products and services.", "keywords": ["conference", "carrier", "hvac", "epd", "north america", "bank", "growth", "middle east", "experience", "innovation", "climate", "energy", "center", "strategy", "london", "transparency", "sustainability"], "sentiment": "positive", "upside": -70.2, "linked": [], "volume": 7709898.0, "introduction": "Carrier Global Corporation has launched its first Environmental Product Declaration for residential HVAC solutions in North America, opened a new Middle East Experience Center, and will present at the Bank of America Global Industrials Conference.", "update": "2025-03-12", "current": 69.88, "category": "stock"}, {"company": "Valley National Bancorp", "symbol": "VLY", "statement": "Valley National Bank's Learning and Talent Development Team has been honored with an award, reinforcing the bank's dedication to excellence in learning and development. Valley National Bank, a regional bank with over $62 billion in assets, operates through Consumer Banking, Commercial Banking, and Treasury and Corporate segments. The holding company, Valley National Bancorp (VLY), has reported net income for the fourth quarter 2024 of $115.7 million and pays a dividend yield of 4.58%, ranking in the top 25% of dividend-paying stocks. The company provides various financial services products, including commercial, private banking, retail, insurance, and wealth management.", "keywords": ["financial", "bank", "services", "development", "award", "corporate", "treasury", "learning", "assets", "wealth", "commercial", "dedication", "excellence", "insurance", "products", "yield", "regional", "talent", "dividend"], "sentiment": "positive", "upside": -12.9, "linked": [], "volume": 10078324.0, "introduction": "Valley National Bank's Learning and Talent Development Team received an award, highlighting the bank's commitment to excellence in learning and development, while the bank itself operates with $62 billion in assets and offers various financial services products.", "update": "2025-03-12", "current": 10.17, "category": "stock"}, {"company": "Macy's Inc", "symbol": "M", "statement": "Good American, a global brand co-founded by Khloé Kardashian and Emma Grede, is launching at Macy's in 36 doors for the Spring 2025 season, expanding to 79 doors by Fall 2025. This partnership marks a significant milestone for the brand, reaching millions of customers. Meanwhile, Macy's is revamping its stores, closing underperforming locations, and focusing on omnichannel customer experiences, contributing to a 0.2% comp gain in Q4 2024, its highest quarterly comp growth in over a decade.", "keywords": ["experience", "growth", "celebrity", "sales", "omnichannel", "comp", "expansion", "retail", "customer", "fashion", "quarterly", "partnership", "entrepreneurship", "e-commerce", "brand"], "sentiment": "positive", "upside": -80.1, "linked": [], "volume": 8224308.0, "introduction": "Good American, a brand co-founded by Khloé Kardashian and Emma Grede, is expanding its partnership with Macy's, launching in 36 doors for Spring 2025 and growing to 79 doors by Fall 2025, reaching millions of customers.", "update": "2025-03-12", "current": 15.36, "category": "stock"}, {"company": "EVgo Inc", "symbol": "EVGO", "statement": "EVgo, a leading provider of electric vehicle (EV) charging infrastructure, has opened its first fast charging stations deployed through Toyota's \"Empact\" vision in California. The stations, owned and operated by EVgo, feature 350kW fast chargers and can serve up to eight vehicles simultaneously. The partnership aims to expand EVgo's nationwide fast charging network, which currently operates over 1,100 stations across 40 states.", "keywords": ["charging", "electric", "empact", "toyota", "provider", "california", "fast", "stations", "vehicle", "network", "partnership", "infrastructure"], "sentiment": "positive", "upside": -121.3, "linked": [], "volume": 7932631.0, "introduction": "EVgo, a leading EV charging provider, has opened its first fast charging stations in California, featuring 350kW chargers that can serve up to eight vehicles at once, as part of a partnership with Toyota's \"Empact\" vision to expand its nationwide network.", "update": "2025-03-12", "current": 3.44, "category": "stock"}, {"company": "Nano Nuclear Energy Inc", "symbol": "NNE", "statement": "NANO Nuclear Energy Inc. (NNE) is a leading advanced nuclear energy and technology company focused on developing clean energy solutions. The company has expanded its regulatory and safety expertise with the addition of Andrew Steer, Ph.D., a recognized specialist in safety case development, as its Head of Regulatory Engagement. NNE has also appointed Florent Heidet, Ph.D. as its Chief Technology Officer and Head of Reactor Development, a world-renowned expert on advanced reactor design. The company has filed four utility patent applications with the United States Patent and Trademark Office and has collaborated with Digihost Technology Inc. on a project to develop cutting-edge data centers.", "keywords": ["energy", "safety", "reactor", "data", "regulatory", "technology", "design", "nuclear", "patent", "development", "clean", "centers", "expertise"], "sentiment": "positive", "upside": -103.4, "linked": [], "volume": 12122096.0, "introduction": "NNE, a leading advanced nuclear energy and technology company, has appointed two experts in their respective fields, Andrew Steer and Florent Heidet, to drive its regulatory and technology development, and has filed patent applications and collaborated with Digihost Technology Inc.", "update": "2025-03-12", "current": 44.51, "category": "stock"}, {"company": "Schlumberger NV", "symbol": "SLB", "statement": "Schlumberger is a global technology company that operates in four segments: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides technology and services to the energy industry, with a focus on digital solutions and data products. According to recent data, Schlumberger's automated drilling solution, DrillOps Automate, has improved drilling operations in the Middle East. The company is listed on the NYSE as SLB and has a market capitalization of $56.509B.", "keywords": ["energy", "market", "operations", "drilling", "technology", "capitalization", "digital", "solutions", "products", "data", "automation"], "sentiment": "positive", "upside": 86.9, "linked": [], "volume": 18999390.0, "introduction": "Schlumberger is a global technology company that provides digital solutions and data products to the energy industry, operating in four segments and listed on the NYSE with a market capitalization of $56.509B.", "update": "2025-03-12", "current": 42.25, "category": "stock"}, {"company": "Eos Energy Enterprises Inc", "symbol": "EOSE", "statement": "Eos Energy Enterprises, a New Jersey-based startup, has developed a zinc battery that can store energy for 3-12 hours. The company's Z3 battery module is designed for utilities, renewable developers, and commercial customers, offering an alternative to lithium-ion and lead-acid batteries. Eos expects a tenfold revenue increase in 2025, with revenues reaching $15.6 million in 2024. The company's zinc-based energy storage solutions are designed for utility-scale, microgrid, and commercial applications, with a flagship product, the Eos Znyth DC battery system.", "keywords": ["energy", "utility", "lithium", "zinc", "increase", "lead", "million", "applications", "renewable", "system", "solutions", "commercial", "revenue", "battery", "storage", "acid", "startup"], "sentiment": "positive", "upside": -273.2, "linked": [], "volume": 7658519.0, "introduction": "Eos Energy Enterprises, a New Jersey-based startup, has developed a zinc battery that can store energy for 3-12 hours and is designed for utilities, renewable developers, and commercial customers, with expected revenue growth to $15.6 million in 2024.", "update": "2025-03-12", "current": 6.08, "category": "stock"}, {"company": "Occidental Petroleum Corp", "symbol": "OXY", "statement": "Occidental Petroleum Corporation (OXY) is attracting investor attention, with a projected 38.5% increase in earnings per share for the current quarter. The company has a strong dividend yield of 1.93%, and institutional investors and hedge funds own 88.7% of its shares. OXY's stock price has fluctuated, rising 3.4% to $47.26, with a 1-year low of $45.71. The company's dividend payout ratio is at a healthy 39.34%, and analysts expect it to post EPS of $0.90.", "keywords": ["increase", "earnings", "fluctuated", "price", "analysts", "investors", "dividend", "eps", "shares", "yield"], "sentiment": "positive", "upside": -52.6, "linked": [], "volume": 12464546.0, "introduction": "Occidental Petroleum Corporation (OXY) is attracting investors with a projected 38.5% increase in earnings per share, strong dividend yield, and institutional ownership, with a current stock price of $47.26.", "update": "2025-03-12", "current": 49.29, "category": "stock"}, {"company": "PainReform Ltd", "symbol": "PRFX", "statement": "PainReform, a clinical-stage specialty pharmaceutical company, has completed the acquisition of DeepSolar and announced a new manufacturing process that achieves significant benefits, including 18-month stability of PRF-110 at room temperature. The company's stock price has been affected by the news, with some articles noting a recent increase in value. The company's quarterly earnings were also recently announced, with a reported EPS of $7.20. Additionally, PainReform's stock has seen significant declines over the past four years, with an annualized return of -79.28%. The company's historical stock price data and news are available for review.", "keywords": ["stock", "earnings", "benefits", "declines", "pharmaceutical", "price", "stability", "manufacturing", "review", "clinical", "eps", "acquisition"], "sentiment": "positive", "upside": -2945.1, "linked": [], "volume": 18376632.0, "introduction": "PainReform, a clinical-stage pharmaceutical company, has acquired DeepSolar and developed a new manufacturing process, resulting in a 18-month stability of PRF-110 at room temperature, causing its stock price to fluctuate.", "update": "2025-03-12", "current": 3.57, "category": "stock"}, {"company": "TAL Education Group", "symbol": "TAL", "statement": "TAL Education Group (TAL) is a Chinese company that provides K-12 after-school tutoring services through small-classes, personalized premium services, and learning content solutions. The company has seen recent stock price growth, with analysts predicting an average 12-month price target of 15.3, a 13.50% increase from the current stock price. TAL Education Group has also reported strong earnings, beating analysts' estimates with a quarterly EPS of $0.12. Several institutional investors have taken new positions or increased their stakes in the company, including Point72 DIFC Ltd, iA Global Asset Management Inc., and Blue Trust Inc.", "keywords": ["inc", "growth", "company", "solutions", "services", "investors", "ltd", "china", "increase", "earnings", "price", "positions", "tutoring", "eps", "target", "premium", "stakes", "analysts", "k12", "education"], "sentiment": "positive", "upside": -94.6, "linked": ["BEKE : KE Holdings Inc., a Chinese company operating an online and offline platform for housing transactions and services, is expected to report strong quarterly results and sees its stock price increasing by 7.05% to $25.97, according to analysts."], "volume": 13331581.0, "introduction": "TAL Education Group, a Chinese company providing K-12 after-school tutoring services, has seen stock price growth, strong earnings, and increased institutional investor interest, with analysts predicting a 13.50% price increase over the next 12 months.", "update": "2025-03-12", "current": 11.69, "category": "stock"}, {"company": "Altria Group Inc", "symbol": "MO", "statement": "Altria Group, Inc. (NYSE:MO) has set a new 1-year high, driven by its strong quarterly earnings report, which beat estimates and showed a net margin of 46.90%. The company's revenue has grown at a compound annual growth rate of less than 1% from 2019 to 2024, but its adjusted earnings per share (EPS) has grown at a faster rate of 4%. Altria is working on new, alternative nicotine products and has a diverse portfolio of tobacco and nicotine products, including cigarettes, cigars, and oral nicotine pouches. The company has a market capitalization of $96.4 billion and is considered a leading American tobacco and nicotine products company.", "keywords": ["market", "growth", "stock", "earnings", "cigars", "altria", "pouches", "margin", "tobacco", "estimates", "capitalization", "company", "products", "nicotine", "cigarettes", "revenue"], "sentiment": "positive", "upside": 191.5, "linked": [], "volume": 7964878.0, "introduction": "Altria Group, Inc. (NYSE:MO) has reached a new 1-year high after beating earnings estimates and growing its adjusted earnings per share at a faster rate of 4% despite revenue growth of less than 1% from 2019 to 2024.", "update": "2025-03-12", "current": 52.05, "category": "stock"}, {"company": "Moderna Inc", "symbol": "MRNA", "statement": "Moderna, a biotechnology company, is partnering with OpenAI to accelerate mRNA research and develop multiple products in the coming years. The company has seen success in its mRNA technologies and is expanding its strategic alliances. Moderna is working on developing vaccines and treatments for various diseases, including COVID-19, cardiovascular diseases, and cancer. The company's CEO recently invested $5 million in its own stock, a significant move given the company's history of insider sales. Moderna is also collaborating with Merck to increase vaccine production capacity and has partnered with AZ to develop an mRNA drug for heart failure.", "keywords": ["mrna", "research", "investments", "failure", "biotechnology", "diseases", "sales", "cardiovascular", "products", "collaboration", "drug", "cancer", "covid-19", "treatments", "vaccines", "heart", "capacity", "partnership", "production", "insider"], "sentiment": "positive", "upside": -448.9, "linked": [], "volume": 17101748.0, "introduction": "Moderna, a biotech company, is partnering with OpenAI to accelerate mRNA research and develop products for various diseases, including COVID-19, cardiovascular diseases, and cancer, while expanding its alliances and increasing vaccine production capacity.", "update": "2025-03-12", "current": 41.41, "category": "stock"}, {"company": "ZoomInfo Technologies Inc", "symbol": "ZI", "statement": "ZoomInfo Technologies Inc. (NASDAQ: ZI) is a leading provider of market intelligence solutions for sales and marketing teams. With impressive gross profit margins and management buying back shares, the company is navigating a rapidly evolving software industry landscape. Its recent financial performance and strategic initiatives have drawn attention, with AI integration being a key focus. ZoomInfo's products, such as InboxAI and its user-friendly interface, aim to provide actionable insights and improve productivity. The company has received strong analyst interest, with a consensus rating of Reduce and 10 research reports in the past 90 days.", "keywords": ["marketing", "industry", "rating", "margins", "sales", "insights", "intelligence", "initiatives", "productivity", "profit", "solutions", "software", "integration", "ai", "analyst", "market", "performance"], "sentiment": "positive", "upside": -93.4, "linked": ["RCAT : Red Cat Holdings, a Puerto Rico-based drone company, provides robotic hardware and software for situational awareness and actionable intelligence, with a market cap of $385.97 million and recent new orders and a new CFO appointment."], "volume": 9430513.0, "introduction": "ZoomInfo Technologies Inc. (NASDAQ: ZI) is a leading provider of market intelligence solutions for sales and marketing teams with strong financial performance and strategic initiatives, including AI integration, drawing analyst attention and interest.", "update": "2025-03-12", "current": 9.98, "category": "stock"}, {"company": "Monster Beverage Corp", "symbol": "MNST", "statement": "Monster Beverage Corporation, the company behind the popular energy drink Monster Energy, is experiencing significant growth, driven by big money and new products. The company reported a 4.7% increase in net sales, reaching $1.81 billion, exceeding market predictions. The energy drink category saw a 4.5% sales rise due to high demand, with the flagship Monster Energy brand gaining a significant 13.7% in market share. The company's overall portfolio continues to grow, with sales expected to increase by 12.96% in the coming year. Despite some challenges in its alcohol-based drinks segment, the company's full-year sales rose 4.9% to $7.49 billion, driven by its energy drink business.", "keywords": ["energy", "growth", "share", "increase", "demand", "sales", "business", "portfolio", "challenges", "market"], "sentiment": "positive", "upside": -59.0, "linked": [], "volume": 8402920.0, "introduction": "Monster Beverage Corporation's net sales increased 4.7% to $1.81 billion, driven by strong demand for its energy drinks and new products, exceeding market predictions and expected to grow 12.96% in the coming year.", "update": "2025-03-12", "current": 48.28, "category": "stock"}, {"company": "Norwegian Cruise Line Holdings Ltd", "symbol": "NCLH", "statement": "Oceania Cruises is offering a 180-day around-the-world cruise visiting over 100 ports in 46 countries across six continents in 2027. Norwegian Cruise Line Holdings, on the other hand, is expanding its entertainment options with four new original productions, and will hold a conference call to discuss its Q4 and full-year 2024 financial results. The company's stock price is down 2.24% currently, and Tigress Financial maintains a strong buy rating on the stock. Additionally, revenue growth is outpacing commissions at some cruise lines, and Oceania Cruises is offering a unique culinary-focused experience.", "keywords": ["financial", "experience", "rating", "growth", "stock", "norwegian", "culinary", "results", "cruise", "productions", "buy", "oceania", "revenue", "conference", "entertainment", "holdings"], "sentiment": "positive", "upside": -75.7, "linked": [], "volume": 8834639.0, "introduction": "Oceania Cruises is offering a 180-day around-the-world cruise in 2027, while Norwegian Cruise Line is expanding entertainment options and discussing Q4 and full-year 2024 financial results, with its stock price down 2.24%.", "update": "2025-03-12", "current": 25.68, "category": "stock"}, {"company": "U.S. Bancorp", "symbol": "USB", "statement": "U.S. Bank, a company with over 70,000 employees and $678 billion in assets, has been named one of the World's Most Ethical Companies by Ethisphere. The bank, founded in 1863, offers a range of financial services including consumer banking, business banking, and corporate trust services. It has a global presence, with offices in many countries, and is headquartered in Minneapolis. The bank has been led by a new CEO, Gunjan Kedia, who will take over in mid-April. U.S. Bank has also been expanding its use of AI and digital innovations, and has partnered with other companies to offer new services such as point-of-sale lending.", "keywords": ["financial", "presence", "bank", "lending", "global", "ethical", "assets", "employees", "ceo", "company", "founded", "digital", "services", "ai", "innovations"], "sentiment": "positive", "upside": -58.9, "linked": [], "volume": 8221113.0, "introduction": "U.S. Bank, with over 70,000 employees and $678 billion in assets, has been named one of the World's Most Ethical Companies by Ethisphere and is expanding its use of AI and digital innovations.", "update": "2025-03-12", "current": 49.07, "category": "stock"}, {"company": "Abbott Laboratories", "symbol": "ABT", "statement": "Abbott, a company, has been making news with its latest developments in the medical technology space. The company has launched new pacemaker systems, a biowearable line, and software for optical coherence tomography (OCT) intravascular imaging. Abbott has also partnered with the American Diabetes Association to explore nutritional solutions for individuals with diabetes, obesity, and metabolic dysfunction. The company is expanding into new markets and investing in digital health technologies, and its products are used by doctors to diagnose and treat various medical conditions.", "keywords": ["metabolic", "treatment", "medical", "diabetes", "oct", "obesity", "technology", "digital", "diagnosis", "pacemaker", "abbott", "biowearable", "health"], "sentiment": "positive", "upside": 54.5, "linked": [], "volume": 9883882.0, "introduction": "Abbott, a medical technology company, has launched new pacemaker systems, biowearable technology, OCT imaging software, and partnered with the American Diabetes Association to explore nutritional solutions, while expanding into new markets and investing in digital health technologies.", "update": "2025-03-12", "current": 125.03, "category": "stock"}, {"company": "Texas Instruments Inc", "symbol": "TXN", "statement": "Texas Instruments (TI) has introduced the world's smallest microcontroller unit (MCU), expanding its MSPM0 MCU portfolio, which enhances sensing and control in embedded systems while reducing cost, complexity, and design time. The new MCU is part of TI's comprehensive Arm Cortex-M0+ MSPM0 MCU portfolio and is available in a LaunchPad development kit for $5.99. TI is also expanding its manufacturing capabilities with a new 300mm wafer fab in Sherman, Texas, and investing in cutting-edge design and testing equipment.", "keywords": ["cortex", "launchpad", "instruments", "m0", "texas", "kit", "arm", "manufacturing", "fab", "microcontroller", "ti", "development", "mcu", "sherman", "mspm0"], "sentiment": "positive", "upside": -85.8, "linked": [], "volume": 14873525.0, "introduction": "Texas Instruments has introduced the world's smallest microcontroller unit (MCU) and expanded its Arm Cortex-M0+ MSPM0 MCU portfolio, available in a development kit for $5.99, to enhance sensing and control in embedded systems while reducing cost and complexity.", "update": "2025-03-12", "current": 185.52, "category": "stock"}, {"company": "Senseonics Holdings Inc", "symbol": "SENS", "statement": "Senseonics Holdings, Inc. (SENS) is a medical technology company that develops and manufactures implantable glucose monitoring systems for people with diabetes. The company's products, Eversense, Eversense XL, and Eversense E3, use an under-the-skin sensor, a removable transmitter, and a mobile app for real-time monitoring and management. Senseonics Holdings has scheduled its first-quarter earnings release and conference call for May 13, 2024. The company's stock has had a negative return over the past nine years, and its recent quarterly earnings report missed analysts' estimates. The company has provided FY 2025 earnings guidance and has integrated its Eversense 365 and SweetSpot software to optimize diabetes care.", "keywords": ["medical", "earnings", "diabetes", "guidance", "management", "implantable", "technology", "monitoring", "glucose", "software", "care"], "sentiment": "negative", "upside": -159.7, "linked": [], "volume": 19030192.0, "introduction": "Senseonics Holdings, a medical tech company, develops implantable glucose monitoring systems for diabetes patients, with its products using an under-the-skin sensor and mobile app for real-time monitoring.", "update": "2025-03-12", "current": 1.13, "category": "stock"}, {"company": "Clover Health Investments Corp", "symbol": "CLOV", "statement": "Clover Health Investments Corp. presented at the UBS Global Healthcare Conference and Leerink Global Healthcare Conference, highlighting its strategic vision and financial improvements. The company's equity buyback plan was updated, with estimates of adjusted EBITDA between $45,000,000 and $70,000,000 for the year. Analysts predict earnings growth and a moderate buy recommendation, with a target price of $4.83, a 42.48% increase from the current stock price. The company's financial results for Q3 2023 showed notable improvements, but challenges remain in achieving sustained profitability.", "keywords": ["financial", "growth", "profitability", "earnings", "investments", "target", "price", "analysts", "equity", "recommendation", "conference", "health", "ebitda", "vision"], "sentiment": "positive", "upside": -118.9, "linked": [], "volume": 10155186.0, "introduction": "Clover Health Investments Corp. presented at healthcare conferences, highlighting its vision and financial improvements, with analysts predicting earnings growth and a moderate buy recommendation with a target price of $4.83, a 42.48% increase from the current stock price.", "update": "2025-03-12", "current": 4.82, "category": "stock"}, {"company": "Planet Labs PBC", "symbol": "PL", "statement": "Planet Labs PBC, a leading provider of global, daily satellite imagery and geospatial solutions, has partnered with Syngenta to provide farmers with near-daily satellite imagery of their fields. This partnership aims to enhance precision agriculture and provide comprehensive data insights to farmers worldwide. Additionally, Planet Labs has integrated Anthropic's AI technology, Claude, to analyze Earth data and provide powerful capabilities for users across government and industries. The company has also secured a US$230 million partnership with SKY Perfect JSAT to build a new low-Earth orbit satellite constellation.", "keywords": ["geospatial", "partnership", "agriculture", "satellite", "precision", "technology", "imagery", "ai", "data", "satelliteconstellation", "insights"], "sentiment": "positive", "upside": -136.6, "linked": [], "volume": 14386348.0, "introduction": "Planet Labs has partnered with Syngenta to provide farmers with daily satellite imagery and AI-powered insights, and has also secured a $230 million partnership to build a new satellite constellation, enhancing precision agriculture and Earth data analysis.", "update": "2025-03-12", "current": 5.44, "category": "stock"}, {"company": "ON Semiconductor Corp", "symbol": "ON", "statement": "ON Semiconductor Corp (ON) is a global leader in sensing and power solutions, with a recent stock price increase of 3.5%. The company reported a year-over-year revenue decline of 14.7% and EPS of $0.95 in the latest quarter. ON Semiconductor is expanding its operations in Central New York, investing $120 million and creating 80 IT jobs. The company operates through three segments: Power Solutions, Analog and Mixed-Signal, and Intelligent Sensing. Its products perform various functions, including power switching and signal conditioning. The company faces market challenges, but is exploring a $6.9 billion acquisition of Allegro MicroSystems and focusing on automotive technologies and silicon carbide. Analysts predict a 51.99% increase in stock price to $67.12, while options market movements suggest a potential spike in ON Semiconductor's stock.", "keywords": ["automotive", "signal", "solutions", "price", "semiconductor", "revenue", "intelligent", "silicon", "stock", "investment", "jobs", "analog", "sensing", "predictions", "power", "acquisition", "eps", "operations", "mixed", "expansion", "technology", "analysts", "carbide"], "sentiment": "positive", "upside": 89.1, "linked": [], "volume": 8764990.0, "introduction": "ON Semiconductor Corp, a global leader in sensing and power solutions, reported a 14.7% revenue decline and EPS of $0.95, but is expanding its operations in Central New York and exploring a $6.9 billion acquisition, with analysts predicting a 51.99% increase in stock price.", "update": "2025-03-12", "current": 54.5, "category": "stock"}, {"company": "SES AI Corp", "symbol": "SES", "statement": "SES AI Corporation, a battery manufacturing company, reported strong Q3 2024 results, advancing its lithium battery technology and AI capabilities. The company is developing a new electrolyte every six months, enhancing its material discovery capabilities and improving battery cycle life by 20% through AI optimization. SES AI has signed contracts worth up to $10 million to develop AI-enhanced Li-Metal and Li-ion batteries for electric vehicles with two automotive OEM partners. The company's stock price has fluctuated, with a recent 8.73% drop in the last 24 hours and a 61.24% decline over the past month.", "keywords": ["automotive", "lithium", "materials", "results", "discovery", "vehicles", "report", "optimization", "stock", "innovation", "quarterly", "battery", "finance", "electric", "contracts", "technology", "enhancement", "oem", "ai", "partnerships"], "sentiment": "negative", "upside": -193.7, "linked": [], "volume": 66331300.0, "introduction": "SES AI Corporation reported strong Q3 2024 results, advancing its lithium battery technology and AI capabilities, with new contracts worth up to $10 million for electric vehicle batteries and a fluctuating stock price.", "update": "2025-03-12", "current": 1.13, "category": "stock"}, {"company": "Applied DNA Sciences Inc", "symbol": "APDN", "statement": "Applied DNA Sciences, Inc. (APDN) announced a 1-for-50 reverse stock split, which will become effective on March 14, 2025. The company's issued and outstanding common stock will be reduced by 50 times, and the reverse stock split is aimed at reducing the company's outstanding shares and increasing its stock price.", "keywords": ["dna", "inc", "stock", "split", "march", "apdn", "price", "effective", "company", "shares", "applied", "reverse", "sciences"], "sentiment": "negative", "upside": -434.3, "linked": [], "volume": 8052687.0, "introduction": "Applied DNA Sciences, Inc. (APDN) is implementing a 1-for-50 reverse stock split on March 14, 2025, reducing its outstanding shares by 50 times to increase its stock price.", "update": "2025-03-12", "current": 0.2, "category": "stock"}, {"company": "Blue Hat Interactive Entertainment Technology", "symbol": "BHAT", "statement": "Blue Hat Interactive Entertainment Technology (BHAT) is a NASDAQ-listed company that engages in the commodity trading business, including chemicals and jewelry. The company has a market capitalization of $8.64M, down from $160.30M in 2019, with a current ratio of 5.88 and a debt-to-equity ratio of unknown. BHAT has announced new gaming products and plans for global launches in 2021. The company's stock price has decreased significantly over the past five years, with a return of -99.92% and an annualized return of -75.93%. The company's products include AR toys, mobile games, and animation design services, and it reports in segments such as interactive toys, mobile games, and information services.", "keywords": ["jewelry", "chemicals", "stock", "return", "games", "trading", "price", "services", "design", "products", "toys", "commodities", "gaming", "nasdaq", "information", "launches"], "sentiment": "negative", "upside": -591.8, "linked": [], "volume": 40276130.0, "introduction": "Blue Hat Interactive Entertainment Technology, a NASDAQ-listed company with a market capitalization of $8.64M, has struggled with a significant decline in stock price and financial performance over the past five years.", "update": "2025-03-12", "current": 0.06, "category": "stock"}, {"company": "Enovix Corp", "symbol": "ENVX", "statement": "Enovix Corporation (ENVX) is a pioneer in the battery industry, specializing in advanced lithium-ion batteries. The company has demonstrated strong financial performance with steady revenue growth and improving profit margins. Founded in 2009, Enovix has released several innovative energy storage solutions for various applications. The company's CEO, Dr. Raj Tallurl, has a 30-year career in the semiconductor industry and aims to bring success to Enovix. With a market capitalization of $1.65B, Enovix has been listed on the NASDAQ since 2020, with a current stock price of $8.61.", "keywords": ["financial", "energy", "growth", "market", "stock", "innovation", "pioneer", "semiconductor", "profit", "ceo", "capitalization", "revenue", "battery", "lithium-ion", "storage"], "sentiment": "positive", "upside": -152.8, "linked": ["RUN : Sunrun Inc., a leading provider of residential solar energy solutions, faces challenges and opportunities as it navigates the complex landscape of market opportunities and regulatory challenges, despite having a weak financial health score."], "volume": 8011715.0, "introduction": "Enovix Corporation (ENVX) is a pioneer in the battery industry with a strong financial track record and innovative energy storage solutions, founded in 2009 and listed on the NASDAQ since 2020.", "update": "2025-03-12", "current": 12.32, "category": "stock"}, {"company": "Newell Brands Inc", "symbol": "NWL", "statement": "Newell Brands Inc. is a global consumer goods company that operates in three segments: Home and Commercial Solutions, Learning and Development, and Outdoor and Recreation. The company designs, manufactures, sources, and distributes consumer and commercial products worldwide. Its products include household items, stationery, and outdoor recreation products. The company has reported quarterly earnings and has a market capitalization of $3.13 billion.", "keywords": ["recreation", "home", "earnings", "global", "learning", "outdoor", "capitalization", "company", "products", "goods", "commercial", "development", "consumer"], "sentiment": "positive", "upside": -128.0, "linked": [], "volume": 7619619.0, "introduction": "Newell Brands Inc. is a global consumer goods company operating in three segments, designing, manufacturing, and distributing household, stationery, and outdoor products with a market capitalization of $3.13 billion.", "update": "2025-03-12", "current": 10.66, "category": "stock"}, {"company": "ADiTx Therapeutics Inc", "symbol": "ADTX", "statement": "Aditxt, Inc. (ADTX) is a biotech company that develops and commercializes technologies to improve health by monitoring and modulating the immune system. The company's subsidiary, Adimune, will ship drug substances for a final drug product formulation ahead of clinical trials in Germany and the US. ADTX's stock has seen a decline in value, with a 56.65% loss since February 20, 2025, and has been marked as a sell candidate. The company has received funding from The Brewer Group and has a subsidiary, Adimune, that will ship drug substances for a final drug product formulation.", "keywords": ["stock", "biotech", "immune", "funding", "decline", "technology", "system", "formulation", "germany", "clinical", "trials", "company", "value", "health", "us", "drug"], "sentiment": "negative", "upside": -12138.3, "linked": [], "volume": 23388628.0, "introduction": "Aditxt, Inc. (ADTX), a biotech company, is developing technologies to improve health by monitoring and modulating the immune system, and its subsidiary Adimune is shipping drug substances for clinical trials in Germany and the US.", "update": "2025-03-12", "current": 0.12, "category": "stock"}, {"company": "International Paper Co", "symbol": "IP", "statement": "International Paper, a Memphis-based sustainable packaging solutions company, has been recognized as one of the 2025 World's Most Ethical Companies by Ethisphere, a global leader in defining and advancing ethical business practices. This is the 19th time International Paper has received this honor, and it is one of only two companies in the Forestry, Packaging & Paper industry to receive the recognition. The company's commitment to ethics is a core value that guides its mission, with a focus on making the world safer and more productive through sustainable packaging.", "keywords": ["world", "ethical", "packaging", "international", "forestry", "sustainable", "paper", "productive", "solutions", "ethisphere", "memphis", "mission", "companies"], "sentiment": "positive", "upside": -72.4, "linked": [], "volume": 8804611.0, "introduction": "International Paper, a Memphis-based sustainable packaging solutions company, has been recognized as one of the 2025 World's Most Ethical Companies by Ethisphere for the 19th time, highlighting its commitment to ethics and sustainability.", "update": "2025-03-12", "current": 60.09, "category": "stock"}, {"company": "CNS Pharmaceuticals Inc", "symbol": "CNSP", "statement": "The article discusses various news and updates related to CNS (Central Nervous System) pharmaceuticals and neurotechnology companies. Johnson & Johnson agreed to acquire Intra-Cellular Therapies in a deal worth up to $14.6 billion. Pulvinar Neuro, a neurotechnology company, received a breakthrough device designation for non-invasive brain stimulation research tools. CNS Pharmaceuticals, a clinical-stage pharmaceutical company, is developing anti-cancer drug candidates for brain and CNS tumors. Other news includes a $2 billion deal between AbbVie and Gilgamesh Pharma, and various updates on CNS Pharmaceuticals' stock price and company developments.", "keywords": ["cancer", "stock", "stimulation", "brain", "tumors", "neurotechnology", "pharmaceuticals", "research", "update", "cns", "acquisition", "deal"], "sentiment": "positive", "upside": -1502.1, "linked": [], "volume": 29763440.0, "introduction": "The article reports on various updates and news in the CNS pharmaceuticals and neurotechnology industries, including significant deals and developments from companies like Johnson & Johnson, Pulvinar Neuro, and CNS Pharmaceuticals.", "update": "2025-03-12", "current": 0.11, "category": "stock"}, {"company": "Endeavor Group Holdings Inc", "symbol": "EDR", "statement": "Endeavor Group Holdings, Inc. (EDR) is a global sports and entertainment company that specializes in talent representation and full-service marketing. The company's stock price has fluctuated over the past few days, with a major shareholder acquiring 116,256 shares at an average price of $172.03 per share. There have been reports of a potential acquisition by Silver Lake at $27.50 per share, and analysts have provided various ratings and price targets for the stock. The company's stock has returned 13.21% over the past three years, with an annualized return of 4.22%.", "keywords": ["marketing", "stock", "sports", "ratings", "targets", "return", "talent", "analysts", "silver", "acquisition", "shares", "lake", "entertainment", "holdings"], "sentiment": "positive", "upside": -150.4, "linked": [], "volume": 8282036.0, "introduction": "Endeavor Group Holdings, Inc. (EDR) is a sports and entertainment company with fluctuating stock prices, including a recent acquisition and potential takeover rumors, with a 13.21% return over the past three years.", "update": "2025-03-12", "current": 30.9, "category": "stock"}, {"company": "Albertsons Companies Inc", "symbol": "ACI", "statement": "Albertsons Companies, a leading food and drug retailer in the United States, has announced a new goal to enable 1.5 billion meals across local communities by 2030. The company, through its foundation, contributed over $350 million in food and financial support in 2023, including $35 million through its Nourishing Neighbors program. The company operates over 2,273 retail food and drug stores and 1,732 pharmacies across 34 states, offering a wide range of products and services.", "keywords": ["foundation", "nourishing", "pharmacies", "neighbors", "goal", "support", "retailer", "products", "stores", "services", "communities", "meals", "food", "drug"], "sentiment": "positive", "upside": 124.8, "linked": [], "volume": 7597420.0, "introduction": "Albertsons Companies aims to enable 1.5 billion meals across local communities by 2030 through its foundation's contributions, including $35 million through its Nourishing Neighbors program, and operates over 2,273 retail food and drug stores and 1,732 pharmacies across 34 states.", "update": "2025-03-12", "current": 19.91, "category": "stock"}, {"company": "Sealsq Corp", "symbol": "LAES", "statement": "SEALSQ Corp, a company that develops and sells semiconductor and post-quantum technology products, has launched its QS7001 Post-Quantum Secure Chip, designed to protect cryptocurrency wallets from the emerging threat of quantum computing. The chip is designed to safeguard against quantum attacks and provide enhanced security for cryptocurrency wallets, with applications in various industries such as healthcare, defense, and industrial automation.", "keywords": ["wallets", "secure", "defense", "quantum", "post-quantum", "automation", "semiconductor", "technology", "cryptocurrency", "protection", "chip", "security", "healthcare"], "sentiment": "positive", "upside": -183.5, "linked": [], "volume": 23068194.0, "introduction": "SEALSQ Corp has launched the QS7001 Post-Quantum Secure Chip, a chip designed to protect cryptocurrency wallets from quantum computing threats and enhance security across industries like healthcare, defense, and industrial automation.", "update": "2025-03-12", "current": 4.3, "category": "stock"}, {"company": "Bionano Genomics Inc", "symbol": "BNGO", "statement": "Bionano Genomics, Inc. is a life sciences company focused on developing and commercializing innovative solutions for genome analysis. The company's mission is to revolutionize genomics by providing researchers and clinicians with high-resolution, structural variation detection tools. The company's stock price has seen a decline in short interest, with a 98.1% drop in short interest in January. Institutional investors have sold Bionano Genomics stock, with Mitsubishi UFJ Kokusai Asset Management Co. Ltd. and Mirae Asset Global Investments Co. Ltd. selling the largest volumes. The company's next earnings announcement is expected, with an estimated loss of $8.40 per share.", "keywords": ["tools", "biotech", "innovation", "detection", "stocks", "clinicians", "research", "management", "earnings", "loss", "analysis", "solutions", "asset", "genome", "genomics", "investors"], "sentiment": "negative", "upside": -4096.3, "linked": [], "volume": 16854894.0, "introduction": "Bionano Genomics, a life sciences company, has seen a decline in short interest and institutional investor selling, with its next earnings announcement expected to show a loss of $8.40 per share.", "update": "2025-03-12", "current": 0.12, "category": "stock"}, {"company": "General Electric Co", "symbol": "GE", "statement": "GE Aerospace is investing in hybrid-electric propulsion technologies and has announced a near $1 billion investment in US manufacturing to enhance production, engine safety, and cutting-edge material integration. The company is also showcasing its advancements in hybrid-electric propulsion at the 2025 Verticon Conference. Additionally, GE Aerospace is doubling down on US manufacturing with a significant investment in the country, nearly double last year's amount. The company operates through two reportable segments, Commercial Engines and Services, and Defense and Propulsion Technologies, and has an installed base of approximately 45,000 commercial and 25,000 military aircraft engines.", "keywords": ["propulsion", "hybrid", "electric", "safety", "military", "investment", "materials", "defense", "aerospace", "manufacturing", "technology", "aviation", "engines", "services", "conference", "production"], "sentiment": "positive", "upside": -26.7, "linked": [], "volume": 7699101.0, "introduction": "GE Aerospace is investing $1 billion in US manufacturing and hybrid-electric propulsion technologies, and will showcase advancements at the 2025 Verticon Conference, while doubling down on US manufacturing with a significant investment.", "update": "2025-03-12", "current": 196.75, "category": "stock"}, {"company": "BioXcel Therapeutics Inc", "symbol": "BTAI", "statement": "BioXcel Therapeutics, a biopharmaceutical company, has strengthened its cash position to advance its SERENITY program and other initiatives. The company has reached 33% enrollment in a trial for its treatment targeting agitation linked to bipolar disorders and schizophrenia, with topline data expected in the second half of 2025. The company's stock price has risen 13% to $3.10, up from its 52-week low, despite being down 94% over the past year.", "keywords": ["enrollment", "bipolar", "stock", "treatment", "biopharmaceutical", "agitation", "data", "initiatives", "price", "program", "cash", "bioxcel", "low", "trial", "therapeutics", "schizophrenia", "position", "serenity"], "sentiment": "positive", "upside": -2272.4, "linked": [], "volume": 29840332.0, "introduction": "BioXcel Therapeutics has strengthened its cash position and reached 33% enrollment in its SERENITY trial, with topline data expected in 2025, sending its stock price up 13% to $3.10.", "update": "2025-03-12", "current": 0.34, "category": "stock"}, {"company": "MicroCloud Hologram Inc", "symbol": "HOLO", "statement": "MicroCloud Hologram Inc., a technology company, has received a $303 million investment to develop products and technologies in fields such as quantum hologram, blockchain, quantum computing, and holographic cloud processing. The company plans to use this investment to develop derivatives and incorporate these technologies into its funds. The company has also developed a two-qubit protocol for quantum computing and has announced a new Bitcoin blockchain hybrid consensus algorithm. Additionally, MicroCloud Hologram Inc. has explored the combination of detection fields and quantum trajectories, achieving in-depth exploration and accurate measurement of quantum systems.", "keywords": ["computing", "quantum", "detection", "consensus", "bitcoin", "trajectories", "blockchain", "cloud", "protocol", "hologram"], "sentiment": "positive", "upside": -2291.3, "linked": [], "volume": 15024515.0, "introduction": "MicroCloud Hologram Inc. received a $303 million investment to develop quantum hologram, blockchain, quantum computing, and holographic cloud processing technologies, and plans to use it to create derivatives and integrate them into its funds.", "update": "2025-03-12", "current": 1.55, "category": "stock"}, {"company": "Innoviz Technologies Ltd", "symbol": "INVZ", "statement": "Innoviz Technologies Ltd. (INVZ) is a company that manufactures and sells automotive-grade LiDAR sensors and perception software for autonomous driving. The company showcased its cutting-edge perception software with NVIDIA DRIVE AGX Orin at CES 2025, unveiling new software-driven features. With a cash payment of over $40 million expected in 2025, the company is experiencing ongoing sales of LiDAR sensors. Analysts predict a 442.64% increase in the stock price to $3.99, with a current price of $0.74. The company is a supplier of high-performance LiDAR semiconductor sensors and perception software, enabling mass production of autonomous vehicles.", "keywords": ["automotive", "machine", "stocks", "vehicles", "agx", "suppliers", "lidar", "sensors", "orin", "perception", "intelligence", "learning", "autonomous", "artificial", "innovation", "sales", "predictions", "nvidia", "software", "drive", "driving", "electric", "ces", "technology", "semiconductors"], "sentiment": "positive", "upside": -272.7, "linked": [], "volume": 7724586.0, "introduction": "Innoviz Technologies Ltd. manufactures and sells automotive-grade LiDAR sensors and perception software for autonomous driving, with a predicted 442.64% increase in stock price to $3.99 and ongoing sales of LiDAR sensors.", "update": "2025-03-12", "current": 1.83, "category": "stock"}, {"company": "Tetra Tech Inc", "symbol": "TTEK", "statement": "Tetra Technologies, Inc. (TTI) reported adjusted operating income of $137 million on $1.4 billion in net revenue for the quarter ending December 29. The company will participate in the Roth 37th Annual Conference on March 17-18, and has hired Kurt Hallead as Treasurer and VP of Investor Relations and Treasurer. TTI's stock price has been affected by market fluctuations, with a 24.6% drop in 2025 and a 17.46% decline in the past year. Despite this, the company's CEO and VP of Investor Relations will be hosting one-on-one meetings at the Roth conference.", "keywords": ["treasury", "market", "fluctuations", "stock", "income", "relations", "technology", "ceo", "revenue", "conference", "finance", "investor"], "sentiment": "negative", "upside": -46.6, "linked": [], "volume": 8225928.0, "introduction": "Tetra Technologies, Inc. reported a $137 million adjusted operating income on $1.4 billion in net revenue for the quarter ending December 29, despite a decline in its stock price over the past year.", "update": "2025-03-12", "current": 38.37, "category": "stock"}, {"company": "Consolidated Communications Holdings Inc", "symbol": "CNSL", "statement": "Consolidated Communications, Inc. was formed in 1984 and has undergone changes in ownership and mergers over the years. The company's institutional ownership includes investors such as Private Advisor Group and Hsbc Holdings. The article also mentions DXC, a trusted partner to innovative organizations, and proposes organizational changes for Consolidated Holdings Inc. Additionally, the text includes updates on companies such as Thales, Adobe Sensei, and Saga Communications, which provide services in various industries including cybersecurity, AI, and telecommunications.", "keywords": ["cybersecurity", "updates", "consolidated", "partner", "mergers", "ownership", "changes", "telecommunications", "ai", "investors", "communications", "organizational"], "sentiment": "neutral", "upside": -267.1, "linked": [], "volume": 13276579.0, "introduction": "Consolidated Communications, Inc. was formed in 1984 and has undergone changes in ownership and mergers, with institutional ownership including Private Advisor Group and Hsbc Holdings, and partners with DXC in various industries.", "update": "2025-03-12", "current": 4.72, "category": "stock"}, {"company": "Richtech Robotics Inc", "symbol": "RR", "statement": "Richtech Robotics, a Nevada-based provider of AI-driven service robots, is set to showcase its AI-powered Scorpion robot at ProWein 2025 in Düsseldorf, Germany, marking its global expansion. The robot offers automated bartending services, including guided wine tastings and cocktail mixing. The company also announced its participation at the event, which will take place from March 16-18. This marks a strategic expansion for Richtech Robotics, which designs, manufactures, and sells AI-driven service robots.", "keywords": ["nevada", "robotics", "prowein", "manufacturing", "tastings", "cocktail", "expansion", "bartending", "germany", "ai", "wine", "automation"], "sentiment": "positive", "upside": -123.6, "linked": [], "volume": 25294012.0, "introduction": "Richtech Robotics will showcase its AI-powered Scorpion robot, which provides automated bartending services, at ProWein 2025 in Düsseldorf, Germany, marking the company's global expansion.", "update": "2025-03-12", "current": 3.31, "category": "stock"}, {"company": "Electronic Arts Inc", "symbol": "EA", "statement": "Electronic Arts (EA) is a leading video game developer and publisher, with a new game called Split Fiction launching on March 6. In a Q&A, director Josef Fares discussed the game's creative process and challenges. EA is also working on an Iron Man game, with new details expected soon. The company is focused on building games and experiences that grow its global online communities and deepen engagement with its key franchises. EA's stock has been acquired by various institutional investors and has a strong debt-to-equity ratio. The company has a new game and is working on an Iron Man game, but its growth rate has been sluggish over the last three years.", "keywords": ["growth", "game", "fiction", "challenges", "investors", "process", "iron", "developer", "launch", "details", "engagement", "equity", "director", "stock", "man", "debt", "franchises", "publisher", "communities"], "sentiment": "positive", "upside": -14.5, "linked": [], "volume": 9158789.0, "introduction": "Electronic Arts (EA) is a leading video game developer and publisher, with a new game called Split Fiction launching on March 6 and an Iron Man game in development, focused on building and deepening its global online communities.", "update": "2025-03-12", "current": 116.56, "category": "stock"}, {"company": "United Airlines Holdings Inc", "symbol": "UAL", "statement": "United Airlines has installed Starlink, Elon Musk's satellite connectivity service, on its first regional aircraft, becoming the first major US airline to adopt the technology. The airline plans to outfit over 40 regional aircraft monthly through 2025, with installations taking approximately 8 hours, 10 times faster than non-Starlink equipment. Starlink provides download speeds of up to 250 Mbps, 50 times faster than average regional flight download speeds. The service will be free for all MileagePlus customers and include game-changing in-flight entertainment experiences. United aims to upgrade its entire fleet with Starlink technology, enhancing the in-flight experience for its customers.", "keywords": ["elon", "experience", "united", "musk", "download", "aircraft", "speed", "upgrade", "installation", "fleet", "regional", "satellite", "technology", "airlines", "starlink", "connectivity", "entertainment"], "sentiment": "positive", "upside": 128.0, "linked": [], "volume": 8609616.0, "introduction": "United Airlines has become the first major US airline to adopt Elon Musk's Starlink satellite connectivity service, aiming to upgrade its entire fleet and offer fast internet speeds of up to 250 Mbps for MileagePlus customers.", "update": "2025-03-12", "current": 105.0, "category": "stock"}, {"company": "Twilio Inc", "symbol": "TWLO", "statement": "Twilio, a company that provides communication tools and services, has seen success with its CustomerAI Predictions, reducing lead acquisition costs by 34% for The Motley Fool. The company's integration with Twilio's solutions has also increased efficiency for its agents, allowing them to focus on more complex tasks. Twilio operates through two segments, Twilio Communications and Twilio Segment, offering various APIs and software solutions for customer communications. The company has reported revenue of $1.19 billion and a positive return on equity of 1.38%.", "keywords": ["efficiency", "success", "return", "predictions", "communication", "integration", "software", "revenue", "apis"], "sentiment": "positive", "upside": -111.1, "linked": [], "volume": 17471732.0, "introduction": "Twilio, a communication tools provider, has seen success with its CustomerAI Predictions, reducing lead acquisition costs by 34% for The Motley Fool, while increasing efficiency for agents and reporting revenue of $1.19 billion.", "update": "2025-03-12", "current": 136.23, "category": "stock"}, {"company": "Kopin Corp", "symbol": "KOPN", "statement": "Kopin Corporation, a leading provider of application-specific optical systems and high-performance microdisplays, will demonstrate its day and nighttime readable visual augmentation solutions for warfighters at the SHOT Show 2025. The company recently announced its third-quarter earnings call for November 12, 2024. In other news, Kopin's stock price has been fluctuating, with a recent drop of 0.39% and a 27-year return of -64.78%. The company has also received positive attention from analysts, with a consensus rating of \"buy\" from several firms.", "keywords": ["shot", "stock", "optical", "earnings", "augmentation", "warfighters", "price", "visual", "analysts", "systems", "show", "microdisplays", "call"], "sentiment": "negative", "upside": -175.1, "linked": [], "volume": 24496832.0, "introduction": "Kopin Corporation will showcase its visual augmentation solutions for warfighters at the SHOT Show 2025 and has announced its Q3 earnings call for November 12, 2024.", "update": "2025-03-12", "current": 2.03, "category": "stock"}, {"company": "Lichen China Ltd", "symbol": "LICN", "statement": "Lichen China Limited (LICN) has been in the news recently, with the company announcing the acquisition of the remaining equity in Bondly Enterprises to strengthen AI development and business integration. The company also completed a $3.4 million registered direct offering and received a Nasdaq delisting notice. Additionally, LICN announced an effective date for a reverse stock split and name change to Lichen International Limited, and its stock has plummeted to a 52-week low, reaching $5.21. Despite the decline, the company maintains strong fundamentals with a healthy current ratio and impressive gross profit margin.", "keywords": ["delisting", "split", "offering", "fundamentals", "ratio", "margin", "integration", "acquisition", "name", "development", "change", "equity"], "sentiment": "negative", "upside": 535.4, "linked": [], "volume": 9871662.0, "introduction": "Lichen China Limited has made several announcements, including the acquisition of Bondly Enterprises, a registered direct offering, a reverse stock split, and a name change, but its stock has plummeted to a 52-week low.", "update": "2025-03-12", "current": 0.15, "category": "stock"}, {"company": "Himax Technologies Inc", "symbol": "HIMX", "statement": "Himax Technologies, Inc. (HIMX) is a fabless semiconductor company that has partnered with Tata Electronics and Powerchip Semiconductor Manufacturing Corporation to drive growth. The company's automotive display-driver sales have grown nearly 20% YoY in 2024, accounting for 50% of its revenue. Despite a 4.1% revenue decline, cost-cutting and high demand for its products have helped the company's stock outperform the Nasdaq this year. Himax has also invested in Obsidian, a manufacturer of thermal imaging sensors, to drive innovation in the field. The company's stock has a strong outlook, with a 12-month stock price forecast of $15.00, and has seen a significant decline in short interest in December.", "keywords": ["automotive", "cost", "growth", "forecast", "demand", "innovation", "investment", "semiconductor", "outlook", "technology", "display", "revenue", "partnership", "imaging"], "sentiment": "positive", "upside": -4.5, "linked": [], "volume": 18595200.0, "introduction": "Himax Technologies, a fabless semiconductor company, has driven growth through partnerships and cost-cutting measures, with its automotive display-driver sales growing 20% YoY and its stock outperforming the Nasdaq despite a revenue decline.", "update": "2025-03-12", "current": 12.85, "category": "stock"}, {"company": "Asset Entities Inc", "symbol": "ASST", "statement": "Asset Entities Inc. (ASST) has regained compliance with Nasdaq's listing rule and passed 9,000 members on its TikTok Shop Creator Discord. The company is positioned for growth through the development of innovative products and services, including lighting, building management solutions, and an audio/video control platform. Meanwhile, Arlington Capital Partners has formed GRVTY, a defense technology company, and Atlassian has institutionalized curiosity-driven innovation through its ShipIt Days. Additionally, J.P. Morgan's cross-asset strategy leverages cutting-edge technology to provide clients with industry-leading analysis and investment advice, while Synaptics has extended its award-winning connectivity portfolio.", "keywords": ["growth", "innovation", "lighting", "platform", "defense", "investment", "curiosity", "technology", "analysis", "products", "solutions", "services", "nasdaq", "connectivity", "compliance", "letmeknowifyouneedanythingelse"], "sentiment": "positive", "upside": -381.6, "linked": [], "volume": 8134097.0, "introduction": "Asset Entities Inc. (ASST) has regained Nasdaq compliance and is poised for growth through innovative products and services, while other companies like GRVTY, Atlassian, J.P. Morgan, and Synaptics are making strides in their respective industries.", "update": "2025-03-12", "current": 1.12, "category": "stock"}, {"company": "NUBURU Inc", "symbol": "BURU", "statement": "NUBURU, a leader in high-power industrial blue laser technology, has completed its first step in its strategic acquisition plan in the defense and security business sector. The company acquired a 20% ownership stake in a defense-tech company for $1.5 million in cash and $23.5 million in five-year notes with a 10% interest rate. This acquisition is part of NUBURU's comprehensive growth and diversification strategy, expanding into complementary domains such as the defense sector. The company's new management team, led by Executive Chairman Alessandro Zamboni, is focused on leveraging the company's technology to create new applications and drive growth.", "keywords": ["industry", "growth", "diversification", "defense", "investment", "business", "innovation", "management", "sector", "leadership", "expansion", "technology", "strategy", "acquisition", "laser", "security", "finance"], "sentiment": "positive", "upside": -1380.9, "linked": ["MSFT : Microsoft is transforming businesses with AI, investing in new capabilities and training to help organizations reinvent their functions with generative and agentic AI, and expanding its cloud and AI infrastructure in South Africa with a $297 million investment."], "volume": 13185179.0, "introduction": "NUBURU, a leader in high-power industrial blue laser technology, has acquired a 20% stake in a defense-tech company for $24.5 million to expand into the defense sector and drive growth.", "update": "2025-03-12", "current": 0.43, "category": "stock"}, {"company": "Aclarion Inc", "symbol": "ACON", "statement": "Aclarion, a company that uses remote MRIs to assess back pain, has expanded its presence in the US with over a dozen locations, including partnerships with New Jersey Imaging and Lenox Hill Radiology. The company's Nociscan SaaS platform uses biomarkers and AI algorithms to help physicians identify chronic low back pain. Aclarion has announced plans to expand Nociscan access across key markets in New York and New Jersey, building on previously established sites with RadNet affiliates. The company's stock (ACON) has seen a decline of around 80% in recent days.", "keywords": ["newyork", "backpain", "saas", "stock", "mri", "decline", "lowbackpain", "expansion", "biomarkers", "physicians", "ai", "partnerships", "chronic", "newjersey", "us"], "sentiment": "negative", "upside": -792.2, "linked": [], "volume": 65850400.0, "introduction": "Aclarion, a company using remote MRIs and AI to assess back pain, has expanded its US presence with over a dozen locations, including partnerships with New Jersey Imaging and Lenox Hill Radiology.", "update": "2025-03-12", "current": 0.04, "category": "stock"}, {"company": "Kraft Heinz Co", "symbol": "KHC", "statement": "Kraft Heinz has made significant investments in its manufacturing site in Alfaro, Spain, with a €70 million expansion in 2021, creating 39 new jobs and boosting production by 50%. The company is also investing in technology-led solutions to improve operational efficiencies and expand gross margins modestly in 2025. With 75% of its 2025 innovation pipeline secured, Kraft Heinz aims to drive top-line growth and expand its product offerings, including its new low-calorie Crystal Light Vodka Refreshers. The company has also been called upon by Health and Human Services Secretary Robert F. Kennedy Jr. to remove artificial dyes from its products, a move that could have a positive impact on its net margins.", "keywords": ["efficiency", "growth", "artificial", "refreshers", "margins", "innovation", "jobs", "investments", "dyes", "manufacturing", "expansion", "technology", "offerings", "vodka", "product", "production", "pipeline"], "sentiment": "positive", "upside": -3.4, "linked": [], "volume": 9760296.0, "introduction": "Kraft Heinz invested €70 million in its Spanish manufacturing site, creating 39 new jobs and boosting production by 50%, and aims to drive top-line growth and expand product offerings, including new low-calorie products and removing artificial dyes.", "update": "2025-03-12", "current": 29.31, "category": "stock"}, {"company": "Deep Medicine Acquisition Corp", "symbol": "TRUG", "statement": "Several companies have announced acquisitions and appointments in the AI and healthcare industries. Tempus AI acquired Deep 6 AI, while moveUP.care acquired Deep Structure.ai. TruGolf Holdings, Inc. and Deep Medicine Acquisition Corp. made a deal, and DeepRx Inc. appointed a new CEO. The article \"Top 25 AI Companies That Are Leading Innovation in 2025\" highlights companies like Adobe Sensei and Lila, which are driving innovation in AI. Additionally, the article \"Artificial Intelligence Influence on Healthcare Industry Reaching All Time High\" discusses Tempus AI's financial results and the growing influence of AI in healthcare.", "keywords": ["financial", "article", "innovation", "results", "acquisitions", "technology", "ceo", "influence", "appointments", "industries", "ai", "deal", "healthcare", "companies"], "sentiment": "positive", "upside": -147.7, "linked": [], "volume": 8554142.0, "introduction": "Several companies in the AI and healthcare industries have made acquisitions, appointments, and achieved notable milestones, with Tempus AI and others driving innovation and growth in the sector.", "update": "2025-03-12", "current": 0.56, "category": "stock"}, {"company": "SPI Energy Co Ltd", "symbol": "SPI", "statement": "SPI Energy Co Ltd (SPIEF:OTC US) has seen its stock price pass above its 200-day moving average, with Group One Trading LLC increasing its position in the company by 1,722.4% in the fourth quarter. The company's earnings surprise summary shows a mix of beats and misses, with actual revenue and EPS varying from consensus estimates. The article also mentions the Trump administration's efforts to reduce barriers to private sector investment and streamline regulations to support domestic resource development in the clean energy sector. Additionally, National Grid Partners has committed $100 million to invest in AI startups, and SPI Energy's stock has seen increased trading volume and price movement.", "keywords": ["energy", "trump", "development", "movement", "position", "earnings", "regulations", "price", "trading", "estimates", "volume", "revenue", "administration", "stock", "startups", "investment", "moving", "eps", "average", "surprise"], "sentiment": "positive", "upside": -893.7, "linked": [], "volume": 135038940.0, "introduction": "SPI Energy Co Ltd's stock has broken above its 200-day moving average, with a significant increase in institutional investor Group One Trading LLC's stake, amid a mixed earnings report and supportive government policies and investments in the clean energy sector.", "update": "2025-03-12", "current": 0.68, "category": "stock"}, {"company": "Snow Lake Resources Ltd", "symbol": "LITM", "statement": "Snow Lake Energy, a uranium exploration and development company, has entered into a 50/50 joint venture with Global Uranium and Enrichment Limited to acquire the Pine Ridge Uranium Project in Wyoming's Powder River Basin. The company will also become a cornerstone investor by acquiring a 19.99% stake in GUE through a AUD$9 million capital raise. The transaction marks Snow Lake's strategic entry into the uranium market, with the joint venture acquiring the project for $22.5 million.", "keywords": ["energy", "joint", "market", "venture", "project", "investment", "basin", "exploration", "wyoming", "uranium", "mining", "capital", "acquisition", "development", "river", "powder"], "sentiment": "positive", "upside": -130.1, "linked": ["UEC : Uranium Energy Corp (UEC) has reported progress in production, acquisitions, and project development, including producing its first batch of Wyoming yellowcake uranium and advancing projects in Wyoming and Texas."], "volume": 32566096.0, "introduction": "Snow Lake Energy has entered into a 50/50 joint venture with Global Uranium and Enrichment Limited to acquire the Pine Ridge Uranium Project in Wyoming's Powder River Basin for $22.5 million.", "update": "2025-03-12", "current": 1.39, "category": "stock"}, {"company": "Mullen Automotive Inc", "symbol": "MULN", "statement": "Mullen Automotive (MULN) is an electric vehicle company that manufactures and distributes electric vehicles, including passenger and commercial vehicles. The company was founded in 1995 and has expanded from a small used car dealership to a robust business with two operating segments: Bollinger and Mullen Commercial. Mullen Automotive has reported its quarterly earnings, with a per-share loss of ($661.33). The company operates two vehicle plants in the US and offers a range of commercial EV trucks, including the Bollinger and Mullen I-GO.", "keywords": ["bollinger", "passenger", "manufactures", "company", "founded", "distributes", "segments", "earnings", "mullen", "vehicle", "commercial", "us", "business", "quarterly", "plants", "electric", "1995", "trucks", "loss", "expanded"], "sentiment": "negative", "upside": -11652.5, "linked": [], "volume": 10298864.0, "introduction": "Mullen Automotive is an electric vehicle company that manufactures and distributes electric vehicles, including passenger and commercial vehicles, with a quarterly loss per share of ($661.33).", "update": "2025-03-12", "current": 0.44, "category": "stock"}, {"company": "Gold Resource Corp", "symbol": "GORO", "statement": "Gold Resource Corporation (NYSE: GORO) has reached a 52-week high of $0.72, marking a significant turnaround for the company, which has seen its stock value more than double over the past year with an impressive 102.5% change. The company has announced the release of a technical report on the Don David Gold Mine and has received a consensus rating of \"Buy\" from analysts. The company's stock price has been on an upward trend, with some analysts forecasting a strong future for the company.", "keywords": ["turnaround", "rating", "stock", "forecast", "resource", "mine", "corporation", "analysts", "report", "value", "high", "gold"], "sentiment": "positive", "upside": -594.1, "linked": [], "volume": 7735557.0, "introduction": "Gold Resource Corporation's stock has more than doubled in value over the past year, reaching a 52-week high of $0.72, with analysts predicting a strong future and a \"Buy\" consensus rating.", "update": "2025-03-12", "current": 0.48, "category": "stock"}, {"company": "Cellect Biotechnology Ltd", "symbol": "QNRX", "statement": "Emergent BioSolutions and Rocketvax have announced an investment agreement and partnership to develop next-generation vaccines. The collaboration combines Rocketvax's innovative vaccine technology with Emergent's production and regulatory expertise. This partnership aims to accelerate the development of vaccines and improve global public health. Additionally, Coeptis Therapeutics has secured worldwide development and commercialization rights to an allogeneic cellular immunotherapy platform and DVX201, a clinical-stage asset from Deverra Therapeutics.", "keywords": ["public", "investment", "platform", "immunotherapy", "therapeutics", "vaccines", "technology", "stage", "asset", "clinical", "development", "partnership", "expertise", "health"], "sentiment": "positive", "upside": -637.6, "linked": ["RNAZ : TransCode Therapeutics, a clinical-stage oncology company, is developing RNA therapeutics to treat cancer, with its lead candidate targeting microRNA-10b and recently completing a private placement and reverse stock split."], "volume": 60422240.0, "introduction": "Emergent BioSolutions and Rocketvax have partnered to develop next-generation vaccines, combining their expertise in production and regulatory affairs with Rocketvax's innovative technology to accelerate vaccine development and improve global public health.", "update": "2025-03-12", "current": 0.41, "category": "stock"}, {"company": "Save Foods Inc", "symbol": "NITO", "statement": "The food industry is undergoing significant changes, with companies like Inline Plastics developing innovative packaging solutions to ensure food safety and freshness. The future of food preservation is focused on sustainability, innovation, and consumer-centric approaches. Companies like N2OFF, Inc. and US Foods are working to improve food safety and supply chain efficiency. Meanwhile, small brands are gaining market share as consumers become more price-conscious. The charcuterie market is also evolving, with companies like Olli Salumeria offering unique products. Additionally, companies are embracing curiosity-driven innovation and institutionalizing it through programs like Atlassian's ShipIt Days.", "keywords": ["efficiency", "safety", "market", "share", "consciousness", "innovation", "institutionalization", "curiosity", "chain", "supply", "price", "uniqueness", "preservation", "freshness", "sustainability", "consumer"], "sentiment": "positive", "upside": -234.4, "linked": [], "volume": 122185940.0, "introduction": "The food industry is undergoing significant changes, driven by a focus on sustainability, innovation, and consumer-centric approaches, with companies developing innovative packaging solutions, improving food safety and supply chain efficiency, and small brands gaining market share.", "update": "2025-03-12", "current": 1.17, "category": "stock"}, {"company": "Mersana Therapeutics Inc", "symbol": "MRSN", "statement": "Mersana Therapeutics, a company that develops Antibody-Drug Conjugate (ADC) technology, presented at the Leerink Global Healthcare Conference, highlighting its promising developments and ongoing challenges. Industry analysts have upgraded their estimates for the company, predicting a 33% decline in revenue and a 27% increase in losses. Mersana's Q3 2024 earnings call transcript and business update were also released, providing insight into the company's financials and future growth prospects. With 14 analysts covering the company, estimates suggest a revenue of $27 million in 2025, and a stock price of around $0.53.", "keywords": ["growth", "conjugate", "mersana", "earnings", "price", "estimates", "revenue", "conference", "losses", "stock", "business", "transcript", "drug", "prospects", "update", "technology", "analysts", "leerink", "financials", "antibody", "healthcare", "call"], "sentiment": "negative", "upside": -601.5, "linked": [], "volume": 18574278.0, "introduction": "Mersana Therapeutics presented at the Leerink Global Healthcare Conference, highlighting its ADC technology developments and challenges, with analysts upgrading estimates for a 33% revenue decline and 27% increase in losses.", "update": "2025-03-12", "current": 0.64, "category": "stock"}, {"company": "Arrowroot Acquisition Corp", "symbol": "AILE", "statement": "Avant Technologies and its partner Ainnova have partnered to align their technologies. NUBURU has made its first acquisition in the defense industry. Top 25 AI companies are leading innovation in various industries, including Adobe Sensei's AI-driven solutions. Atomiq Inc., a subsidiary of Kronos Advanced Technologies, is shaping industries with cutting-edge solutions. IBM has acquired HashiCorp, and AGCO Corporation is revolutionizing agriculture robotics. 1606 Corp. is being acquired by a private group to enter the AI market. Ingersoll Rand is buying SPX Flow's Air Treatment Unit for $525M. NANO Nuclear Energy is seeking to become a commercially focused company, and PDF Solutions has completed the acquisition of secureWISE, LLC.", "keywords": ["energy", "partnership", "agriculture", "solutions", "leader", "defense", "intelligence", "cutting-edge", "industry", "artificial", "robotics", "innovation", "business", "nuclear", "software", "acquisition", "cybersecurity", "technology", "ai", "hardware", "market"], "sentiment": "positive", "upside": -53363.0, "linked": ["PLTR : Palantir Technologies has made significant advancements in deploying AI-powered systems, delivering mobile battle stations to the US Army and partnering with Shanghai Jiao Tong University to focus on emerging industries, while also securing defense contracts and experiencing a 204% stock surge in the past year."], "volume": 11964075.0, "introduction": "Several companies, including Avant Technologies, Atomiq Inc., IBM, AGCO Corporation, and others, have made acquisitions, partnerships, and investments in various industries, including AI, defense, agriculture, and more.", "update": "2025-03-12", "current": 0.42, "category": "stock"}, {"company": "Ostin Technology Group Co Ltd", "symbol": "OST", "statement": "Ostin Technology Group Co Ltd is a Chinese company that manufactures and supplies display modules and polarizers, primarily used in thin film transistor liquid crystal display (TFT-LCD) modules. The company's stock price has fallen 4.38% since February 27, 2025, and has been down 8.4% in the last 10 days. The company competes with other display panel and home appliance manufacturers in the development of cutting-edge semiconductor display technologies for various applications, including smartphones, TVs, and virtual reality.", "keywords": ["competition", "tft-lcd", "china", "stock", "smartphones", "price", "modules", "technology", "semiconductor", "company", "tvs", "display", "virtualreality", "polarizers"], "sentiment": "negative", "upside": -857.8, "linked": [], "volume": 11619682.0, "introduction": "Ostin Technology Group Co Ltd is a Chinese company that manufactures and supplies display modules and polarizers for TFT-LCD modules, with its stock price declining 4.38% since February 2025.", "update": "2025-03-12", "current": 2.7, "category": "stock"}, {"company": "Evaxion Biotech A/S", "symbol": "EVAX", "statement": "Evaxion Biotech A/S (EVAX) is a clinical-stage biotech company developing AI-driven immunotherapies to treat cancer and infectious diseases. The company's stock has seen recent fluctuations, with a 7.32% fluctuation on the last trading day and a -25.69% loss over the past 10 days. Analysts have a buy consensus rating, and the company is developing several immunotherapies, including EVX-01 and EVX-02. Manufacturer Emergent has invested in the company's next-gen vaccine portfolio.", "keywords": ["cancer", "rating", "stock", "biotech", "consensus", "trading", "immunotherapies", "analysts", "portfolio", "diseases", "infectious", "vaccine"], "sentiment": "positive", "upside": -1554.8, "linked": [], "volume": 55592724.0, "introduction": "Evaxion Biotech A/S is a clinical-stage biotech company developing AI-driven immunotherapies for cancer and infectious diseases, with a buy consensus rating and recent stock fluctuations.", "update": "2025-03-12", "current": 6.03, "category": "stock"}, {"company": "Windtree Therapeutics Inc", "symbol": "WINT", "statement": "Windtree Therapeutics, Inc. (WINT) is a biotechnology company focused on developing therapeutics for cardiovascular and oncology diseases. The company has strengthened its intellectual property portfolio with a new Japanese patent for its oncology pipeline. WINT has announced a new corporate strategy to identify and acquire FDA-approved revenue assets while advancing its cardiovascular and oncology pipeline. The company's lead product candidate, istaroxime, is in Phase 2b clinical trial for the treatment of acute decompensated heart failure and cardiogenic shock. WINT's stock price is currently $1.90, with a 200-day simple moving average of $132.53. The company is expected to issue its next earnings report on 03/28/2025.", "keywords": ["candidate", "report", "stock", "treatment", "earnings", "assets", "product", "oncology", "cardiovascular", "strategy", "biotechnology", "price", "average", "portfolio", "patent", "trial", "therapeutics", "pipeline"], "sentiment": "positive", "upside": -2551.6, "linked": [], "volume": 52615884.0, "introduction": "Windtree Therapeutics, a biotech company, is developing therapeutics for cardiovascular and oncology diseases, with a focus on advancing its pipeline and acquiring FDA-approved revenue assets.", "update": "2025-03-12", "current": 0.18, "category": "stock"}, {"company": "GlucoTrack Inc", "symbol": "GCTK", "statement": "GlucoTrack, Inc. is a medical device company that develops non-invasive glucose monitoring devices for people with diabetes and pre-diabetics. The company has raised $10 million in a public offering and private placement, and its stock has decreased 98.81% in the past year, closing at $0.37. GlucoTrack's device, GlucoTrack, measures real-time blood glucose levels without the need for painful finger pricking. The company is focused on making diabetes management more accurate and convenient for daily living.", "keywords": ["stock", "medical", "investment", "diabetes", "innovation", "device", "accuracy", "technology", "monitoring", "company", "glucose", "health", "finance", "convenience"], "sentiment": "negative", "upside": -5239.8, "linked": [], "volume": 31951254.0, "introduction": "GlucoTrack, Inc. is a medical device company that has raised $10 million to develop non-invasive glucose monitoring devices for people with diabetes and pre-diabetics, with its stock experiencing a significant decline.", "update": "2025-03-12", "current": 0.09, "category": "stock"}, {"company": "Allarity Therapeutics Inc", "symbol": "ALLR", "statement": "Allarity Therapeutics, Inc. (ALLR) is a Phase 2 clinical-stage pharmaceutical company developing personalized cancer treatments. The company has announced a stock buyback program and plans to repurchase up to $5 million in shares. Allarity is also conducting a Phase 2 clinical trial evaluating the combination of estenoparib with temozolomida for various cancer indications. The company's stock has seen a significant decrease in market capitalization since December 2021, from $79.38 million to $4.70 million.", "keywords": ["cancer", "temozolomida", "stock", "biotech", "pharmaceuticals", "oncology", "buyback", "capitalization", "phase2", "clinical", "market", "estenoparib", "repurchase"], "sentiment": "negative", "upside": -1706.1, "linked": [], "volume": 9265936.0, "introduction": "Allarity Therapeutics, Inc., a Phase 2 clinical-stage pharmaceutical company, has announced a stock buyback program and is conducting a Phase 2 clinical trial, while its stock has seen a significant decline in market capitalization since December 2021.", "update": "2025-03-12", "current": 1.32, "category": "stock"}, {"company": "Luna Innovations Inc", "symbol": "LUNA", "statement": "Luna Innovations is a company that researches, develops, and commercializes innovative technologies in molecular technology and sensing solutions. They have acquired Silixa, a UK-based leader in distributed fiber optic sensing solutions, and have partnered with Carilion Health System to develop a biomedical cluster in southwest Virginia. Luna Innovations is a leader in advanced fiber optic-based technology, providing solutions for healthcare, telecommunications, energy, and defense markets. The company has a strong focus on research and development, allowing it to provide cutting-edge products that meet evolving market needs.", "keywords": ["energy", "defense", "sensing", "research", "telecommunications", "fiber", "technology", "cluster", "innovations", "solutions", "acquisition", "development", "partnership", "optic", "healthcare", "biomedical"], "sentiment": "positive", "upside": -276.4, "linked": [], "volume": 12151284.0, "introduction": "Luna Innovations is a company that develops and commercializes innovative technologies in molecular technology and sensing solutions, with a focus on fiber optic-based solutions for various markets, including healthcare, telecommunications, energy, and defense.", "update": "2025-03-12", "current": 0.89, "category": "stock"}, {"company": "Chanson International Holding", "symbol": "CHSN", "statement": "Chanson International Holding is a holding company that manufactures and sells a range of bakery products, seasonal products, and beverage products through a chain of stores in China and the US. The company's products include sandwiches, salads, toasts, croissants, soups, and desserts, as well as beverages and juice. The company's financials and stock price are publicly available, and it has received recognition as one of the top 25 AI companies leading innovation in 2025.", "keywords": ["croissants", "chain", "holding", "company", "china", "price", "toasts", "us", "juice", "stock", "sandwiches", "innovation", "beverages", "products", "beverage", "stores", "soups", "bakery", "salads", "seasonal", "financials", "ai", "desserts"], "sentiment": "positive", "upside": -119.9, "linked": [], "volume": 21119074.0, "introduction": "Chanson International Holding is a holding company that manufactures and sells bakery, seasonal, and beverage products through stores in China and the US, and has received recognition as one of the top 25 AI companies leading innovation in 2025.", "update": "2025-03-12", "current": 0.82, "category": "stock"}, {"company": "Hepion Pharmaceuticals Inc", "symbol": "HEPA", "statement": "Hepion Pharmaceuticals, Inc. (HEPA) is a pharmaceutical company that was formerly known as ContraVir Pharmaceuticals, Inc. It was incorporated in 2013 and is involved in the development of therapies for various diseases. The company has received funding and has undergone a reverse merger with Pharma Two B Ltd. for a valuation of approximately $58.5 million. The company's stock has been declining, with a recent 7-day loss of 84.76%. Analysts have issued sell ratings and price targets for the stock, while the company has received FDA approval for its OMLYCLO product.", "keywords": ["merger", "stock", "ratings", "funding", "loss", "therapies", "valuation", "pharmaceuticals", "targets", "analysts", "approval", "company", "development", "product", "diseases"], "sentiment": "negative", "upside": -8255.4, "linked": [], "volume": 534644670.0, "introduction": "Hepion Pharmaceuticals, Inc. (HEPA) is a pharmaceutical company that has received FDA approval for its OMLYCLO product and has undergone a reverse merger, but its stock has been declining with a recent 7-day loss of 84.76%.", "update": "2025-03-12", "current": 0.2, "category": "stock"}, {"company": "China Liberal Education Holdings Ltd", "symbol": "CLEU", "statement": "China Liberal Education Holdings Limited (CLEU) is an educational services company operating in China, providing services and products under the China Liberal brand. The company operates in five segments: Sino-foreign Jointly Managed Academic Programs, Textbooks and Course Material Sales, Overseas Study Consulting Services, Technological Consulting Services for schools, and others. The company has seen a significant decline in market capitalization since May 2020, with a compound annual growth rate of -23.50%. The stock has been experiencing volatility, with a 42.06% loss in the last 2 weeks. Despite this, the company provides educational services and products under the China Liberal brand name in the People's Republic of China, offering Sino-foreign jointly managed academic programs, including undergraduate and postgraduate education, diploma and non-degree higher education, and senior secondary education.", "keywords": ["growth", "schools", "programs", "higher", "company", "services", "secondary", "china", "volatility", "liberal", "academic", "capitalization", "diploma", "operating", "textbooks", "products", "undergraduate", "postgraduate", "loss", "consulting", "technology", "education", "brand"], "sentiment": "negative", "upside": -124.2, "linked": [], "volume": 26378912.0, "introduction": "China Liberal Education Holdings Limited, an educational services company operating in China, has seen a significant decline in market capitalization and volatility, despite providing educational services and products under the China Liberal brand.", "update": "2025-03-12", "current": 7.11, "category": "stock"}, {"company": "Transcode Therapeutics Inc", "symbol": "RNAZ", "statement": "TransCode Therapeutics, Inc. (RNAZ) is a clinical-stage oncology company focused on developing RNA therapeutics to treat cancer. The company's lead therapeutic candidate, TTX-MC138, targets microRNA-10b, a master regulator of metastatic cell viability in various cancers. The company has announced an $8 million private placement and a 1-for-33 reverse stock split. The stock has been declining, with a 10-day loss of 18.23% and a 1-day loss of 7.10%. Analysts have given the company a moderate buy rating, and the company has announced the adjournment of a special meeting and the intent to enter into a partnership with Ayrmid Pharma Ltd. for the production of Omisirge.", "keywords": ["medicine", "illness", "survival", "treatment", "stocks", "pharmaceuticals", "disease", "metastasis", "science", "clinicaltrial", "development", "capital", "therapy", "entrepreneurship", "capitalist", "healthcare", "research", "cell", "investing", "biotechnology", "stockmarket", "clinical", "therapeutics", "health", "investment", "oncology", "acquisition", "market", "gene", "finance", "rna", "patient", "cancer", "merger", "venture", "biotech", "medical", "viability", "cancerous", "partnership", "tumor"], "sentiment": "negative", "upside": -1622.6, "linked": ["QNRX : Emergent BioSolutions and Rocketvax have partnered to develop next-generation vaccines, combining their expertise in production and regulatory affairs with Rocketvax's innovative technology to accelerate vaccine development and improve global public health."], "volume": 12648869.0, "introduction": "TransCode Therapeutics, a clinical-stage oncology company, is developing RNA therapeutics to treat cancer, with its lead candidate targeting microRNA-10b and recently completing a private placement and reverse stock split.", "update": "2025-03-12", "current": 7.04, "category": "stock"}, {"company": "BTC Digital Ltd", "symbol": "BTCT", "statement": "BTC Digital Ltd (BTCT) is a crypto asset technology company that engages in bitcoin mining and resale/rental of mining machines. The company was formerly known as Meten Holding Group Ltd and changed its name in August 2023. It has secured $20 million in funding to advance green sustainability and industry innovation. The company's stock has seen fluctuations in recent days, with some articles discussing its performance and predictions for future growth.", "keywords": ["industry", "growth", "funding", "innovation", "performance", "predictions", "bitcoin", "technology", "mining", "company", "sustainability", "crypto"], "sentiment": "positive", "upside": -106.4, "linked": [], "volume": 13010535.0, "introduction": "BTC Digital Ltd (BTCT) is a crypto asset technology company that engages in bitcoin mining and resale/rental of mining machines, with a focus on green sustainability and industry innovation.", "update": "2025-03-12", "current": 7.46, "category": "stock"}, {"company": "Starbox Group Holdings Ltd", "symbol": "STBX", "statement": "Starbox Group Holdings Ltd. (STBX) is a company that provides cash rebates, digital advertising, and payment solutions to retail merchants in Malaysia. The company's market capitalization has decreased by 91.11% since its IPO in August 2022, with a current market cap of $61.59M. The company has received a staff determination notice from an unnamed organization and has announced financial results for fiscal year 2022, showing a 127.2% increase in revenue and a 148.8% increase in net income. The company's stock price has fluctuated in recent days, with a 6.85% gain on its last trading day, and has been trending upward over the past two weeks.", "keywords": ["financial", "ipo", "results", "rebates", "solutions", "capital", "advertising", "price", "trading", "capitalization", "notice", "revenue", "stock", "income", "payment", "malaysia", "merchants", "retail", "market"], "sentiment": "positive", "upside": -969.9, "linked": [], "volume": 43502772.0, "introduction": "Starbox Group Holdings Ltd., a Malaysian company providing cash rebates, digital advertising, and payment solutions, has seen its market capitalization drop 91.11% since its IPO, but has reported significant revenue and net income growth, with its stock price experiencing recent fluctuations.", "update": "2025-03-12", "current": 0.58, "category": "stock"}]