[{"company": "ELEVAI Labs Inc", "symbol": "ELAB", "statement": "Elevai Labs, a skincare development company, is a subsidiary of PMGC Holdings Inc. The company uses cutting-edge science and next-generation consumer applications to solve unmet needs in the medical aesthetics space. Elevai Labs is listed on the NASDAQ under the ticker symbol ELAB, with a current ratio of 3.86 and a debt-to-equity ratio of 0.06. The company's products are designed to improve skin health, and it has a subsidiary called Northstrive Biosciences that focuses on developing aesthetic medicines.", "keywords": ["technology", "products", "research", "medicine", "biotechnology", "debt", "science", "market", "aesthetics", "ratio", "finance", "pharmaceuticals", "equity", "beauty", "medical", "health", "cosmetics", "applications", "innovation", "skincare", "development", "investment", "nasdaq", "stock", "wellness"], "sentiment": "positive", "upside": -440.6, "linked": ["CLEU : China Liberal Education Holdings Limited (CLEU) provides educational services and products in China, with revenue decreasing by 83.63% year-over-year and a fluctuating stock price."], "volume": 76778720.0, "introduction": "Elevai Labs, a skincare company listed on NASDAQ under ELAB, uses cutting-edge science to develop products that improve skin health and has a subsidiary focused on aesthetic medicines.", "update": "2025-02-23", "current": 3.1, "category": "stock"}, {"company": "NVIDIA Corp", "symbol": "NVDA", "statement": "NVIDIA Corporation has been making headlines with its advancements in AI technology, including a new Ethernet switch that accelerates AI storage by up to 48%. The company will also be participating in the NVIDIA GTC AI Conference, where attendees can learn about the latest AI innovations and solutions. Additionally, NVIDIA's stock has seen a 6.81% increase in the last week, and the company has received an unsolicited offer to purchase up to 1 million shares of its common stock. The company has also unveiled its new Evo 2 AI model, which is advancing genomic research, and has launched its GeForce RTX 5070 Ti, a new graphics card that promises significant improvements in performance and AI-driven graphics enhancements.", "keywords": ["technology", "stock", "research", "artificial", "intelligence", "performance", "graphics", "enhancement", "offer", "ethernet", "innovation", "genomic", "switch", "conference", "purchase"], "sentiment": "positive", "upside": -54.9, "linked": ["INTC : Intel is collaborating with Samsung Display to develop next-generation AI PCs with advanced screens, and highlighting its own AI capabilities, packaging and testing innovations, and commitment to responsible AI research and sustainability."], "volume": 232797900.0, "introduction": "NVIDIA has made significant advancements in AI technology, including a new Ethernet switch, a new AI model, and a graphics card, while also seeing a stock price increase and receiving an unsolicited offer to purchase shares.", "update": "2025-02-23", "current": 142.62, "category": "stock"}, {"company": "Marathon Digital Holdings Inc", "symbol": "MARA", "statement": "Marathon Digital Holdings Inc., a digital asset technology firm, mines digital assets, particularly in the bitcoin ecosystem. The company was previously known as Marathon Digital Holdings Inc. and changed its name to MARA Holdings Inc. in August 2024. The company's stock price has been fluctuating, with recent drops in value due to regulatory concerns and market competition. Despite this, the company is exploring new products, such as a potential Bitcoin exchange-traded fund.", "keywords": ["technology", "products", "digital", "ecosystem", "bitcoin", "assets", "etf", "company", "mining", "firm", "competition", "stock", "price", "regulatory"], "sentiment": "negative", "upside": -57.7, "linked": [], "volume": 45912380.0, "introduction": "Marathon Digital Holdings Inc., a digital asset technology firm, mines digital assets, particularly in the bitcoin ecosystem, and is exploring new products despite fluctuating stock prices and regulatory concerns.", "update": "2025-02-23", "current": 19.99, "category": "stock"}, {"company": "Super Micro Computer Inc", "symbol": "SMCI", "statement": "Super Micro Computer Inc. (SMCI) stock has been surging, driven by its cutting-edge cooling technology and data center solutions. The company aims to reach $40B in revenue by 2026, and recent news has led to a 6.47% increase in stock value. Investors are optimistic about the company's potential, with hedge funds holding 45% of the company's shares. The company has also secured $700M in convertible notes and amended its convertible senior notes, which could lead to further growth. With its AI data center solutions and partnerships with companies like NVIDIA, Super Micro Computer may be an attractive investment opportunity.", "keywords": ["technology", "funds", "nvidia", "data", "surging", "partnerships", "solutions", "notes", "ai", "cooling", "center", "revenue", "increase", "hedge", "growth", "stock", "opportunity", "optimistic"], "sentiment": "positive", "upside": 55.0, "linked": [], "volume": 31511748.0, "introduction": "Super Micro Computer Inc. (SMCI) stock is surging due to its innovative cooling technology and data center solutions, with investors optimistic about its potential to reach $40B in revenue by 2026.", "update": "2025-02-23", "current": 33.27, "category": "stock"}, {"company": "Archer Aviation Inc", "symbol": "ACHR", "statement": "Archer Aviation, a newly founded company, has raised $300 million to develop its hybrid defense aircraft platform, which will be used for military purposes. The company has also received FAA certification to launch its pilot training program, allowing it to train and qualify pilots for its planned commercial air taxi service. Archer has also launched a dedicated division focused on hybrid VTOL aircraft for military use, which the US Department of Defense is exploring as an alternative to traditional aviation technologies.", "keywords": ["taxi", "division", "training", "service", "alternative", "defense", "hybrid", "platform", "vtol", "pilot", "aircraft", "military", "certification", "aviation"], "sentiment": "positive", "upside": -152.8, "linked": [], "volume": 33892816.0, "introduction": "Archer Aviation, a newly founded company, has raised $300 million to develop a hybrid defense aircraft platform for military purposes, received FAA certification for its pilot training program, and launched a division for hybrid VTOL aircraft for military use.", "update": "2025-02-23", "current": 9.97, "category": "stock"}, {"company": "Rigetti Computing Inc", "symbol": "RGTI", "statement": "Rigetti Computing, a quantum computing company, has secured $100 million in funding to develop next-generation quantum systems. The company's roadmap for 2025 includes the introduction of a new modular system architecture and a 36-qubit system release by mid-year, with plans for a system with over 100 qubits by year-end. The company's stock has seen significant growth, with some predicting a price of $10.65 by the end of April 2025. Despite the volatility, Rigetti's short interest is considered fair, and the company is expected to post a loss of $0.08 per share for the current quarter.", "keywords": ["stock", "computing", "volatility", "qubits", "loss", "quarter", "prediction", "company", "funding", "architecture", "growth", "system", "roadmap", "quantum"], "sentiment": "positive", "upside": -109.5, "linked": [], "volume": 212161810.0, "introduction": "Rigetti Computing, a quantum computing company, has secured $100 million in funding to develop next-generation quantum systems, with plans to release a 36-qubit system by mid-2025 and a system with over 100 qubits by year-end.", "update": "2025-02-23", "current": 13.2, "category": "stock"}, {"company": "Tesla Inc", "symbol": "TSLA", "statement": "Tesla is rolling out its new 2025 motor, which promises increased range and durability. The new model features eight cameras on the exterior, including a self-washing front bumper. Tesla's innovative technology and commitment to sustainability are driving its growth, with its electric vehicles and energy storage systems gaining popularity. The company is also expanding its production capacity with its Giga Press, which reduces robots and saves space. Additionally, Tesla is opening a new Gigafactory in Mexico, which will increase its production capacity. Overall, Tesla is expected to continue its innovative edge in the electric vehicle market, with its 2025 models offering improved performance and sustainability.", "keywords": ["technology", "range", "energy", "growth", "performance", "edge", "electric", "cameras", "innovation", "durability", "sustainability", "bumper", "robots", "production", "capacity", "storage"], "sentiment": "positive", "upside": -75.6, "linked": [], "volume": 55806692.0, "introduction": "Tesla is introducing its new 2025 motor with increased range and durability, featuring advanced cameras and sustainability-focused design, and expanding production capacity through new robots and factories.", "update": "2025-02-23", "current": 406.58, "category": "stock"}, {"company": "Plug Power Inc", "symbol": "PLUG", "statement": "Plug Power, a leader in green hydrogen solutions, is expanding its global footprint with plans for multi-gigawatt electrolyzer projects in India and a liquid hydrogen pricing program. The company is also facing financial struggles and challenges in profitability, but is positioning itself for growth in the evolving clean energy landscape. With its GenKey system and GenDrive technology, Plug Power is a key player in the push towards a green hydrogen economy, and its joint venture with Olin Corporation aims to produce 1,000 tons per day of liquid hydrogen by 2028.", "keywords": ["technology", "energy", "renewable", "partnership", "olin", "india", "hydrogen", "economy", "power", "expansion", "profitability", "green", "innovation", "sustainability", "venture", "growth", "clean", "challenges"], "sentiment": "positive", "upside": -472.4, "linked": [], "volume": 75948296.0, "introduction": "Plug Power, a leader in green hydrogen solutions, is expanding globally with multi-gigawatt electrolyzer projects in India and a liquid hydrogen pricing program, despite facing financial struggles and challenges in profitability.", "update": "2025-02-23", "current": 2.08, "category": "stock"}, {"company": "Intel Corp", "symbol": "INTC", "statement": "Intel and Samsung Display are collaborating to advance next-generation AI PCs, refining screens that work seamlessly with Intel's processors with AI capabilities. Intel is also highlighting its Foundry Direct Connect, exploring cutting-edge packaging and test solutions, and showcasing its presence at the IEEE International Solid-State Circuits Conference. Additionally, Intel is recruiting clients for its US-made 18A chips, promoting its AI PC capabilities, and highlighting its IoT Market Ready Solutions and IoT RFP Ready Kits. The company is also emphasizing its commitment to responsible AI research, academic collaborations, and sustainability.", "keywords": ["technology", "research", "processor", "packaging", "software", "circuits", "test", "networking", "cloud", "artificial", "intelligence", "display", "sustainability", "pc", "conference", "chip", "international", "foundry", "solid-state", "ai", "academic", "collaboration", "innovation", "computing", "development", "solutions", "cybersecurity", "edge", "hardware", "industry", "iot"], "sentiment": "positive", "upside": -188.8, "linked": ["NVDA : NVIDIA has made significant advancements in AI technology, including a new Ethernet switch, a new AI model, and a graphics card, while also seeing a stock price increase and receiving an unsolicited offer to purchase shares."], "volume": 65888810.0, "introduction": "Intel is collaborating with Samsung Display to develop next-generation AI PCs with advanced screens, and highlighting its own AI capabilities, packaging and testing innovations, and commitment to responsible AI research and sustainability.", "update": "2025-02-23", "current": 20.83, "category": "stock"}, {"company": "Palantir Technologies Inc", "symbol": "PLTR", "statement": "Palantir Technologies Inc. (PLTR) has seen a significant surge in its stock price, with a 39% EPS upgrade and a buy rating from Loop Capital. The company has secured several key partnerships, including a $36.8 million contract expansion with the Special Operations Command and a strategic partnership with SAUR Group to enhance contract management. Palantir has also reached a key milestone, with its software company soaring over 340% last year. Despite some insider selling, analysts remain optimistic about the company's growth prospects, citing its cutting-edge AI platform and potential for increased smartphone costs.", "keywords": ["contract", "upgrade", "eps", "partnerships", "ai", "buy", "milestone", "platform", "palantir", "surge", "expansion", "costs", "inc", "growth", "technologies", "prospects"], "sentiment": "positive", "upside": -93.4, "linked": [], "volume": 55107276.0, "introduction": "Palantir Technologies Inc. (PLTR) has seen a significant surge in its stock price, driven by EPS upgrades, key partnerships, and a 340% increase in its software company last year, with analysts remaining optimistic about its growth prospects.", "update": "2025-02-23", "current": 78.98, "category": "stock"}, {"company": "Thoughtworks Holding Inc", "symbol": "TWKS", "statement": "Thoughtworks, a technology company, is shifting its focus to modernization as a path to growth, rather than a cost-cutting measure. The company's quarterly earnings report showed a revenue decline, but its CEO emphasized the benefits of modernization, including the ability to quickly release new products and features, reduce costs, and avoid regulatory risks. Meanwhile, the company is showcasing its cutting-edge technologies at conferences and events, and is being recognized as a leader in AI innovation. Additionally, other companies are also showcasing their latest technologies, including GE Healthcare, HP, and Adobe, which are all highlighting their advancements in AI and machine learning.", "keywords": ["cost-cutting", "technology", "products", "benefits", "leader", "features", "ai", "conferences", "events", "revenue", "modernization", "innovation", "regulation", "earnings", "advancements", "growth", "machine-learning", "ceo"], "sentiment": "positive", "upside": -139.97, "linked": [], "volume": 52182156.0, "introduction": "Thoughtworks is shifting its focus to modernization as a path to growth, highlighting benefits such as rapid product and feature releases, cost reduction, and regulatory risk avoidance.", "update": "2025-02-23", "current": 4.47, "category": "stock"}, {"company": "Rivian Automotive Inc", "symbol": "RIVN", "statement": "Rivian, an electric vehicle manufacturer, has made significant strides in the industry with its innovative technology and partnership with Amazon. The company has reported its first gross profit and beat revenue estimates, despite delivering fewer vehicles this year due to slowing demand. Rivian's unique approach to the EV market, including its direct-to-consumer sales model and charging infrastructure, has positioned it as a strong contender in the long-term EV landscape. The company's founder and CEO, RJ Scaringe, has emphasized the importance of AI and self-driving cars in the industry, and Rivian's advanced autonomous driving system, DRIV3R-Assist, underscores its focus on safety and innovation.", "keywords": ["technology", "demand", "vehicle", "infrastructure", "safety", "contender", "landscape", "amazon", "autonomous", "ai", "manufacturer", "revenue", "ev", "electric", "innovation", "sales", "ceo", "profit", "partnership", "market"], "sentiment": "positive", "upside": -311.9, "linked": ["NIO : NIO, a Chinese electric vehicle manufacturer, has partnered with ZF to incorporate its steer-by-wire technology in its ET9 \"SkyRide\" chassis, setting a new industry benchmark."], "volume": 31308816.0, "introduction": "Rivian, an electric vehicle manufacturer, has made a strong debut with its innovative technology and partnership with Amazon, reporting its first gross profit and beating revenue estimates despite slower demand, positioning it as a contender in the long-term EV landscape.", "update": "2025-02-23", "current": 12.77, "category": "stock"}, {"company": "SoFi Technologies Inc", "symbol": "SOFI", "statement": "SoFi Technologies Inc. (SOFI) has seen its stock price surge 18% in five days, driven by its record growth in members and product adoption. The company added 785,000 new members and 1.1 million new products in the latest quarter, setting new records. With a strong financial performance, SoFi has extended its streak of quarterly profitability and has over 10 million members. The fintech company's growth story is impressive, with its membership base increasing from 3.4 million to over 10 million since going public in 2021. Its technology platforms, Galileo and Technisys, support financial and non-financial institutions with cutting-edge banking technology.", "keywords": ["technology", "products", "banking", "adoption", "surge", "members", "profitability", "growth", "fintech", "platforms", "stock"], "sentiment": "positive", "upside": -94.5, "linked": [], "volume": 54306476.0, "introduction": "SoFi Technologies Inc. (SOFI) has seen its stock price surge 18% in five days, driven by record growth in members and product adoption, with the fintech company adding 785,000 new members and 1.1 million new products in the latest quarter.", "update": "2025-02-23", "current": 17.92, "category": "stock"}, {"company": "Quantum Computing Inc", "symbol": "QUBT", "statement": "Quantum computing is making progress, with IonQ announcing compact, room-temperature quantum computers, Microsoft unveiling the world's first quantum processor chip, and D-Wave and Staque releasing a hybrid-quantum application for agriculture. ZenaTech's \"Sky Traffic\" project demonstrates the potential of quantum computing in drone technology, while Microsoft's Majorana 1 chip promises to make quantum computing practical in \"years, not decades.\" The advancements have the potential to solve complex problems in fields like medicine, chemistry, and agriculture, and could unlock discoveries in various industries.", "keywords": ["computing", "chemistry", "d-wave", "sky", "processor", "traffic", "agriculture", "ionq", "medicine", "zenatech", "compact", "drone", "microsoft", "staque", "quantum", "progress", "majorana"], "sentiment": "positive", "upside": -108.7, "linked": [], "volume": 34888868.0, "introduction": "Quantum computing is advancing with recent breakthroughs in compact, room-temperature computers, processor chips, and hybrid-quantum applications, promising to solve complex problems and unlock discoveries in various industries.", "update": "2025-02-23", "current": 10.93, "category": "stock"}, {"company": "Ford Motor Co", "symbol": "F", "statement": "Ford is investing in electric vehicles, with the latest example being the E-Transit, and offering integrated charging solutions for customers. CEO Jim Farley is leading the company's transition to an electric future, with a focus on innovation and sustainability. Ford is also cutting costs by slashing manager stock bonuses and delaying production of the next-generation F-150 truck until 2028. The company is committed to sustainability, with a focus on reducing emissions and protecting human rights in its supply chain.", "keywords": ["transition", "vehicles", "emissions", "rights", "solutions", "investment", "electric", "innovation", "charging", "sustainability", "costs", "bonuses", "production", "ceo"], "sentiment": "positive", "upside": -56.1, "linked": [], "volume": 42802990.0, "introduction": "Ford is investing in electric vehicles, cutting costs, and prioritizing sustainability under CEO Jim Farley's leadership.", "update": "2025-02-23", "current": 10.12, "category": "stock"}, {"company": "NIO Inc", "symbol": "NIO", "statement": "NIO, a Chinese electric vehicle manufacturer, has partnered with ZF to incorporate the latter's steer-by-wire technology in its ET9 \"SkyRide\" chassis, setting a new industry benchmark. The steer-by-wire system enhances NIO's flagship electric vehicle with cutting-edge software-defined capabilities. NIO produces high-end electric SUVs and sedans, with a focus on innovation and technology, and has developed a battery replacement technology. The company has also expanded its services to include used vehicle inspection and sales.", "keywords": ["technology", "inspection", "software", "vehicle", "manufacturer", "electric", "battery", "steer", "innovation", "services", "partnership", "sales", "benchmark"], "sentiment": "positive", "upside": -262.9, "linked": ["RIVN : Rivian, an electric vehicle manufacturer, has made a strong debut with its innovative technology and partnership with Amazon, reporting its first gross profit and beating revenue estimates despite slower demand, positioning it as a contender in the long-term EV landscape."], "volume": 39487612.0, "introduction": "NIO, a Chinese electric vehicle manufacturer, has partnered with ZF to incorporate its steer-by-wire technology in its ET9 \"SkyRide\" chassis, setting a new industry benchmark.", "update": "2025-02-23", "current": 4.29, "category": "stock"}, {"company": "Iris Energy Ltd", "symbol": "IREN", "statement": "Iris Energy Ltd (NASDAQ: IREN), a vertically integrated Bitcoin mining company valued at $2.85 billion, is expanding its operations and diversifying into artificial intelligence (AI) and high-performance computing (HPC) sectors. Analysts have issued forecasts for FY2025 earnings, with some increasing their price targets. Institutional investors have bought and sold shares, and the company has reported quarterly earnings that beat expectations. The stock price has been volatile, with a beta of 3.6, and some analysts have issued buy and hold recommendations.", "keywords": ["computing", "energy", "bitcoin", "artificial", "beta", "intelligence", "recommendations", "investors", "high-performance", "diversification", "quarterly", "mining", "volatile", "earnings", "institutional", "forecasts"], "sentiment": "positive", "upside": -113.2, "linked": [], "volume": 22476084.0, "introduction": "Iris Energy Ltd, a $2.85 billion Bitcoin mining company, is expanding into AI and HPC sectors, with analysts issuing bullish forecasts and institutional investors buying and selling shares, driving a volatile stock price.", "update": "2025-02-23", "current": 13.32, "category": "stock"}, {"company": "Opendoor Technologies Inc", "symbol": "OPEN", "statement": "Eric Wu, co-founder and CEO of Opendoor, has revolutionized the real estate industry with his company's tech-driven approach to buying and selling homes. Opendoor's quarterly earnings report showed a beat on EPS and revenue, with analysts estimating a 41.14% increase in stock price. The company's revenue grew 40.51% in the last quarter, but decreased 44.71% year-over-year. Opendoor's market capitalization is around $1.475 billion, and analysts have set a target price of $2.23. The company has not confirmed its next earnings date, but it's expected to be in April 2025.", "keywords": ["technology", "target", "real estate", "revenue", "earnings", "date", "stock", "price", "capitalization"], "sentiment": "positive", "upside": -284.8, "linked": [], "volume": 26005726.0, "introduction": "Opendoor, a tech-driven real estate company, has reported a strong quarterly earnings report, beating estimates on EPS and revenue, with its stock price expected to increase 41.14% and market capitalization reaching $1.475 billion.", "update": "2025-02-23", "current": 1.4, "category": "stock"}, {"company": "Lucid Group Inc", "symbol": "LCID", "statement": "Lucid Group, a luxury electric vehicle manufacturer, has partnered with Panasonic Energy to power its new Gravity Grand Touring model with lithium-ion EV battery cells, offering an EPA-estimated range of up to 450 miles. The company has seen significant growth and interest, with its stock price increasing 4% after delivering its first 50 Gravity SUV models. However, J.D. Power expects Lucid's retail market share to stagnate, and the company faces production challenges despite its recent stock surge. Lucid is set to release its fourth-quarter earnings report and has announced its entry into the luxury electric SUV segment.", "keywords": ["range", "energy", "panasonic", "segment", "vehicle", "luxury", "manufacturer", "report", "power", "electric", "battery", "earnings", "interest", "growth", "suv", "stock"], "sentiment": "negative", "upside": -276.8, "linked": [], "volume": 80242350.0, "introduction": "Lucid Group, a luxury EV manufacturer, has partnered with Panasonic Energy to power its new Gravity Grand Touring model with lithium-ion battery cells, offering an EPA-estimated range of up to 450 miles.", "update": "2025-02-23", "current": 2.79, "category": "stock"}, {"company": "Marathon Oil Corp", "symbol": "MRO", "statement": "Marathon Petroleum's midstream segment, MPLX, has achieved a milestone by lowering its energy intensity by 10% within a five-year period, earning it an ENERGY STAR Industrial Showcase. Marathon Petroleum Corp, a leading energy company, operates refineries and distributes petroleum products, and was named one of America's Most JUST Companies by JUST Capital and CNBC. The company has a strong presence in the US refining, marketing, and transportation of petroleum products, with 16 refineries and over 7,000 retail locations.", "keywords": ["retail", "energy", "industrial", "products", "marathon", "just", "refining", "distribution", "showcase", "transportation", "petroleum", "america", "refineries", "marketing", "star"], "sentiment": "positive", "upside": -58.36, "linked": [], "volume": 36021830.0, "introduction": "Marathon Petroleum's midstream segment, MPLX, has achieved a 10% reduction in energy intensity over a five-year period, earning it an ENERGY STAR Industrial Showcase.", "update": "2025-02-23", "current": 28.55, "category": "stock"}, {"company": "MicroStrategy Inc", "symbol": "MSTR", "statement": "MicroStrategy, a company that provides analytics software and services, has undergone a significant transformation under the leadership of Michael Saylor, shifting its focus to Bitcoin. The company holds a significant amount of Bitcoin, with a current total of 478,740 BTC, and has been actively engaging in at-the-market equity offerings. MicroStrategy has also been advancing its enterprise analytics software offerings, integrating AI capabilities to enhance business intelligence solutions. The company has undergone a rebranding, adopting a new name and logo that incorporates a stylized \"B\" symbolizing its Bitcoin strategy. The company's stock has seen significant growth, with a 18.25% increase since its IPO, and is considered a \"whale\" in the Bitcoin market.", "keywords": ["whale", "analytics", "transformation", "bitcoin", "ipo", "leadership", "software", "ai", "blockchain", "intelligence", "solutions", "services", "focus", "growth", "business", "rebranding"], "sentiment": "positive", "upside": -102.3, "linked": [], "volume": 22695180.0, "introduction": "MicroStrategy, a company that provides analytics software and services, has transformed under Michael Saylor's leadership to focus on Bitcoin, holding 478,740 BTC and growing its enterprise analytics software offerings with AI capabilities.", "update": "2025-02-23", "current": 353.67, "category": "stock"}, {"company": "Apple Inc", "symbol": "AAPL", "statement": "Apple has introduced new innovations, including the M3 chip with advanced AI and machine learning capabilities, and the Vision Pro headset with features like real-time language translation and enhanced photo editing. The company has also launched the iPhone 16e, a more affordable version of the iPhone 16, with a 6.1-inch Super Retina XDR OLED display and durable design. Other upcoming products expected this spring include new MacBook Pro and MacBook Air models, as well as a potential new Apple device that will be unveiled on February 19.", "keywords": ["editing", "innovations", "photo", "air", "translation", "spring", "m3", "headset", "design", "display", "learning", "affordable", "ai", "models", "macbook", "vision", "device", "apple", "iphone", "february", "machine", "pro"], "sentiment": "positive", "upside": -62.1, "linked": [], "volume": 52645956.0, "introduction": "Apple has introduced new innovations, including the M3 chip, Vision Pro headset, iPhone 16e, and upcoming MacBook Pro and Air models, with features like AI, real-time language translation, and enhanced photo editing.", "update": "2025-02-23", "current": 222.78, "category": "stock"}, {"company": "CleanSpark Inc", "symbol": "CLSK", "statement": "CleanSpark, Inc. (CLSK) is a company that is redefining energy efficiency through its use of blockchain and quantum computing. The company has seen significant growth, with a 120% year-over-year revenue increase and a net income of $241.7 million in its latest quarter. CleanSpark's innovative approach to energy generation and distribution is setting standards for efficiency and transparency. The company is also a leading player in the bitcoin mining industry, with a hash rate of 40.1 EH/s and a fleet efficiency of 16.15 J/TH, making it the second most efficient mining fleet among competitors.", "keywords": ["energy", "bitcoin", "blockchain", "income", "revenue", "standards", "efficiency", "fleet", "mining", "innovation", "transparency", "growth", "quantum"], "sentiment": "positive", "upside": -121.6, "linked": [], "volume": 24849948.0, "introduction": "CleanSpark, Inc. (CLSK) is a company that uses blockchain and quantum computing to redefine energy efficiency, achieving significant growth and becoming a leading player in the bitcoin mining industry.", "update": "2025-02-23", "current": 11.53, "category": "stock"}, {"company": "AT&T Inc", "symbol": "T", "statement": "AT&T, a multinational telecommunications company, has seen its stock surge to its highest level in nearly half a decade. The company is the third largest telecommunications company by revenue and the third largest wireless carrier in the US. Meanwhile, President Donald Trump spoke at the Conservative Political Action Conference (CPAC), where he made false claims about the 2024 election. Other news includes updates on AT&T's wireless business, a fact-check on Trump's lies, and various other unrelated topics such as a recipe for homemade ricotta cheese, firings at national parks, and a Visual Studio event.", "keywords": ["stock", "carrier", "election", "recipe", "cheese", "president", "news", "revenue", "company", "trump", "event", "parks", "telecommunications", "wireless"], "sentiment": "positive", "upside": 38.9, "linked": [], "volume": 43626290.0, "introduction": "AT&T's stock has surged to its highest level in nearly five years, while President Trump spoke at CPAC, making false claims about the 2024 election.", "update": "2025-02-23", "current": 22.72, "category": "stock"}, {"company": "SoundHound AI Inc", "symbol": "SOUN", "statement": "SoundHound AI is a pioneer in AI voice assistants, with a strong track record of innovation and research. The company's stock has seen significant growth, with a 836% rise in 2024 and a 113.1% surge in December alone. Despite recent volatility, SoundHound AI remains a promising investment opportunity, with a strong commitment to innovation and exploration of new applications. The company's technology is used in various industries, including automotive, TV, and customer service, and its future success hinges on its ability to stay ahead of the curve in AI developments and maintain its competitive edge through partnerships and collaborations.", "keywords": ["technology", "research", "service", "volatility", "partnership", "artificial", "exploration", "intelligence", "assistant", "automotive", "investment", "tv", "collaboration", "innovation", "customer", "growth", "stock", "opportunity"], "sentiment": "positive", "upside": -109.4, "linked": ["BBAI : BigBear.ai Holdings Inc. is a leading provider of AI-powered decision intelligence solutions, partnering with SoftPoint to provide facial biometric solutions, and has seen revenue growth and a significant stock price increase in 2025."], "volume": 64984504.0, "introduction": "SoundHound AI, a pioneer in AI voice assistants, has seen significant stock growth and remains a promising investment opportunity due to its commitment to innovation and exploration of new applications across various industries.", "update": "2025-02-23", "current": 15.84, "category": "stock"}, {"company": "D-Wave Quantum Inc", "symbol": "QBTS", "statement": "D-Wave and Staque have developed a new hybrid-quantum application that simulates and optimizes the in-field operations of autonomous and semi-autonomous machines at scale. The application, built with Verge Ag and supported by Canada's DIGITAL Global Innovation Cluster, uses D-Wave's hybrid quantum technologies to achieve significant speed-ups over classical approaches. The results are being showcased at World FIRA 2025 and Qubits 2025, with the aim of improving efficiency in farm operations. This is one of the first real-world quantum-powered products in agriculture, and it has the potential to revolutionize the way farms operate.", "keywords": ["machines", "speed", "agriculture", "application", "optimization", "hybrid", "farm", "revolution", "efficiency", "operations", "classical", "semi-autonomous", "scale", "quantum", "autonomous"], "sentiment": "positive", "upside": -120.8, "linked": [], "volume": 137765140.0, "introduction": "D-Wave and Staque have developed a hybrid-quantum application that optimizes in-field operations of autonomous and semi-autonomous machines at scale, achieving significant speed-ups over classical approaches and potentially revolutionizing farm operations.", "update": "2025-02-23", "current": 6.09, "category": "stock"}, {"company": "Nu Holdings Ltd", "symbol": "NU", "statement": "Nu Holdings Ltd., a digital financial services platform, has seen its stock price drop 19% to $10.80 after reporting good earnings. Despite this decline, the company's one-month return is 10.58% and its 52-week return is 30.12%. The company's fourth-quarter and full-year 2024 financial results showed growth, and its digital banking platform has been expanding across Latin America and beyond. The company's stock has been praised by analysts, with a year-to-date performance of 29.40% and a relatively high price-to-earnings ratio of 38.04.", "keywords": ["financial", "platform", "performance", "expansion", "services", "earnings", "growth", "analysts", "banking", "stock", "price"], "sentiment": "positive", "upside": -84.9, "linked": [], "volume": 41150864.0, "introduction": "Nu Holdings Ltd.'s stock price dropped 19% to $10.80 after reporting good earnings, but its one-month and 52-week returns are still positive, indicating a strong overall performance.", "update": "2025-02-23", "current": 12.34, "category": "stock"}, {"company": "Advanced Micro Devices Inc", "symbol": "AMD", "statement": "Advanced Micro Devices (AMD) is a global semiconductor company that has established itself as a competitor to Intel. Founded in 1969, AMD has gained momentum through strategic licensing agreements and has introduced various products such as the Athlon and Ryzen series. The company's recent partnership with Vultr to power its graphics processing unit (GPU) is expected to drive growth. AMD's revenue has grown 24.16% in the latest quarter and 13.69% in 2024, making it a promising technology stock to watch. The company operates in four segments, including data center graphics, server microprocessors, low-power solutions, and FPGA.", "keywords": ["technology", "computing", "amd", "semiconductor", "intel", "gpu", "growth", "graphics", "revenue", "microprocessors", "server", "solutions", "fpga", "partnership", "low-power", "datacenter", "chip"], "sentiment": "positive", "upside": -77.1, "linked": [], "volume": 31002960.0, "introduction": "Advanced Micro Devices (AMD) is a global semiconductor company that has established itself as a competitor to Intel, with revenue growing 24.16% in the latest quarter and 13.69% in 2024, driven by strategic partnerships and product introductions like the Ryzen series.", "update": "2025-02-23", "current": 122.84, "category": "stock"}, {"company": "Riot Blockchain Inc", "symbol": "RIOT", "statement": "Riot Platforms, Inc. (RIOT) is a company that specializes in blockchain technology, specifically layer-1 blockchains, which are the foundation of the decentralized ecosystem. The company was founded in 1998 and has evolved from a company focused on cryptocurrency mining to a leading bitcoin mining company in North America. Riot Platforms offers various services such as transaction processing, network security, and consensus mechanism, and has been involved in various blockchain-related projects and partnerships.", "keywords": ["technology", "consensus", "ecosystem", "bitcoin", "partnership", "decentralized", "blockchain", "transaction", "layer1", "cryptocurrency", "mining", "northamerica", "security"], "sentiment": "positive", "upside": -94.4, "linked": [], "volume": 46591200.0, "introduction": "Riot Platforms, Inc. is a company that specializes in layer-1 blockchains and has evolved from a bitcoin mining company to offer various services like transaction processing, network security, and consensus mechanism.", "update": "2025-02-23", "current": 13.54, "category": "stock"}, {"company": "Pfizer Inc", "symbol": "PFE", "statement": "Pfizer, a leading biopharmaceutical company, has set a new ambition to change a billion lives by 2027. The company has a new Purpose Blueprint 2.0, which includes five core business principles and 15 big ideas to drive growth. Pfizer has transformed its growth and development programs to help employees achieve their career goals, whether through traditional or non-traditional paths. The company has also launched a manufacturing optimization program to reduce costs and improve gross margin performance. Additionally, Pfizer has launched a cost-cutting drive to trim $1 billion from its costs this year and another $2.5 billion in the future, in response to declining sales of its COVID-19 vaccine.", "keywords": ["development", "pharmaceutical", "optimization", "margin", "pandemic", "ambition", "programs", "vaccine", "costs", "growth", "sales", "principles", "blueprint"], "sentiment": "negative", "upside": -47.3, "linked": [], "volume": 31175632.0, "introduction": "Pfizer sets a new ambition to change a billion lives by 2027 through its Purpose Blueprint 2.0, which includes growth strategies, employee development programs, and cost-cutting measures.", "update": "2025-02-23", "current": 26.09, "category": "stock"}, {"company": "Amazon.com Inc", "symbol": "AMZN", "statement": "Amazon is making significant investments in AI, with its new platform Amazon Bedrock offering seamless access to foundation models from top industry players. The company is also racing past competitors like OpenAI and Anthropic, with a blend of innovative AI deployment across e-commerce and cloud services. Amazon's retail CEO, Doug Herrington, is urging cost cuts to fund new investments, while the company's secret to AI-powered product recommendations is its ability to monetize data with an AI engine. Amazon is also expanding its e-commerce edge, with analysts highlighting its resilience and adaptability in a challenging market landscape.", "keywords": ["resilience", "deployment", "cost", "adaptability", "investments", "cloud", "competitors", "ai", "engine", "innovation", "services", "letmeknowifyou'dlikemetohelpwithanythingelse", "ceo", "e-commerce", "data", "platform", "foundation", "cuts", "industry", "players", "market"], "sentiment": "positive", "upside": -49.5, "linked": [], "volume": 26234668.0, "introduction": "Amazon is investing heavily in AI, offering seamless access to foundation models, racing past competitors, and leveraging AI-powered product recommendations to drive growth and expansion in e-commerce.", "update": "2025-02-23", "current": 234.85, "category": "stock"}, {"company": "iQIYI Inc", "symbol": "IQ", "statement": "iQIYI, a leading provider of online entertainment video services in China, reported a 14% year-over-year decrease in total revenues to RMB6.61 billion (approximately US$906 million) in the fourth quarter of 2024, due to a lighter content slate. The company's focus on long-form content and innovative formats has contributed to its market leadership and sequential growth in operating profit. Despite the decline, iQIYI's membership services revenue and online advertising revenue also decreased by 15% and 13%, respectively. The company has launched a $300 million convertible bond and plans to use the proceeds to invest in its content and technology infrastructure.", "keywords": ["provider", "advertising", "membership", "entertainment", "formats", "leadership", "year-over-year", "infrastructure", "revenues", "decrease", "growth", "content", "convertible", "bond"], "sentiment": "negative", "upside": 155.4, "linked": [], "volume": 54561920.0, "introduction": "iQIYI, a leading Chinese online entertainment company, reported a 14% year-over-year decline in revenue in Q4 2024, primarily due to a lighter content slate, but maintained operating profit growth and plans to invest in content and technology infrastructure with a $300 million convertible bond.", "update": "2025-02-23", "current": 2.23, "category": "stock"}, {"company": "Rocket Lab USA Inc", "symbol": "RKLB", "statement": "Rocket Lab, a global leader in launch services and space systems, successfully launched its 60th Electron rocket, deploying the first Gen-3 satellite for Earth-imaging company BlackSky. The launch marks a milestone for Rocket Lab, which continues to solidify its position in the rapidly evolving space industry. The company's stock jumped after the launch, with shares trading slightly higher in the premarket. Rocket Lab's Electron rocket is capable of carrying smaller payloads than SpaceX's Falcon 9, but has a higher launch frequency, with plans for multiple launches in the coming months. The company's success has been driven by its 3D printed engines and partnerships with companies like BlackSky, which is using the satellites for real-time space-based intelligence.", "keywords": ["market", "earth", "space", "satellite", "frequency", "partnerships", "systems", "intelligence", "engines", "launch", "company", "industry", "services", "rocket", "stock", "imaging", "lab"], "sentiment": "positive", "upside": -106.2, "linked": [], "volume": 23723176.0, "introduction": "Rocket Lab successfully launched its 60th Electron rocket, deploying a Gen-3 satellite for Earth-imaging company BlackSky, solidifying its position in the space industry and sending its stock higher.", "update": "2025-02-23", "current": 30.36, "category": "stock"}, {"company": "Spirit Airlines Inc", "symbol": "SAVE", "statement": "Spirit Airlines has received court approval to exit bankruptcy and restructure its debt, converting $795 million in debt to equity. The airline had previously rejected a takeover offer from rival Frontier Group Holdings Inc. Some passengers are choosing Spirit due to its lack of Boeing 737 Max 9 planes, following recent incidents. Frontier has made three bids to acquire Spirit, but has been rejected. Spirit's plan of reorganization was confirmed by a US bankruptcy judge, allowing the airline to emerge as a private company. The airline's revenue has decreased in recent years, but it still operates a fleet of 205 Airbus single-aisle aircraft and serves 93 destinations in 15 countries.", "keywords": ["equity", "acquire", "airbus", "airlines", "bankruptcy", "incidents", "fleet", "revenue", "boeing", "max", "destinations", "debt", "restructure", "judge", "planes", "frontier"], "sentiment": "positive", "upside": -2961.0, "linked": [], "volume": 25024648.0, "introduction": "Spirit Airlines has received court approval to exit bankruptcy and restructure its debt, converting $795 million in debt to equity and emerging as a private company after rejecting takeover offers from Frontier Group Holdings Inc.", "update": "2025-02-23", "current": 1.08, "category": "stock"}, {"company": "Bank of America Corp", "symbol": "BAC", "statement": "Bank of America, a company driving financial innovation, has reshaped the financial landscape through its partnership with Merrill. The company invests heavily in technology, with a $12 billion annual budget, and is exploring the use of cryptocurrency for payments. Bank of America's CEO has signaled that the US banking industry will adopt cryptocurrency for payments, a move that could be a significant milestone. The company offers a range of financial services, including personal banking, credit cards, mortgages, and investment products. It also provides market-making, financing, and risk management services through its Global Markets segment. The company is hiring for various roles, including an AVP/VP, Markets Support Specialist, and is led by CEO Brian Moynihan.", "keywords": ["technology", "payments", "partnership", "america", "bank", "management", "risk", "mortgages", "financial", "hiring", "innovation", "services", "credit", "leadership", "investment", "cryptocurrency", "industry", "personal", "market"], "sentiment": "positive", "upside": -56.4, "linked": [], "volume": 23546200.0, "introduction": "Bank of America, a financial institution that invests heavily in technology and explores cryptocurrency for payments, offers a range of financial services and is led by CEO Brian Moynihan.", "update": "2025-02-23", "current": 46.52, "category": "stock"}, {"company": "Terawulf Inc", "symbol": "WULF", "statement": "TeraWulf Inc., a leading owner and operator of vertically integrated, next-generation digital infrastructure powered by predominantly zero-carbon energy, will hold a conference call and webcast for its fourth quarter and year-end 2024 earnings. The company operates bitcoin mining facilities in the US and provides miner hosting services to third-party entities. TeraWulf's market cap has increased significantly since 1998, with a compound annual growth rate of 22.52%. The company's stock price, ticker symbol WULF, is listed on the Nasdaq.", "keywords": ["energy", "bitcoin", "infrastructure", "nasdaq", "mining", "earnings", "growth", "hosting", "stock"], "sentiment": "positive", "upside": -111.1, "linked": [], "volume": 56193060.0, "introduction": "TeraWulf Inc., a digital infrastructure company powered by zero-carbon energy, will hold a conference call and webcast for its Q4 and year-end 2024 earnings.", "update": "2025-02-23", "current": 6.32, "category": "stock"}, {"company": "American Airlines Group Inc", "symbol": "AAL", "statement": "American Airlines, a leading global airline, has announced new elite levels and perks for its loyalty program, AAdvantage, as well as launched new lifetime elite levels and rewards for achieving certain milestones. The airline has also unveiled cutting-edge 3D printing technology in partnership with UAV Corp, paving the way for full-scale T-Wing UAS production and future aerospace and defense manufacturing. Additionally, American Airlines has reported its annual financials and provided an overview of its operations, highlighting its extensive international and domestic routes, as well as its commitment to reliable and efficient air travel solutions.", "keywords": ["technology", "aerospace", "defense", "travel", "solutions", "financials", "printing", "airline", "operations", "program", "rewards", "uav", "loyalty", "perks", "routes", "elite"], "sentiment": "positive", "upside": -39.0, "linked": [], "volume": 37547656.0, "introduction": "American Airlines has introduced new elite levels and perks for its loyalty program, launched 3D printing technology, and reported its annual financials and operations, highlighting its extensive routes and commitment to reliable air travel.", "update": "2025-02-23", "current": 16.96, "category": "stock"}, {"company": "SRIVARU Holding Ltd", "symbol": "SVMH", "statement": "Srivaru Holding Limited (SVUHF) is a company that invents, manufactures, and sells electric vehicles in India, specifically electric two-wheeled vehicles under the Prana brand. The company has announced board resignations, and its latest news and stock analysis are available on Seeking Alpha. SVUHF's stock price and chart are available on OTC Markets, along with company news, key statistics, and fundamentals. The company has hosted an annual SVM Day to unveil new products, and its latest news and real-time alerts are available on Seeking Alpha.", "keywords": ["statistics", "products", "analysis", "vehicles", "prana", "india", "news", "fundamentals", "company", "chart", "electric", "alerts", "letmeknowifyou'dlikemetohelpwithanythingelse", "stock"], "sentiment": "positive", "upside": -447.4, "linked": [], "volume": 122944570.0, "introduction": "Srivaru Holding Limited (SVUHF) is a company that designs, manufactures, and sells electric two-wheeled vehicles under the Prana brand in India.", "update": "2025-02-23", "current": 0.03, "category": "stock"}, {"company": "Tonix Pharmaceuticals Holding Corp", "symbol": "TNXP", "statement": "Tonix Pharmaceuticals Holding Corp. (TNXP) is a clinical-stage biopharmaceutical company that develops therapeutics and vaccines to treat and prevent human diseases. The company has a collaboration agreement with Bilthoven Biologicals to advance its mpox vaccine candidate and with X-Chem to develop broad-spectrum antivirals. According to analyst ratings, the average twelve-month stock price forecast for Tonix Pharmaceuticals is $..., suggesting a potential upside of 48,758.45%. The company has a consensus target price of $5,350.00, and institutional ownership is 1.74% of shares sold short.", "keywords": ["diseases", "target", "antivirals", "therapeutics", "agreement", "short", "collaboration", "ownership", "clinical-stage", "upside", "forecast", "shares", "biopharmaceutical", "vaccines", "mpox"], "sentiment": "positive", "upside": -1044.5, "linked": [], "volume": 179498200.0, "introduction": "Tonix Pharmaceuticals is a clinical-stage biopharmaceutical company developing treatments and vaccines, with a potential upside of 48,758.45% based on analyst forecasts.", "update": "2025-02-23", "current": 0.38, "category": "stock"}, {"company": "Akoustis Technologies Inc", "symbol": "AKTS", "statement": "Akoustis Technologies, Inc. is a company that develops, designs, and manufactures RF filter solutions for the wireless industry. The company was founded in 2015 and is headquartered in North Carolina. The company's products include RF filters for mobile wireless devices, cellular infrastructure equipment, Wi-Fi customer premise equipment, and military and defense applications. The company's stock price is publicly traded on the OTC market and has a market capitalization of $5.751M. The company's CEO has over 20 years of experience in sales, business development, and marketing.", "keywords": ["technology", "products", "equipment", "infrastructure", "military", "market", "rf", "founded", "experience", "wireless", "wi-fi", "filter", "ceo", "capitalization", "defense", "solutions", "company", "industry", "stock", "devices"], "sentiment": "positive", "upside": -13510.6, "linked": [], "volume": 93547736.0, "introduction": "Akoustis Technologies, Inc. is a publicly traded company that develops and manufactures RF filter solutions for the wireless industry, with products used in mobile devices, infrastructure equipment, Wi-Fi, and military applications.", "update": "2025-02-23", "current": 0.04, "category": "stock"}, {"company": "Tilray Inc", "symbol": "TLRY", "statement": "Tilray Brands, a cannabis company, is expanding into the craft brewing market, capitalizing on shifting consumer tastes. The company has introduced new cannabis-infused drinks and expanded its medical cannabis extract portfolio in Germany. Despite this, its stock price has been declining, with a 2.2% drop in mid-day trading. The company has also announced plans to cut its drinks lineup and has reported Q2 2025 financial results.", "keywords": ["stock", "plans", "craft", "expansion", "brewing", "drinks", "capitalizing", "declining", "portfolio", "shifting", "results", "cannabis"], "sentiment": "negative", "upside": -220.9, "linked": [], "volume": 36058948.0, "introduction": "Tilray Brands is expanding into the craft brewing market by introducing cannabis-infused drinks and expanding its medical cannabis extract portfolio, despite its stock price declining and plans to cut its drinks lineup.", "update": "2025-02-23", "current": 1.14, "category": "stock"}, {"company": "Broadcom Inc", "symbol": "AVGO", "statement": "Broadcom, a company that specializes in Ethernet switching and high-speed interconnect solutions, is poised for growth in the AI space. The company's advanced switching and interconnect solutions are essential for clustering AI accelerators efficiently, providing high-bandwidth and low-latency networking at scale. The company is also rumored to be considering acquiring Intel's chip design business, which could reshape its trajectory. Additionally, Broadcom's founder, Henry Samueli, is being recognized with the IEEE's Medal of Honor for his pioneering research and commercialization of broadband communication and networking technologies.", "keywords": ["acquisition", "networking", "research", "broadband", "communication", "switching", "design", "interconnect", "ai", "latency", "accelerators", "ethernet", "growth", "clustering", "bandwidth", "chip"], "sentiment": "positive", "upside": -87.2, "linked": [], "volume": 24935682.0, "introduction": "Broadcom, a company specializing in Ethernet switching and interconnect solutions, is poised for growth in the AI space and may acquire Intel's chip design business, while its founder, Henry Samueli, is being honored with the IEEE's Medal of Honor.", "update": "2025-02-23", "current": 244.7, "category": "stock"}, {"company": "Alphabet Inc", "symbol": "GOOGL", "statement": "Alphabet Inc., the parent company of Google, is boosting its AI investment to $75 billion in 2025, with a focus on 4X compute efficiency gains, driving ROI, market share, and YouTube's dominance. The company's AI-powered video generation and ability to attract advertising budgets transitioning from traditional TV to Connected TV (CTV) have contributed to YouTube's significant ad revenue growth in 2024. Alphabet's capital expenditures are expected to increase by 43% in 2025, with a focus on AI and machine learning, making it a stock to buy and hold forever.", "keywords": ["stock", "ad", "ai", "capital", "expenditures", "forever", "investment", "roi", "revenue", "efficiency", "alphabet", "youtube", "growth", "share", "market", "google"], "sentiment": "positive", "upside": -7.9, "linked": [], "volume": 23753208.0, "introduction": "Alphabet Inc. is increasing its AI investment to $75 billion in 2025, focusing on 4X compute efficiency gains, driving ROI, market share, and YouTube's dominance, with capital expenditures expected to increase 43% in 2025.", "update": "2025-02-23", "current": 200.21, "category": "stock"}, {"company": "Crown Electrokinetics Corp.", "symbol": "CRKN", "statement": "Crown Electrokinetics Corp. (CRKN) is a company that provides innovative technology infrastructure solutions that benefit communities and the environment. The company has announced an exclusive partnership with Electro Scan Inc, and has finalized a $100 million equity line of credit with Liqueous LP. CRKN is a leading provider of electrokinetic technology for use in the smart glass market, and has developed optical switching film that can be used to electronically control opacity. The company has also received a profitability grade and underlying metrics from Seeking Alpha, and has been featured in news articles and market reports.", "keywords": ["technology", "optical", "reports", "control", "news", "infrastructure", "communities", "opacity", "smart", "profitability", "articles", "film", "electrokinetics", "equity", "switching", "innovation", "credit", "metrics", "glass", "solutions", "grade", "partnership", "market", "environment"], "sentiment": "positive", "upside": -721.2, "linked": [], "volume": 36875400.0, "introduction": "Crown Electrokinetics Corp. (CRKN) is a technology company that provides innovative solutions for communities and the environment through its electrokinetic technology, which has partnered with Electro Scan Inc. and secured a $100 million equity line of credit.", "update": "2025-02-23", "current": 0.1, "category": "stock"}, {"company": "Conduit Pharmaceuticals Inc", "symbol": "CDT", "statement": "Conduit Pharmaceuticals Inc. (Nasdaq: CDT) has completed Phase II of its AI initiative with Sarborg Limited, a collaboration aimed at adopting forward-thinking solutions to stay at the forefront of innovation in the industry. The company is a clinical-stage, life science company delivering an efficient model for compound development, and the AI system has progressed significantly, with the potential to revolutionize drug development. The collaboration is expected to reduce reliance on traditional methods and improve the efficiency of the development process.", "keywords": ["development", "ai", "revolution", "collaboration", "nasdaq", "pharmaceuticals", "industry", "innovation", "clinical", "efficiency"], "sentiment": "positive", "upside": -1079.2, "linked": [], "volume": 24817972.0, "introduction": "Conduit Pharmaceuticals has completed Phase II of its AI initiative with Sarborg Limited, a collaboration aimed at revolutionizing drug development by reducing reliance on traditional methods and improving efficiency.", "update": "2025-02-23", "current": 0.05, "category": "stock"}, {"company": "Eyenovia Inc", "symbol": "EYEN", "statement": "Eyenovia, Inc. has announced positive results from a research study on its Optejet delivery technology, which showed reduced ocular surface damage from latanoprost+benzalkonium chloride treatment. The company has also announced the achievement of its primary endpoint in the VISION-1 study evaluating its proprietary pilocarpine formulation, MicroLine, for the temporary improvement of near vision in adults with presbyopia. Additionally, Eyenovia has priced a $4 million registered direct offering and is preparing for a second phase 3 registration study, VISION-2. The company has also received FDA clearance for its VIA360 surgical device and is planning to launch it in the US market.", "keywords": ["technology", "research", "pilocarpine", "treatment", "endpoint", "ocular", "microline", "offering", "registration", "adults", "clearance", "surface", "fda", "study", "eyenovia", "results", "optejet", "vision", "device", "delivery", "presbyopia", "phase", "company", "damage", "market"], "sentiment": "positive", "upside": -3072.9, "linked": [], "volume": 29827856.0, "introduction": "Eyenovia, Inc. has announced positive results from its Optejet and MicroLine studies, priced a $4 million registered direct offering, and received FDA clearance for its VIA360 surgical device.", "update": "2025-02-23", "current": 0.06, "category": "stock"}, {"company": "Intuitive Machines Inc", "symbol": "LUNR", "statement": "Intuitive Surgical is investing $100 million in a fund to foster innovative solutions for minimally invasive care. The company has also launched the Da Vinci 5 Robotic Surgical System, which is used for various procedures, including urological and transoral procedures. Meanwhile, Intuitive Machines, a separate company, is expanding its partnership with Columbia Sportswear to develop technologies for space exploration, including a lunar lander. The company has successfully landed its Nova-C class lunar lander, Odysseus, on the Moon.", "keywords": ["lander", "urological", "lunar", "minimally", "space", "exploration", "invasive", "investment", "surgical", "moon", "innovation", "transoral", "partnership", "care", "robotic"], "sentiment": "positive", "upside": -258.8, "linked": [], "volume": 23845542.0, "introduction": "Intuitive Surgical is investing in a fund to foster innovative minimally invasive care solutions and launching a new robotic surgical system, while Intuitive Machines, a separate company, is developing space exploration technologies with Columbia Sportswear and has successfully landed a lunar lander on the Moon.", "update": "2025-02-23", "current": 23.07, "category": "stock"}, {"company": "Recursion Pharmaceuticals Inc", "symbol": "RXRX", "statement": "Recursion Pharmaceuticals, a biotech company, has launched a pre-seed fund to support early-stage biotech startups affected by NIH cuts. The fund, which offers $100,000 to $250,000 in capital and 12 months of lab and office space, is a response to the company's own early successes with Small Business Innovation Research (SBIR) grants. The company's CEO, Chris Gibson, credits SBIR funding for helping Recursion grow from a small startup to a $4 billion publicly traded company. The pre-seed fund aims to support other startups in the same way, while also expanding Recursion's presence in the biotech industry.", "keywords": ["grants", "biotech", "space", "fund", "capital", "nih", "cuts", "startups", "pharmaceuticals", "industry", "sbir", "growth", "ceo"], "sentiment": "positive", "upside": -165.9, "linked": [], "volume": 24966518.0, "introduction": "Recursion Pharmaceuticals has launched a pre-seed fund to support early-stage biotech startups affected by NIH cuts, offering $100,000 to $250,000 in capital and lab and office space, building on its own success with Small Business Innovation Research (SBIR) grants.", "update": "2025-02-23", "current": 7.33, "category": "stock"}, {"company": "Fubotv Inc", "symbol": "FUBO", "statement": "FuboTV, a sports-first live TV streaming platform, has launched multicultural content bundles as standalone plans and add-ons to its English-language base plan. The bundles offer international programming in multiple languages, catering to U.S. consumers with diverse tastes. This move aims to \"super-serve\" the multicultural audience with a range of content, including sports, news, and entertainment.", "keywords": ["sports", "entertainment", "languages", "super-serve", "platform", "tv", "news", "streaming", "diverse", "programming", "content", "multicultural", "international"], "sentiment": "positive", "upside": -175.5, "linked": [], "volume": 25155248.0, "introduction": "FuboTV, a sports-focused streaming platform, has introduced multicultural content bundles as standalone plans and add-ons, offering international programming in multiple languages to cater to diverse U.S. audiences.", "update": "2025-02-23", "current": 4.04, "category": "stock"}, {"company": "BigBear.ai Holdings Inc", "symbol": "BBAI", "statement": "BigBear.ai Holdings Inc. (BBAI) is a leading provider of AI-powered decision intelligence solutions for various industries, including defense, national security, and healthcare. The company's solutions enhance decision-making through advanced analytics and machine learning, attracting investors seeking risk mitigation and growth. BBAI has partnered with SoftPoint, a point-of-sale payment leader, to provide facial biometric solutions. The company's revenue grew 0.10% in 2023, with losses decreasing 50.39% compared to 2022. BBAI's stock price has risen 133% in 2025, driven by its innovative solutions and potential for growth.", "keywords": ["technology", "risk", "security", "biometric", "artificial", "loss", "intelligence", "decision", "healthcare", "mitigation", "national", "learning", "revenue", "innovation", "analytics", "defense", "payment", "growth", "machine", "stock", "price"], "sentiment": "positive", "upside": -511.4, "linked": ["SOUN : SoundHound AI, a pioneer in AI voice assistants, has seen significant stock growth and remains a promising investment opportunity due to its commitment to innovation and exploration of new applications across various industries."], "volume": 29238060.0, "introduction": "BigBear.ai Holdings Inc. is a leading provider of AI-powered decision intelligence solutions, partnering with SoftPoint to provide facial biometric solutions, and has seen revenue growth and a significant stock price increase in 2025.", "update": "2025-02-23", "current": 4.13, "category": "stock"}, {"company": "Nextera Energy Inc", "symbol": "NEE", "statement": "NextEra Energy is a global leader in renewable energy, with a focus on solar and wind power generation. The company benefits from Trump's pro-energy policies, which have simplified permits and provided tax benefits, allowing for faster deployment of renewable projects. Despite this, NextEra Energy faces new policy risks under the Trump administration's executive orders promoting fossil fuel growth, which could impact its renewable initiatives. The company is expanding its renewable energy projects, with a focus on energy storage solutions, and has installed over 20,000 megawatts of renewable energy capacity. With a strong presence in North America, NextEra Energy is a leading clean energy company, serving over 12 million people and generating annual revenues of over $20 billion.", "keywords": ["fossil", "energy", "renewable", "benefits", "solutions", "growth", "power", "generation", "solar", "wind", "permits", "america", "clean", "deployment", "tax", "capacity", "storage"], "sentiment": "positive", "upside": -54.5, "linked": [], "volume": 23938956.0, "introduction": "NextEra Energy, a global leader in renewable energy, benefits from Trump's pro-energy policies, but faces policy risks from his pro-fossil fuel executive orders, while expanding its renewable projects and serving over 12 million people.", "update": "2025-02-23", "current": 72.83, "category": "stock"}, {"company": "Canoo Inc", "symbol": "GOEV", "statement": "Canoo Inc., a mobility technology company, designs and manufactures electric vehicles for commercial and consumer markets. The company filed for Chapter 7 bankruptcy and announced a 1-for-20 reverse stock split. Despite this, NASA will continue to use Canoo's electric transport vans for Artemis astronaut transport. Canoo has also faced legal issues, including a $1.5 million fine for revenue projection reporting. The company's stock price is listed on the OTC market and is subject to fluctuations.", "keywords": ["otc", "fluctuations", "vehicles", "bankruptcy", "revenue", "electric", "artemis", "commercial", "nasa", "fine", "reporting", "consumer"], "sentiment": "negative", "upside": -51254.7, "linked": [], "volume": 278908670.0, "introduction": "Canoo Inc., a mobility company that designs and manufactures electric vehicles, filed for Chapter 7 bankruptcy and underwent a 1-for-20 reverse stock split, but will continue to supply electric vans to NASA for the Artemis program despite facing legal issues and stock price fluctuations.", "update": "2025-02-23", "current": 0.48, "category": "stock"}, {"company": "ChargePoint Holdings Inc", "symbol": "CHPT", "statement": "ChargePoint Holdings (CHPT) is a leading provider of electric vehicle (EV) charging stations, aiming to support widespread EV adoption. Despite its efforts, the company received a notice of non-compliance with the New York Stock Exchange (NYSE) due to its average closing price not meeting the exchange's requirements. The company has been committed to making EV charging easy since 2007 and has a comprehensive portfolio of charging solutions. However, there are still barriers to EV adoption, including insufficient infrastructure, and ChargePoint is working to address these challenges.", "keywords": ["provider", "adoption", "solutions", "vehicle", "station", "electric", "infrastructure", "exchange", "charging", "compliance", "challenges", "portfolio", "requirements", "stock"], "sentiment": "negative", "upside": -453.8, "linked": [], "volume": 23508516.0, "introduction": "ChargePoint Holdings, a leading EV charging station provider, received a NYSE non-compliance notice due to its average closing price not meeting exchange requirements, despite its efforts to support widespread EV adoption and address infrastructure barriers.", "update": "2025-02-23", "current": 1.0, "category": "stock"}, {"company": "Nikola Corporation", "symbol": "NKLA", "statement": "Nikola Corporation, a pioneer in electric and hydrogen-powered transportation, has filed for Chapter 11 bankruptcy protection. The company, which was once a darling of Wall Street, has struggled to raise capital and stabilize its balance sheet, leaving it with only $47 million in cash reserves. Nikola's bankruptcy filing marks a significant setback for the electric vehicle industry, which has been touted as a key solution to reducing emissions and mitigating climate change. Despite its struggles, Nikola has made significant investments in its hydrogen-powered trucks, which could potentially lead to a broader industry shift towards sustainable freight solutions.", "keywords": ["sustainable", "pioneer", "capital", "hydrogen", "solution", "climate", "electric", "industry", "transportation", "trucks", "bankruptcy", "balance", "emissions", "freight", "sheet"], "sentiment": "negative", "upside": -4215.4, "linked": [], "volume": 41875224.0, "introduction": "Nikola Corporation, a pioneer in electric and hydrogen-powered transportation, has filed for Chapter 11 bankruptcy protection due to struggles to raise capital and stabilize its balance sheet.", "update": "2025-02-23", "current": 0.91, "category": "stock"}, {"company": "CSX Corp", "symbol": "CSX", "statement": "CSX Corporation is a transportation company that provides rail-based freight transportation services, including traditional rail service, intermodal containers and trailers, and bulk commodity operations. The company's CEO, Joe Hinrichs, has been working to repair the railroad's damaged relationship with its employees, focusing on building a culture of respect and trust. Institutional investors and hedge funds own a significant portion of the company's stock, reflecting confidence in its future prospects. The company has received a consensus rating of Moderate Buy and has been the subject of strong analyst interest, with 13 research reports in the past 90 days.", "keywords": ["research", "commodity", "reports", "transportation", "rating", "freight", "employees", "respect", "containers", "trailers", "buy", "investors", "hedge", "interest", "trust", "services", "institutional", "bulk", "ceo", "prospects", "funds", "rail", "culture", "operations", "stock"], "sentiment": "positive", "upside": -71.3, "linked": [], "volume": 24741722.0, "introduction": "CSX Corporation is a rail-based freight transportation company that is working to repair its relationship with employees and has received a consensus rating of Moderate Buy with strong analyst interest.", "update": "2025-02-23", "current": 32.69, "category": "stock"}, {"company": "SES AI Corp", "symbol": "SES", "statement": "SES AI Corporation is a company that develops and produces high-performance Lithium-metal rechargeable batteries for electric vehicles, electric take-off and landing, and other applications. The company was founded in 2012 and is headquartered in Massachusetts. The company has signed contracts worth up to $10 million to develop AI-enhanced Li-Metal and Li-ion batteries for electric vehicles with two automotive OEM partners. Analysts predict a 39.66% upside from the current stock price of $0.90, with a target price of $1.25. The company has had insider sales and has a current ratio of 15.24 and a debt-to-equity ratio of 0.04.", "keywords": ["rechargeable", "corporation", "vehicles", "insider", "debt", "analysts", "ratio", "automotive", "partners", "equity", "target", "ai", "electric", "batteries", "upside", "lithium", "sales", "massachusetts", "metal", "stock", "price"], "sentiment": "positive", "upside": -193.7, "linked": [], "volume": 66331300.0, "introduction": "SES AI Corporation develops high-performance Lithium-metal rechargeable batteries for various applications, including electric vehicles, and has secured contracts worth up to $10 million with two automotive partners.", "update": "2025-02-23", "current": 1.13, "category": "stock"}, {"company": "Blue Hat Interactive Entertainment Technology", "symbol": "BHAT", "statement": "Blue Hat Interactive Entertainment Technology (BHAT) is a Nasdaq-listed company that has completed a $29.8 million issuance of ordinary shares. The company reported a loss of $1.23 per share for its full year 2022, compared to a loss of $11.60 per share in the previous year. BHAT has partnered with a new partner to launch a gold supply chain business. The company's stock has been declining, with a 95.54% drop in the past year and a 72.22% decline in the past quarter. The company's market capitalization is $71.7 million, and its stock has been down 28.57% in the past week.", "keywords": ["technology", "partner", "listed", "entertainment", "loss", "supply", "decline", "shares", "capitalization"], "sentiment": "negative", "upside": -591.8, "linked": [], "volume": 40276130.0, "introduction": "Blue Hat Interactive Entertainment Technology (BHAT) has completed a $29.8 million share issuance, reported a loss of $1.23 per share for 2022, and has partnered with a new partner to launch a gold supply chain business.", "update": "2025-02-23", "current": 0.06, "category": "stock"}, {"company": "ADiTx Therapeutics Inc", "symbol": "ADTX", "statement": "Aditxt, Inc. (ADTX) is a biotech company that develops and commercializes technologies to improve health through monitoring and modulating the immune system. The company has a license agreement with Loma Linda University and Leland Stanford Junior University, and its subsidiary, Pearsanta, has engaged Dominari Securities for its initial public offering. Aditxt's stock price has fluctuated recently, with a 57.14% gain on the last trading day, but has still experienced a 86.16% loss since October 2024. The company is set to host a fireside chat on February 21st and has announced a 1-for-40 reverse stock split for Nasdaq compliance.", "keywords": ["license", "offering", "biotech", "immune", "loss", "gain", "public", "agreement", "split", "health", "monitoring", "compliance", "securities", "fluctuated", "reverse"], "sentiment": "negative", "upside": -12138.3, "linked": [], "volume": 23388628.0, "introduction": "Aditxt, Inc. is a biotech company developing immune system monitoring and modulation technologies, with a fluctuating stock price that has seen a 57.14% gain on the last trading day and an 86.16% loss since October 2024.", "update": "2025-02-23", "current": 0.12, "category": "stock"}, {"company": "CNS Pharmaceuticals Inc", "symbol": "CNSP", "statement": "CNS Pharmaceuticals, a biopharmaceutical company, will present at the 6th Glioblastoma Drug Development Summit in Boston, MA, on February 18-20, 2025. The company's CEO will outline five key reasons to follow CNS in 2025, focusing on its advancements in developing treatments for primary and metastatic brain and central nervous system cancers. Additionally, the company's Chief Medical Officer will present at the summit on February 20, discussing novel formulations of anthracyclines and taxanes designed to cross the blood-brain barrier.", "keywords": ["cancers", "development", "glioblastoma", "summit", "cancer", "brain", "biopharmaceutical", "barrier", "treatments", "formulations"], "sentiment": "positive", "upside": -1502.1, "linked": [], "volume": 29763440.0, "introduction": "CNS Pharmaceuticals will present at the Glioblastoma Drug Development Summit in Boston, MA, on February 18-20, 2025, highlighting its advancements in treating brain and central nervous system cancers and novel formulations of anthracyclines and taxanes.", "update": "2025-02-23", "current": 0.11, "category": "stock"}, {"company": "Sealsq Corp", "symbol": "LAES", "statement": "SEALSQ Corp, a company that develops and sells semiconductors, PKI, and post-quantum technology products, has announced its commitment to providing post-quantum security solutions to the financial sector to ensure resilience against emerging quantum threats. The company has reaffirmed its ability to provide post-quantum security solutions following Microsoft's Majorana quantum breakthrough. SEALSQ has deployed its post-quantum cryptography (PQC) technology across sovereign data centers and is focused on enhancing financial sector security with post-quantum solutions. The company's solutions aim to ensure the security of financial institutions against the growing threat of quantum computing.", "keywords": ["technology", "pki", "resilience", "breakthrough", "data", "enhancing", "solutions", "threats", "financial", "post-quantum", "microsoft", "cryptography", "security", "centers", "semiconductors", "majorana", "quantum"], "sentiment": "positive", "upside": -183.5, "linked": [], "volume": 23068194.0, "introduction": "SEALSQ Corp is committed to providing post-quantum security solutions to the financial sector to ensure resilience against emerging quantum threats, following Microsoft's Majorana quantum breakthrough.", "update": "2025-02-23", "current": 4.3, "category": "stock"}, {"company": "BioXcel Therapeutics Inc", "symbol": "BTAI", "statement": "BioXcel Therapeutics (BTAI) is a biopharmaceutical company that uses artificial intelligence to develop medicines in neuroscience. The company has a drug re-innovation approach that leverages existing approved drugs and/or clinically validated product candidates with big data and proprietary machine learning algorithms to identify new therapeutic indices. The company has a pipeline of drug candidates, including BXCL504, a drug candidate to target aggression in dementia. BioXcel Therapeutics has received FDA approval for its drug Igalmi (dexmedetomidine) in agitation associated with schizophrenia and bipolar disorder, and has a phase 3 program running in Alzheimer's. The company's stock has seen a significant decline in short interest, with 9.7% of shares sold short. The stock has a price target range of $4 to $80, with an average price target representing a increase of $1344.93 from the last closing price of $2.27.", "keywords": ["schizophrenia", "approval", "neuroscience", "medicine", "biopharmaceutical", "pipeline", "artificial", "intelligence", "interest", "candidate", "dementia", "target", "bipolar", "decline", "increase", "innovation", "aggression", "disorder", "algorithms"], "sentiment": "positive", "upside": -2272.4, "linked": [], "volume": 29840332.0, "introduction": "BioXcel Therapeutics is a biotech company that uses AI to develop medicines for neuroscience, with a pipeline of drug candidates, including a FDA-approved treatment for agitation in schizophrenia and bipolar disorder, and a phase 3 program for Alzheimer's.", "update": "2025-02-23", "current": 0.34, "category": "stock"}, {"company": "Richtech Robotics Inc", "symbol": "RR", "statement": "Richtech Robotics, a company that went public in 2023, has launched a café with a talking humanoid barista and has deployed over 300 robot solutions across the country. The company has also launched an accelerator program to provide U.S. universities with development frameworks and access to their robotic systems to aid robotics research. Additionally, Richtech has opened a new brand, ADAM-centric food and beverage, at a Town Square location, and has filed its FY2024 annual report and Q1/FY2025 report with the SEC.", "keywords": ["research", "public", "solutions", "systems", "accelerator", "report", "frameworks", "sec", "café", "humanoid", "universities", "robotics", "barista"], "sentiment": "positive", "upside": -123.6, "linked": [], "volume": 25294012.0, "introduction": "Richtech Robotics, a company that went public in 2023, has launched a café with a talking humanoid barista, deployed 300+ robot solutions, and expanded its initiatives through an accelerator program and new food and beverage brand.", "update": "2025-02-23", "current": 3.31, "category": "stock"}, {"company": "Kopin Corp", "symbol": "KOPN", "statement": "Kopin Corporation, a leading provider of application-specific optical systems and high-performance microdisplays, will participate in the Oppenheimer 10th Annual Emerging Growth Conference on February 25-26, 2025. The virtual conference will feature CEO Michael Murray and CFO Rich Sneider hosting one-on-one meetings with institutional investors. The company will also highlight its growth opportunities, including its industrial and consumer product offerings, as well as recent industrial projects and partnerships.", "keywords": ["emerging", "industrial", "optical", "partnerships", "systems", "investors", "cfo", "microdisplays", "growth", "displays", "conference", "ceo", "consumer"], "sentiment": "positive", "upside": -175.1, "linked": [], "volume": 24496832.0, "introduction": "Kopin Corporation will participate in the Oppenheimer Emerging Growth Conference on February 25-26, 2025, with CEO Michael Murray and CFO Rich Sneider hosting one-on-one meetings and highlighting growth opportunities.", "update": "2025-02-23", "current": 2.03, "category": "stock"}, {"company": "Aclarion Inc", "symbol": "ACON", "statement": "Aclarion, a healthcare technology company, will showcase its groundbreaking NOCISCAN technology at the 2025 Spine Summit. NOCISCAN is an innovative decision support tool that helps physicians personalize treatment for chronic low back pain by combining MR Spectroscopy and augmented intelligence (AI). The technology uses biomarkers and proprietary AI algorithms to identify the location of chronic low back pain, and Dr. Nicholas Theodore will highlight its capabilities at the summit.", "keywords": ["technology", "back", "biomarkers", "support", "low", "ai", "pain", "spectroscopy", "decision", "healthcare", "algorithms", "nociscan", "personalization", "summit", "tool", "mr"], "sentiment": "positive", "upside": -792.2, "linked": [], "volume": 65850400.0, "introduction": "Aclarion will showcase its NOCISCAN technology at the 2025 Spine Summit, a decision support tool that uses MR Spectroscopy and AI to personalize treatment for chronic low back pain.", "update": "2025-02-23", "current": 0.04, "category": "stock"}, {"company": "SPI Energy Co Ltd", "symbol": "SPI", "statement": "SPI Energy Co., Ltd. (SPIEF) is a renewable energy company that provides photovoltaic and electric vehicle solutions for various customers and investors. The company offers engineering, procurement, and construction services, develops and operates solar projects, and sells electricity to power companies and other off-takers. SPIEF has operations in Australia, Japan, Italy, the US, the UK, and Greece. The company's stock price and latest news are available on various financial websites.", "keywords": ["energy", "renewable", "projects", "websites", "procurement", "solutions", "vehicle", "electricity", "companies", "financial", "power", "engineering", "electric", "solar", "investors", "operations", "photovoltaic", "construction"], "sentiment": "positive", "upside": -893.7, "linked": [], "volume": 135038940.0, "introduction": "SPI Energy Co., Ltd. is a renewable energy company that provides photovoltaic and electric vehicle solutions, offering engineering, procurement, and construction services, and develops and operates solar projects in multiple countries.", "update": "2025-02-23", "current": 0.68, "category": "stock"}, {"company": "Snow Lake Resources Ltd", "symbol": "LITM", "statement": "Snow Lake Energy, a uranium exploration and development company, has acquired a 100% interest in the Buffalo Uranium Project in Wyoming, USA. The acquisition involves an initial cash payment of $50,000, a closing cash payment of $200,000, and the allotment of shares valued at $400,000. The deal is subject to certain conditions, including the exercise of an option by Bazooka, and additional milestone payments of $450,000 tied to achieving specific resource targets.", "keywords": ["acquisition", "energy", "buffalo", "milestone", "uranium", "mining", "project", "payment", "wyoming", "usa", "shares", "conditions", "option"], "sentiment": "positive", "upside": -130.1, "linked": [], "volume": 32566096.0, "introduction": "Snow Lake Energy acquired the Buffalo Uranium Project in Wyoming, USA for $650,000, comprising an initial cash payment, closing cash payment, and share allotment, subject to certain conditions and milestone payments.", "update": "2025-02-23", "current": 1.39, "category": "stock"}, {"company": "Cellect Biotechnology Ltd", "symbol": "QNRX", "statement": "Cellevate, a Swedish biotech company, has launched its Cellevat3d nanofiber-based cell culture system in the US. The company's technology uses sustainable nanofibers to improve cell and gene therapy manufacturing. Other news includes Cellect Biotechnology's quarterly earnings report, Creative Medical Technology Holdings' support for President Trump's initiative on in vitro fertilization, and Bonus Biogroup's FDA approval for its tissue engineering product. Additionally, there were updates on cell and gene therapy advancements, the inhalation anesthesia market size, and contract manufacturing trends in the biopharmaceutical industry.", "keywords": ["technology", "market", "trends", "initiative", "biotech", "sustainable", "approval", "therapy", "report", "manufacturing", "cell", "engineering", "advancements", "earnings", "fertilization", "nanofiber", "gene"], "sentiment": "positive", "upside": -637.6, "linked": [], "volume": 60422240.0, "introduction": "Cellevate, a Swedish biotech company, has launched its Cellevat3d nanofiber-based cell culture system in the US, which uses sustainable nanofibers to improve cell and gene therapy manufacturing.", "update": "2025-02-23", "current": 0.41, "category": "stock"}, {"company": "Save Foods Inc", "symbol": "NITO", "statement": "Innovative Food Holdings, Inc. (IVFH) has announced the expansion of its gourmet cheese offerings. Meanwhile, RFID Journal LIVE! 2025 is set to feature cutting-edge solutions in healthcare, food, and pharma. Small businesses are competing with big brands through innovative manufacturing strategies, such as Spindrift and RXBAR. Five startup-driven technologies are reshaping the future of food production, including precision fermentation and advanced material recovery systems. The winners of the Innovate Forward: The Healthy Aging Challenge have been announced, and US Foods Holding Corp is one of the largest food distribution companies in the US. The FDA has added eggs to its list of healthy foods, and Innovative Food Holdings Inc is a company that offers gourmet food products and subscription-based services.", "keywords": ["fermentation", "manufacturing", "rfid", "systems", "healthcare", "pharma", "brands", "healthy", "expansion", "innovative", "food", "fda", "strategies", "services", "eggs", "recovery", "gourmet", "subscription", "distribution", "challenge", "aging", "holdings"], "sentiment": "positive", "upside": -234.4, "linked": [], "volume": 122185940.0, "introduction": "Innovative Food Holdings, Inc. and other companies are driving innovation in the food industry through gourmet cheese offerings, new manufacturing strategies, and technologies like precision fermentation and material recovery systems.", "update": "2025-02-23", "current": 1.17, "category": "stock"}, {"company": "Evaxion Biotech A/S", "symbol": "EVAX", "statement": "Evaxion Biotech A/S (EVAX) is a clinical-stage biotech company developing artificial intelligence-powered immunotherapies. Its stock has decreased by 92.47% since its IPO, with a compound annual growth rate of -49.93%. The stock price has decreased by 87.55% in the last 52 weeks, with a beta of -0.27 indicating lower price volatility than the market average. Three analysts have a 12-month price target of $33.33, with a low estimate of $6.00 and a high estimate of $80. The company is developing EVX-01 and EVX-02, which are in phase 2 and phase 1/2a trials, respectively, for the treatment of metastatic melanoma and other cancers.", "keywords": ["immunotherapies", "biotech", "volatility", "artificial", "ipo", "beta", "intelligence", "target", "melanoma", "cancer", "treatment", "growth", "estimate", "stock"], "sentiment": "negative", "upside": -1554.8, "linked": [], "volume": 55592724.0, "introduction": "Evaxion Biotech A/S, a clinical-stage biotech company, has seen its stock price plummet 92.47% since its IPO, with a 12-month price target of $33.33 from three analysts.", "update": "2025-02-23", "current": 6.03, "category": "stock"}, {"company": "Windtree Therapeutics Inc", "symbol": "WINT", "statement": "Windtree Therapeutics, Inc. has announced a 1-for-50 reverse stock split, approved by its board of directors and shareholders. The company, focused on developing innovative therapies for critical conditions and diseases, aims to achieve stability and potentially attract investors through this strategic move. The reverse stock split will become effective on February 21, 2025, and will change the CUSIP number to 97382D600. The company's stockholders approved the proposal, and analysts predict a potential increase in stability and investor interest.", "keywords": ["board", "therapeutics", "split", "stability", "prediction", "investors", "shareholders", "innovation", "analysts", "cusip", "stock"], "sentiment": "positive", "upside": -2551.6, "linked": [], "volume": 52615884.0, "introduction": "Windtree Therapeutics is conducting a 1-for-50 reverse stock split to achieve stability and attract investors, effective February 21, 2025.", "update": "2025-02-23", "current": 0.18, "category": "stock"}, {"company": "GlucoTrack Inc", "symbol": "GCTK", "statement": "GlucoTrack, Inc. is a medical device company focused on developing novel technologies for people with diabetes and prediabetes. The company is working on a long-term implantable continuous glucose monitoring system and has completed its first human clinical study. GlucoTrack has announced the pricing of a $3 million public offering and has named a new vice president of clinical operations. The company's products are designed to provide non-invasive glucose monitoring for people with diabetes and prediabetes, and its innovative technology has resonated with patients, according to a recent survey. The company's stock price has been fluctuating, with a recent 40.36% loss over the past 10 days.", "keywords": ["technology", "glucose", "products", "president", "fluctuating", "implantable", "offering", "vice", "clinical", "medical", "survey", "study", "pricing", "device", "company", "diabetes", "monitoring", "operations", "stock"], "sentiment": "negative", "upside": -5239.8, "linked": [], "volume": 31951254.0, "introduction": "GlucoTrack, Inc. is a medical device company developing a long-term implantable continuous glucose monitoring system for people with diabetes and prediabetes, and has completed its first human clinical study and priced a $3 million public offering.", "update": "2025-02-23", "current": 0.09, "category": "stock"}, {"company": "Hepion Pharmaceuticals Inc", "symbol": "HEPA", "statement": "Hepion Pharmaceuticals, Inc. is a clinical-stage biopharmaceutical company focused on artificial intelligence-driven therapeutic drug development for non-alcoholic steatohepatitis (NASH) and other diseases. The company was incorporated in 2013 and is headquartered in New Jersey. Hepion Pharmaceuticals has a market capitalization of $2.018 million and has raised $1.50 million in cash and $2.22 million in debt. The company's stock price is $0.1900, with a 30-day average volume of 440,167 shares. There have been recent insider trading activities and stock price movements, with some analysts rating the company as \"hold\" or \"buy\".", "keywords": ["biotech", "artificial", "intelligence", "therapeutic", "trading", "company", "insider", "pharmaceuticals", "disease", "nash", "stock", "analyst", "capitalization"], "sentiment": "positive", "upside": -8255.4, "linked": [], "volume": 534644670.0, "introduction": "Hepion Pharmaceuticals is a clinical-stage biopharmaceutical company focused on developing AI-driven therapies for NASH and other diseases, with a market capitalization of $2.018 million and a current stock price of $0.1900.", "update": "2025-02-23", "current": 0.2, "category": "stock"}, {"company": "China Liberal Education Holdings Ltd", "symbol": "CLEU", "statement": "China Liberal Education Holdings Limited (CLEU) is a company that provides educational services and products under the China Liberal brand name in China. The company operates in five segments, including Sino-foreign jointly managed academic programs, textbooks and course material sales, overseas study consulting services, and technological consulting services. The company's revenue has decreased by 83.63% year-over-year, with a current ratio of 16.25 and a debt-to-equity ratio of 0. The company's market capitalization has decreased by 5.84% since May 2020, and its stock price has been fluctuating.", "keywords": ["technology", "products", "programs", "debt", "stock", "consulting", "ratio", "china", "equity", "textbooks", "revenue", "education", "limited", "services", "sales", "segments", "capitalization", "liberal", "company", "brand", "holdings", "market"], "sentiment": "negative", "upside": -124.2, "linked": ["ELAB : Elevai Labs, a skincare company listed on NASDAQ under ELAB, uses cutting-edge science to develop products that improve skin health and has a subsidiary focused on aesthetic medicines."], "volume": 26378912.0, "introduction": "China Liberal Education Holdings Limited (CLEU) provides educational services and products in China, with revenue decreasing by 83.63% year-over-year and a fluctuating stock price.", "update": "2025-02-23", "current": 7.11, "category": "stock"}, {"company": "Starbox Group Holdings Ltd", "symbol": "STBX", "statement": "Starbox Group Holdings Ltd. (Nasdaq: STBX) has secured trademark registrations in the Philippines, marking an expansion of its reach in Southeast Asia. The company, which provides cash rebates, advertising, and payment solutions, aims to become a comprehensive artificial intelligence (AI) provider in the region. The trademark registrations are a significant milestone for Starbox, which has been working to establish its presence in the Philippines and other parts of Southeast Asia.", "keywords": ["provider", "advertising", "southeast", "stbx", "artificial", "asia", "solutions", "starbox", "cashback", "intelligence", "ai", "nasdaq", "payment", "philippines"], "sentiment": "positive", "upside": -969.9, "linked": [], "volume": 43502772.0, "introduction": "Starbox Group Holdings Ltd. has secured trademark registrations in the Philippines, expanding its reach in Southeast Asia and aiming to become a comprehensive AI provider in the region.", "update": "2025-02-23", "current": 0.58, "category": "stock"}]